use core::arch::asm;

/// A function pointer with the Amiga calling convention
///
/// Parameters and the return value are passed in the CPU registers (this is not the "C"
/// calling convention). The ROM kernel manuals have documented which registers to use.
pub type FPTR = usize;

/* automatically modified by the amiga-sys tools */
/* automatically generated by rust-bindgen 0.72.0 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());

pub const NO_ICON_POSITION: u32 = 2147483648;
pub const WORKBENCH_NAME: &[u8; 18] = b"workbench.library\0";
pub const AM_VERSION: u32 = 1;
pub const AMTYPE_APPWINDOW: u32 = 7;
pub const AMTYPE_APPICON: u32 = 8;
pub const AMTYPE_APPMENUITEM: u32 = 9;
pub const AMTYPE_APPWINDOWZONE: u32 = 10;
pub const AMCLASSICON_Open: u32 = 0;
pub const AMCLASSICON_Copy: u32 = 1;
pub const AMCLASSICON_Rename: u32 = 2;
pub const AMCLASSICON_Information: u32 = 3;
pub const AMCLASSICON_Snapshot: u32 = 4;
pub const AMCLASSICON_UnSnapshot: u32 = 5;
pub const AMCLASSICON_LeaveOut: u32 = 6;
pub const AMCLASSICON_PutAway: u32 = 7;
pub const AMCLASSICON_Delete: u32 = 8;
pub const AMCLASSICON_FormatDisk: u32 = 9;
pub const AMCLASSICON_EjectDisk: u32 = 13;
pub const AMCLASSICON_EmptyTrash: u32 = 10;
pub const AMCLASSICON_Selected: u32 = 11;
pub const AMCLASSICON_Unselected: u32 = 12;
pub const SCHMSTATE_TryCleanup: u32 = 0;
pub const SCHMSTATE_Cleanup: u32 = 1;
pub const SCHMSTATE_Setup: u32 = 2;
pub const WBF_DRAWERPOSMASK: u32 = 3;
pub const WBF_DRAWERPOSFREE: u32 = 0;
pub const WBF_DRAWERPOSHEAD: u32 = 1;
pub const WBF_DRAWERPOSTAIL: u32 = 2;
pub const WBF_BOUNDTEXTVIEW: u32 = 128;
pub const WBF_OLDDATESFIRST: u32 = 65536;
pub const WBO_NONE: u32 = 0;
pub const WBO_DRAWER: u32 = 1;
pub const WBO_ICON: u32 = 2;
pub const ADZMACTION_Enter: u32 = 0;
pub const ADZMACTION_Leave: u32 = 1;
pub const ISMACTION_Unselect: u32 = 0;
pub const ISMACTION_Select: u32 = 1;
pub const ISMACTION_Ignore: u32 = 2;
pub const ISMACTION_Stop: u32 = 3;
pub const CPACTION_Begin: u32 = 0;
pub const CPACTION_Copy: u32 = 1;
pub const CPACTION_End: u32 = 2;
pub const DLACTION_BeginDiscard: u32 = 0;
pub const DLACTION_BeginEmptyTrash: u32 = 1;
pub const DLACTION_DeleteContents: u32 = 3;
pub const DLACTION_DeleteObject: u32 = 4;
pub const DLACTION_End: u32 = 5;
pub const TIACTION_Rename: u32 = 0;
pub const TIACTION_RelabelVolume: u32 = 1;
pub const TIACTION_NewDrawer: u32 = 2;
pub const TIACTION_Execute: u32 = 3;
pub const UPDATEWB_ObjectRemoved: u32 = 0;
pub const UPDATEWB_ObjectAdded: u32 = 1;
pub type APTR = *mut ::core::ffi::c_void;
pub type CONST_APTR = *const ::core::ffi::c_void;
pub type LONG = i32;
pub type ULONG = u32;
pub type LONGBITS = u32;
pub type WORD = i16;
pub type UWORD = u16;
pub type WORDBITS = u16;
pub type BYTE = i8;
pub type UBYTE = u8;
pub type BYTEBITS = u8;
pub type RPTR = u16;
pub type SHORT = i16;
pub type USHORT = u16;
pub type COUNT = i16;
pub type UCOUNT = u16;
pub type CPTR = u32;
pub type STRPTR = *mut ::core::ffi::c_uchar;
pub type CONST_STRPTR = *const ::core::ffi::c_uchar;
pub type FLOAT = f32;
pub type DOUBLE = f64;
pub type TEXT = ::core::ffi::c_uchar;
pub type BOOL = i16;
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct Node {
    pub ln_Succ: *mut Node,
    pub ln_Pred: *mut Node,
    pub ln_Type: UBYTE,
    pub ln_Pri: BYTE,
    pub ln_Name: *mut ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Node"][::core::mem::size_of::<Node>() - 14usize];
    ["Alignment of Node"][::core::mem::align_of::<Node>() - 2usize];
    ["Offset of field: Node::ln_Succ"][::core::mem::offset_of!(Node, ln_Succ) - 0usize];
    ["Offset of field: Node::ln_Pred"][::core::mem::offset_of!(Node, ln_Pred) - 4usize];
    ["Offset of field: Node::ln_Type"][::core::mem::offset_of!(Node, ln_Type) - 8usize];
    ["Offset of field: Node::ln_Pri"][::core::mem::offset_of!(Node, ln_Pri) - 9usize];
    ["Offset of field: Node::ln_Name"][::core::mem::offset_of!(Node, ln_Name) - 10usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct MinNode {
    pub mln_Succ: *mut MinNode,
    pub mln_Pred: *mut MinNode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MinNode"][::core::mem::size_of::<MinNode>() - 8usize];
    ["Alignment of MinNode"][::core::mem::align_of::<MinNode>() - 2usize];
    ["Offset of field: MinNode::mln_Succ"][::core::mem::offset_of!(MinNode, mln_Succ) - 0usize];
    ["Offset of field: MinNode::mln_Pred"][::core::mem::offset_of!(MinNode, mln_Pred) - 4usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct List {
    pub lh_Head: *mut Node,
    pub lh_Tail: *mut Node,
    pub lh_TailPred: *mut Node,
    pub lh_Type: UBYTE,
    pub l_pad: UBYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of List"][::core::mem::size_of::<List>() - 14usize];
    ["Alignment of List"][::core::mem::align_of::<List>() - 2usize];
    ["Offset of field: List::lh_Head"][::core::mem::offset_of!(List, lh_Head) - 0usize];
    ["Offset of field: List::lh_Tail"][::core::mem::offset_of!(List, lh_Tail) - 4usize];
    ["Offset of field: List::lh_TailPred"][::core::mem::offset_of!(List, lh_TailPred) - 8usize];
    ["Offset of field: List::lh_Type"][::core::mem::offset_of!(List, lh_Type) - 12usize];
    ["Offset of field: List::l_pad"][::core::mem::offset_of!(List, l_pad) - 13usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct MinList {
    pub mlh_Head: *mut MinNode,
    pub mlh_Tail: *mut MinNode,
    pub mlh_TailPred: *mut MinNode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MinList"][::core::mem::size_of::<MinList>() - 12usize];
    ["Alignment of MinList"][::core::mem::align_of::<MinList>() - 2usize];
    ["Offset of field: MinList::mlh_Head"][::core::mem::offset_of!(MinList, mlh_Head) - 0usize];
    ["Offset of field: MinList::mlh_Tail"][::core::mem::offset_of!(MinList, mlh_Tail) - 4usize];
    ["Offset of field: MinList::mlh_TailPred"]
        [::core::mem::offset_of!(MinList, mlh_TailPred) - 8usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct Resident {
    pub rt_MatchWord: UWORD,
    pub rt_MatchTag: *mut Resident,
    pub rt_EndSkip: APTR,
    pub rt_Flags: UBYTE,
    pub rt_Version: UBYTE,
    pub rt_Type: UBYTE,
    pub rt_Pri: BYTE,
    pub rt_Name: *mut ::core::ffi::c_char,
    pub rt_IdString: *mut ::core::ffi::c_char,
    pub rt_Init: APTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Resident"][::core::mem::size_of::<Resident>() - 26usize];
    ["Alignment of Resident"][::core::mem::align_of::<Resident>() - 2usize];
    ["Offset of field: Resident::rt_MatchWord"]
        [::core::mem::offset_of!(Resident, rt_MatchWord) - 0usize];
    ["Offset of field: Resident::rt_MatchTag"]
        [::core::mem::offset_of!(Resident, rt_MatchTag) - 2usize];
    ["Offset of field: Resident::rt_EndSkip"]
        [::core::mem::offset_of!(Resident, rt_EndSkip) - 6usize];
    ["Offset of field: Resident::rt_Flags"][::core::mem::offset_of!(Resident, rt_Flags) - 10usize];
    ["Offset of field: Resident::rt_Version"]
        [::core::mem::offset_of!(Resident, rt_Version) - 11usize];
    ["Offset of field: Resident::rt_Type"][::core::mem::offset_of!(Resident, rt_Type) - 12usize];
    ["Offset of field: Resident::rt_Pri"][::core::mem::offset_of!(Resident, rt_Pri) - 13usize];
    ["Offset of field: Resident::rt_Name"][::core::mem::offset_of!(Resident, rt_Name) - 14usize];
    ["Offset of field: Resident::rt_IdString"]
        [::core::mem::offset_of!(Resident, rt_IdString) - 18usize];
    ["Offset of field: Resident::rt_Init"][::core::mem::offset_of!(Resident, rt_Init) - 22usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct MemChunk {
    pub mc_Next: *mut MemChunk,
    pub mc_Bytes: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MemChunk"][::core::mem::size_of::<MemChunk>() - 8usize];
    ["Alignment of MemChunk"][::core::mem::align_of::<MemChunk>() - 2usize];
    ["Offset of field: MemChunk::mc_Next"][::core::mem::offset_of!(MemChunk, mc_Next) - 0usize];
    ["Offset of field: MemChunk::mc_Bytes"][::core::mem::offset_of!(MemChunk, mc_Bytes) - 4usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct MemHeader {
    pub mh_Node: Node,
    pub mh_Attributes: UWORD,
    pub mh_First: *mut MemChunk,
    pub mh_Lower: APTR,
    pub mh_Upper: APTR,
    pub mh_Free: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MemHeader"][::core::mem::size_of::<MemHeader>() - 32usize];
    ["Alignment of MemHeader"][::core::mem::align_of::<MemHeader>() - 2usize];
    ["Offset of field: MemHeader::mh_Node"][::core::mem::offset_of!(MemHeader, mh_Node) - 0usize];
    ["Offset of field: MemHeader::mh_Attributes"]
        [::core::mem::offset_of!(MemHeader, mh_Attributes) - 14usize];
    ["Offset of field: MemHeader::mh_First"]
        [::core::mem::offset_of!(MemHeader, mh_First) - 16usize];
    ["Offset of field: MemHeader::mh_Lower"]
        [::core::mem::offset_of!(MemHeader, mh_Lower) - 20usize];
    ["Offset of field: MemHeader::mh_Upper"]
        [::core::mem::offset_of!(MemHeader, mh_Upper) - 24usize];
    ["Offset of field: MemHeader::mh_Free"][::core::mem::offset_of!(MemHeader, mh_Free) - 28usize];
};
#[repr(C, packed(2))]
#[derive(Copy, Clone)]
pub struct MemEntry {
    pub me_Un: MemEntry__bindgen_ty_1,
    pub me_Length: ULONG,
}
#[repr(C, packed(2))]
#[derive(Copy, Clone)]
pub union MemEntry__bindgen_ty_1 {
    pub meu_Reqs: ULONG,
    pub meu_Addr: APTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MemEntry__bindgen_ty_1"][::core::mem::size_of::<MemEntry__bindgen_ty_1>() - 4usize];
    ["Alignment of MemEntry__bindgen_ty_1"]
        [::core::mem::align_of::<MemEntry__bindgen_ty_1>() - 2usize];
    ["Offset of field: MemEntry__bindgen_ty_1::meu_Reqs"]
        [::core::mem::offset_of!(MemEntry__bindgen_ty_1, meu_Reqs) - 0usize];
    ["Offset of field: MemEntry__bindgen_ty_1::meu_Addr"]
        [::core::mem::offset_of!(MemEntry__bindgen_ty_1, meu_Addr) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MemEntry"][::core::mem::size_of::<MemEntry>() - 8usize];
    ["Alignment of MemEntry"][::core::mem::align_of::<MemEntry>() - 2usize];
    ["Offset of field: MemEntry::me_Un"][::core::mem::offset_of!(MemEntry, me_Un) - 0usize];
    ["Offset of field: MemEntry::me_Length"][::core::mem::offset_of!(MemEntry, me_Length) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct MemList {
    pub ml_Node: Node,
    pub ml_NumEntries: UWORD,
    pub ml_ME: [MemEntry; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MemList"][::core::mem::size_of::<MemList>() - 24usize];
    ["Alignment of MemList"][::core::mem::align_of::<MemList>() - 2usize];
    ["Offset of field: MemList::ml_Node"][::core::mem::offset_of!(MemList, ml_Node) - 0usize];
    ["Offset of field: MemList::ml_NumEntries"]
        [::core::mem::offset_of!(MemList, ml_NumEntries) - 14usize];
    ["Offset of field: MemList::ml_ME"][::core::mem::offset_of!(MemList, ml_ME) - 16usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct MemHandlerData {
    pub memh_RequestSize: ULONG,
    pub memh_RequestFlags: ULONG,
    pub memh_Flags: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MemHandlerData"][::core::mem::size_of::<MemHandlerData>() - 12usize];
    ["Alignment of MemHandlerData"][::core::mem::align_of::<MemHandlerData>() - 2usize];
    ["Offset of field: MemHandlerData::memh_RequestSize"]
        [::core::mem::offset_of!(MemHandlerData, memh_RequestSize) - 0usize];
    ["Offset of field: MemHandlerData::memh_RequestFlags"]
        [::core::mem::offset_of!(MemHandlerData, memh_RequestFlags) - 4usize];
    ["Offset of field: MemHandlerData::memh_Flags"]
        [::core::mem::offset_of!(MemHandlerData, memh_Flags) - 8usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct Task {
    pub tc_Node: Node,
    pub tc_Flags: UBYTE,
    pub tc_State: UBYTE,
    pub tc_IDNestCnt: BYTE,
    pub tc_TDNestCnt: BYTE,
    pub tc_SigAlloc: ULONG,
    pub tc_SigWait: ULONG,
    pub tc_SigRecvd: ULONG,
    pub tc_SigExcept: ULONG,
    pub tc_TrapAlloc: UWORD,
    pub tc_TrapAble: UWORD,
    pub tc_ExceptData: APTR,
    pub tc_ExceptCode: APTR,
    pub tc_TrapData: APTR,
    pub tc_TrapCode: APTR,
    pub tc_SPReg: APTR,
    pub tc_SPLower: APTR,
    pub tc_SPUpper: APTR,
    pub tc_Switch: FPTR,
    pub tc_Launch: FPTR,
    pub tc_MemEntry: List,
    pub tc_UserData: APTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Task"][::core::mem::size_of::<Task>() - 92usize];
    ["Alignment of Task"][::core::mem::align_of::<Task>() - 2usize];
    ["Offset of field: Task::tc_Node"][::core::mem::offset_of!(Task, tc_Node) - 0usize];
    ["Offset of field: Task::tc_Flags"][::core::mem::offset_of!(Task, tc_Flags) - 14usize];
    ["Offset of field: Task::tc_State"][::core::mem::offset_of!(Task, tc_State) - 15usize];
    ["Offset of field: Task::tc_IDNestCnt"][::core::mem::offset_of!(Task, tc_IDNestCnt) - 16usize];
    ["Offset of field: Task::tc_TDNestCnt"][::core::mem::offset_of!(Task, tc_TDNestCnt) - 17usize];
    ["Offset of field: Task::tc_SigAlloc"][::core::mem::offset_of!(Task, tc_SigAlloc) - 18usize];
    ["Offset of field: Task::tc_SigWait"][::core::mem::offset_of!(Task, tc_SigWait) - 22usize];
    ["Offset of field: Task::tc_SigRecvd"][::core::mem::offset_of!(Task, tc_SigRecvd) - 26usize];
    ["Offset of field: Task::tc_SigExcept"][::core::mem::offset_of!(Task, tc_SigExcept) - 30usize];
    ["Offset of field: Task::tc_TrapAlloc"][::core::mem::offset_of!(Task, tc_TrapAlloc) - 34usize];
    ["Offset of field: Task::tc_TrapAble"][::core::mem::offset_of!(Task, tc_TrapAble) - 36usize];
    ["Offset of field: Task::tc_ExceptData"]
        [::core::mem::offset_of!(Task, tc_ExceptData) - 38usize];
    ["Offset of field: Task::tc_ExceptCode"]
        [::core::mem::offset_of!(Task, tc_ExceptCode) - 42usize];
    ["Offset of field: Task::tc_TrapData"][::core::mem::offset_of!(Task, tc_TrapData) - 46usize];
    ["Offset of field: Task::tc_TrapCode"][::core::mem::offset_of!(Task, tc_TrapCode) - 50usize];
    ["Offset of field: Task::tc_SPReg"][::core::mem::offset_of!(Task, tc_SPReg) - 54usize];
    ["Offset of field: Task::tc_SPLower"][::core::mem::offset_of!(Task, tc_SPLower) - 58usize];
    ["Offset of field: Task::tc_SPUpper"][::core::mem::offset_of!(Task, tc_SPUpper) - 62usize];
    ["Offset of field: Task::tc_Switch"][::core::mem::offset_of!(Task, tc_Switch) - 66usize];
    ["Offset of field: Task::tc_Launch"][::core::mem::offset_of!(Task, tc_Launch) - 70usize];
    ["Offset of field: Task::tc_MemEntry"][::core::mem::offset_of!(Task, tc_MemEntry) - 74usize];
    ["Offset of field: Task::tc_UserData"][::core::mem::offset_of!(Task, tc_UserData) - 88usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct StackSwapStruct {
    pub stk_Lower: APTR,
    pub stk_Upper: ULONG,
    pub stk_Pointer: APTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StackSwapStruct"][::core::mem::size_of::<StackSwapStruct>() - 12usize];
    ["Alignment of StackSwapStruct"][::core::mem::align_of::<StackSwapStruct>() - 2usize];
    ["Offset of field: StackSwapStruct::stk_Lower"]
        [::core::mem::offset_of!(StackSwapStruct, stk_Lower) - 0usize];
    ["Offset of field: StackSwapStruct::stk_Upper"]
        [::core::mem::offset_of!(StackSwapStruct, stk_Upper) - 4usize];
    ["Offset of field: StackSwapStruct::stk_Pointer"]
        [::core::mem::offset_of!(StackSwapStruct, stk_Pointer) - 8usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct MsgPort {
    pub mp_Node: Node,
    pub mp_Flags: UBYTE,
    pub mp_SigBit: UBYTE,
    pub mp_SigTask: *mut ::core::ffi::c_void,
    pub mp_MsgList: List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MsgPort"][::core::mem::size_of::<MsgPort>() - 34usize];
    ["Alignment of MsgPort"][::core::mem::align_of::<MsgPort>() - 2usize];
    ["Offset of field: MsgPort::mp_Node"][::core::mem::offset_of!(MsgPort, mp_Node) - 0usize];
    ["Offset of field: MsgPort::mp_Flags"][::core::mem::offset_of!(MsgPort, mp_Flags) - 14usize];
    ["Offset of field: MsgPort::mp_SigBit"][::core::mem::offset_of!(MsgPort, mp_SigBit) - 15usize];
    ["Offset of field: MsgPort::mp_SigTask"]
        [::core::mem::offset_of!(MsgPort, mp_SigTask) - 16usize];
    ["Offset of field: MsgPort::mp_MsgList"]
        [::core::mem::offset_of!(MsgPort, mp_MsgList) - 20usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct Message {
    pub mn_Node: Node,
    pub mn_ReplyPort: *mut MsgPort,
    pub mn_Length: UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Message"][::core::mem::size_of::<Message>() - 20usize];
    ["Alignment of Message"][::core::mem::align_of::<Message>() - 2usize];
    ["Offset of field: Message::mn_Node"][::core::mem::offset_of!(Message, mn_Node) - 0usize];
    ["Offset of field: Message::mn_ReplyPort"]
        [::core::mem::offset_of!(Message, mn_ReplyPort) - 14usize];
    ["Offset of field: Message::mn_Length"][::core::mem::offset_of!(Message, mn_Length) - 18usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct Interrupt {
    pub is_Node: Node,
    pub is_Data: APTR,
    pub is_Code: FPTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Interrupt"][::core::mem::size_of::<Interrupt>() - 22usize];
    ["Alignment of Interrupt"][::core::mem::align_of::<Interrupt>() - 2usize];
    ["Offset of field: Interrupt::is_Node"][::core::mem::offset_of!(Interrupt, is_Node) - 0usize];
    ["Offset of field: Interrupt::is_Data"][::core::mem::offset_of!(Interrupt, is_Data) - 14usize];
    ["Offset of field: Interrupt::is_Code"][::core::mem::offset_of!(Interrupt, is_Code) - 18usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct IntVector {
    pub iv_Data: APTR,
    pub iv_Code: FPTR,
    pub iv_Node: *mut Node,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IntVector"][::core::mem::size_of::<IntVector>() - 12usize];
    ["Alignment of IntVector"][::core::mem::align_of::<IntVector>() - 2usize];
    ["Offset of field: IntVector::iv_Data"][::core::mem::offset_of!(IntVector, iv_Data) - 0usize];
    ["Offset of field: IntVector::iv_Code"][::core::mem::offset_of!(IntVector, iv_Code) - 4usize];
    ["Offset of field: IntVector::iv_Node"][::core::mem::offset_of!(IntVector, iv_Node) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SoftIntList {
    pub sh_List: List,
    pub sh_Pad: UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SoftIntList"][::core::mem::size_of::<SoftIntList>() - 16usize];
    ["Alignment of SoftIntList"][::core::mem::align_of::<SoftIntList>() - 2usize];
    ["Offset of field: SoftIntList::sh_List"]
        [::core::mem::offset_of!(SoftIntList, sh_List) - 0usize];
    ["Offset of field: SoftIntList::sh_Pad"]
        [::core::mem::offset_of!(SoftIntList, sh_Pad) - 14usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct SemaphoreRequest {
    pub sr_Link: MinNode,
    pub sr_Waiter: *mut Task,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SemaphoreRequest"][::core::mem::size_of::<SemaphoreRequest>() - 12usize];
    ["Alignment of SemaphoreRequest"][::core::mem::align_of::<SemaphoreRequest>() - 2usize];
    ["Offset of field: SemaphoreRequest::sr_Link"]
        [::core::mem::offset_of!(SemaphoreRequest, sr_Link) - 0usize];
    ["Offset of field: SemaphoreRequest::sr_Waiter"]
        [::core::mem::offset_of!(SemaphoreRequest, sr_Waiter) - 8usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct SignalSemaphore {
    pub ss_Link: Node,
    pub ss_NestCount: WORD,
    pub ss_WaitQueue: MinList,
    pub ss_MultipleLink: SemaphoreRequest,
    pub ss_Owner: *mut Task,
    pub ss_QueueCount: WORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SignalSemaphore"][::core::mem::size_of::<SignalSemaphore>() - 46usize];
    ["Alignment of SignalSemaphore"][::core::mem::align_of::<SignalSemaphore>() - 2usize];
    ["Offset of field: SignalSemaphore::ss_Link"]
        [::core::mem::offset_of!(SignalSemaphore, ss_Link) - 0usize];
    ["Offset of field: SignalSemaphore::ss_NestCount"]
        [::core::mem::offset_of!(SignalSemaphore, ss_NestCount) - 14usize];
    ["Offset of field: SignalSemaphore::ss_WaitQueue"]
        [::core::mem::offset_of!(SignalSemaphore, ss_WaitQueue) - 16usize];
    ["Offset of field: SignalSemaphore::ss_MultipleLink"]
        [::core::mem::offset_of!(SignalSemaphore, ss_MultipleLink) - 28usize];
    ["Offset of field: SignalSemaphore::ss_Owner"]
        [::core::mem::offset_of!(SignalSemaphore, ss_Owner) - 40usize];
    ["Offset of field: SignalSemaphore::ss_QueueCount"]
        [::core::mem::offset_of!(SignalSemaphore, ss_QueueCount) - 44usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct SemaphoreMessage {
    pub ssm_Message: Message,
    pub ssm_Semaphore: *mut SignalSemaphore,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SemaphoreMessage"][::core::mem::size_of::<SemaphoreMessage>() - 24usize];
    ["Alignment of SemaphoreMessage"][::core::mem::align_of::<SemaphoreMessage>() - 2usize];
    ["Offset of field: SemaphoreMessage::ssm_Message"]
        [::core::mem::offset_of!(SemaphoreMessage, ssm_Message) - 0usize];
    ["Offset of field: SemaphoreMessage::ssm_Semaphore"]
        [::core::mem::offset_of!(SemaphoreMessage, ssm_Semaphore) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Semaphore {
    pub sm_MsgPort: MsgPort,
    pub sm_Bids: WORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Semaphore"][::core::mem::size_of::<Semaphore>() - 36usize];
    ["Alignment of Semaphore"][::core::mem::align_of::<Semaphore>() - 2usize];
    ["Offset of field: Semaphore::sm_MsgPort"]
        [::core::mem::offset_of!(Semaphore, sm_MsgPort) - 0usize];
    ["Offset of field: Semaphore::sm_Bids"][::core::mem::offset_of!(Semaphore, sm_Bids) - 34usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct Library {
    pub lib_Node: Node,
    pub lib_Flags: UBYTE,
    pub lib_pad: UBYTE,
    pub lib_NegSize: UWORD,
    pub lib_PosSize: UWORD,
    pub lib_Version: UWORD,
    pub lib_Revision: UWORD,
    pub lib_IdString: APTR,
    pub lib_Sum: ULONG,
    pub lib_OpenCnt: UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Library"][::core::mem::size_of::<Library>() - 34usize];
    ["Alignment of Library"][::core::mem::align_of::<Library>() - 2usize];
    ["Offset of field: Library::lib_Node"][::core::mem::offset_of!(Library, lib_Node) - 0usize];
    ["Offset of field: Library::lib_Flags"][::core::mem::offset_of!(Library, lib_Flags) - 14usize];
    ["Offset of field: Library::lib_pad"][::core::mem::offset_of!(Library, lib_pad) - 15usize];
    ["Offset of field: Library::lib_NegSize"]
        [::core::mem::offset_of!(Library, lib_NegSize) - 16usize];
    ["Offset of field: Library::lib_PosSize"]
        [::core::mem::offset_of!(Library, lib_PosSize) - 18usize];
    ["Offset of field: Library::lib_Version"]
        [::core::mem::offset_of!(Library, lib_Version) - 20usize];
    ["Offset of field: Library::lib_Revision"]
        [::core::mem::offset_of!(Library, lib_Revision) - 22usize];
    ["Offset of field: Library::lib_IdString"]
        [::core::mem::offset_of!(Library, lib_IdString) - 24usize];
    ["Offset of field: Library::lib_Sum"][::core::mem::offset_of!(Library, lib_Sum) - 28usize];
    ["Offset of field: Library::lib_OpenCnt"]
        [::core::mem::offset_of!(Library, lib_OpenCnt) - 32usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct IORequest {
    pub io_Message: Message,
    pub io_Device: *mut Device,
    pub io_Unit: *mut Unit,
    pub io_Command: UWORD,
    pub io_Flags: UBYTE,
    pub io_Error: BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IORequest"][::core::mem::size_of::<IORequest>() - 32usize];
    ["Alignment of IORequest"][::core::mem::align_of::<IORequest>() - 2usize];
    ["Offset of field: IORequest::io_Message"]
        [::core::mem::offset_of!(IORequest, io_Message) - 0usize];
    ["Offset of field: IORequest::io_Device"]
        [::core::mem::offset_of!(IORequest, io_Device) - 20usize];
    ["Offset of field: IORequest::io_Unit"][::core::mem::offset_of!(IORequest, io_Unit) - 24usize];
    ["Offset of field: IORequest::io_Command"]
        [::core::mem::offset_of!(IORequest, io_Command) - 28usize];
    ["Offset of field: IORequest::io_Flags"]
        [::core::mem::offset_of!(IORequest, io_Flags) - 30usize];
    ["Offset of field: IORequest::io_Error"]
        [::core::mem::offset_of!(IORequest, io_Error) - 31usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct IOStdReq {
    pub io_Message: Message,
    pub io_Device: *mut Device,
    pub io_Unit: *mut Unit,
    pub io_Command: UWORD,
    pub io_Flags: UBYTE,
    pub io_Error: BYTE,
    pub io_Actual: ULONG,
    pub io_Length: ULONG,
    pub io_Data: APTR,
    pub io_Offset: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IOStdReq"][::core::mem::size_of::<IOStdReq>() - 48usize];
    ["Alignment of IOStdReq"][::core::mem::align_of::<IOStdReq>() - 2usize];
    ["Offset of field: IOStdReq::io_Message"]
        [::core::mem::offset_of!(IOStdReq, io_Message) - 0usize];
    ["Offset of field: IOStdReq::io_Device"]
        [::core::mem::offset_of!(IOStdReq, io_Device) - 20usize];
    ["Offset of field: IOStdReq::io_Unit"][::core::mem::offset_of!(IOStdReq, io_Unit) - 24usize];
    ["Offset of field: IOStdReq::io_Command"]
        [::core::mem::offset_of!(IOStdReq, io_Command) - 28usize];
    ["Offset of field: IOStdReq::io_Flags"][::core::mem::offset_of!(IOStdReq, io_Flags) - 30usize];
    ["Offset of field: IOStdReq::io_Error"][::core::mem::offset_of!(IOStdReq, io_Error) - 31usize];
    ["Offset of field: IOStdReq::io_Actual"]
        [::core::mem::offset_of!(IOStdReq, io_Actual) - 32usize];
    ["Offset of field: IOStdReq::io_Length"]
        [::core::mem::offset_of!(IOStdReq, io_Length) - 36usize];
    ["Offset of field: IOStdReq::io_Data"][::core::mem::offset_of!(IOStdReq, io_Data) - 40usize];
    ["Offset of field: IOStdReq::io_Offset"]
        [::core::mem::offset_of!(IOStdReq, io_Offset) - 44usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Device {
    pub dd_Library: Library,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Device"][::core::mem::size_of::<Device>() - 34usize];
    ["Alignment of Device"][::core::mem::align_of::<Device>() - 2usize];
    ["Offset of field: Device::dd_Library"][::core::mem::offset_of!(Device, dd_Library) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Unit {
    pub unit_MsgPort: MsgPort,
    pub unit_flags: UBYTE,
    pub unit_pad: UBYTE,
    pub unit_OpenCnt: UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Unit"][::core::mem::size_of::<Unit>() - 38usize];
    ["Alignment of Unit"][::core::mem::align_of::<Unit>() - 2usize];
    ["Offset of field: Unit::unit_MsgPort"][::core::mem::offset_of!(Unit, unit_MsgPort) - 0usize];
    ["Offset of field: Unit::unit_flags"][::core::mem::offset_of!(Unit, unit_flags) - 34usize];
    ["Offset of field: Unit::unit_pad"][::core::mem::offset_of!(Unit, unit_pad) - 35usize];
    ["Offset of field: Unit::unit_OpenCnt"][::core::mem::offset_of!(Unit, unit_OpenCnt) - 36usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct ExecBase {
    pub LibNode: Library,
    pub SoftVer: UWORD,
    pub LowMemChkSum: WORD,
    pub ChkBase: ULONG,
    pub ColdCapture: APTR,
    pub CoolCapture: APTR,
    pub WarmCapture: APTR,
    pub SysStkUpper: APTR,
    pub SysStkLower: APTR,
    pub MaxLocMem: ULONG,
    pub DebugEntry: APTR,
    pub DebugData: APTR,
    pub AlertData: APTR,
    pub MaxExtMem: APTR,
    pub ChkSum: UWORD,
    pub IntVects: [IntVector; 16usize],
    pub ThisTask: *mut Task,
    pub IdleCount: ULONG,
    pub DispCount: ULONG,
    pub Quantum: UWORD,
    pub Elapsed: UWORD,
    pub SysFlags: UWORD,
    pub IDNestCnt: BYTE,
    pub TDNestCnt: BYTE,
    pub AttnFlags: UWORD,
    pub AttnResched: UWORD,
    pub ResModules: APTR,
    pub TaskTrapCode: APTR,
    pub TaskExceptCode: APTR,
    pub TaskExitCode: APTR,
    pub TaskSigAlloc: ULONG,
    pub TaskTrapAlloc: UWORD,
    pub MemList: List,
    pub ResourceList: List,
    pub DeviceList: List,
    pub IntrList: List,
    pub LibList: List,
    pub PortList: List,
    pub TaskReady: List,
    pub TaskWait: List,
    pub SoftInts: [SoftIntList; 5usize],
    pub LastAlert: [LONG; 4usize],
    pub VBlankFrequency: UBYTE,
    pub PowerSupplyFrequency: UBYTE,
    pub SemaphoreList: List,
    pub KickMemPtr: APTR,
    pub KickTagPtr: APTR,
    pub KickCheckSum: APTR,
    pub ex_Pad0: UWORD,
    pub ex_LaunchPoint: ULONG,
    pub ex_RamLibPrivate: APTR,
    pub ex_EClockFrequency: ULONG,
    pub ex_CacheControl: ULONG,
    pub ex_TaskID: ULONG,
    pub ex_Reserved1: [ULONG; 5usize],
    pub ex_MMULock: APTR,
    pub ex_Reserved2: [ULONG; 3usize],
    pub ex_MemHandlers: MinList,
    pub ex_MemHandler: APTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ExecBase"][::core::mem::size_of::<ExecBase>() - 632usize];
    ["Alignment of ExecBase"][::core::mem::align_of::<ExecBase>() - 2usize];
    ["Offset of field: ExecBase::LibNode"][::core::mem::offset_of!(ExecBase, LibNode) - 0usize];
    ["Offset of field: ExecBase::SoftVer"][::core::mem::offset_of!(ExecBase, SoftVer) - 34usize];
    ["Offset of field: ExecBase::LowMemChkSum"]
        [::core::mem::offset_of!(ExecBase, LowMemChkSum) - 36usize];
    ["Offset of field: ExecBase::ChkBase"][::core::mem::offset_of!(ExecBase, ChkBase) - 38usize];
    ["Offset of field: ExecBase::ColdCapture"]
        [::core::mem::offset_of!(ExecBase, ColdCapture) - 42usize];
    ["Offset of field: ExecBase::CoolCapture"]
        [::core::mem::offset_of!(ExecBase, CoolCapture) - 46usize];
    ["Offset of field: ExecBase::WarmCapture"]
        [::core::mem::offset_of!(ExecBase, WarmCapture) - 50usize];
    ["Offset of field: ExecBase::SysStkUpper"]
        [::core::mem::offset_of!(ExecBase, SysStkUpper) - 54usize];
    ["Offset of field: ExecBase::SysStkLower"]
        [::core::mem::offset_of!(ExecBase, SysStkLower) - 58usize];
    ["Offset of field: ExecBase::MaxLocMem"]
        [::core::mem::offset_of!(ExecBase, MaxLocMem) - 62usize];
    ["Offset of field: ExecBase::DebugEntry"]
        [::core::mem::offset_of!(ExecBase, DebugEntry) - 66usize];
    ["Offset of field: ExecBase::DebugData"]
        [::core::mem::offset_of!(ExecBase, DebugData) - 70usize];
    ["Offset of field: ExecBase::AlertData"]
        [::core::mem::offset_of!(ExecBase, AlertData) - 74usize];
    ["Offset of field: ExecBase::MaxExtMem"]
        [::core::mem::offset_of!(ExecBase, MaxExtMem) - 78usize];
    ["Offset of field: ExecBase::ChkSum"][::core::mem::offset_of!(ExecBase, ChkSum) - 82usize];
    ["Offset of field: ExecBase::IntVects"][::core::mem::offset_of!(ExecBase, IntVects) - 84usize];
    ["Offset of field: ExecBase::ThisTask"][::core::mem::offset_of!(ExecBase, ThisTask) - 276usize];
    ["Offset of field: ExecBase::IdleCount"]
        [::core::mem::offset_of!(ExecBase, IdleCount) - 280usize];
    ["Offset of field: ExecBase::DispCount"]
        [::core::mem::offset_of!(ExecBase, DispCount) - 284usize];
    ["Offset of field: ExecBase::Quantum"][::core::mem::offset_of!(ExecBase, Quantum) - 288usize];
    ["Offset of field: ExecBase::Elapsed"][::core::mem::offset_of!(ExecBase, Elapsed) - 290usize];
    ["Offset of field: ExecBase::SysFlags"][::core::mem::offset_of!(ExecBase, SysFlags) - 292usize];
    ["Offset of field: ExecBase::IDNestCnt"]
        [::core::mem::offset_of!(ExecBase, IDNestCnt) - 294usize];
    ["Offset of field: ExecBase::TDNestCnt"]
        [::core::mem::offset_of!(ExecBase, TDNestCnt) - 295usize];
    ["Offset of field: ExecBase::AttnFlags"]
        [::core::mem::offset_of!(ExecBase, AttnFlags) - 296usize];
    ["Offset of field: ExecBase::AttnResched"]
        [::core::mem::offset_of!(ExecBase, AttnResched) - 298usize];
    ["Offset of field: ExecBase::ResModules"]
        [::core::mem::offset_of!(ExecBase, ResModules) - 300usize];
    ["Offset of field: ExecBase::TaskTrapCode"]
        [::core::mem::offset_of!(ExecBase, TaskTrapCode) - 304usize];
    ["Offset of field: ExecBase::TaskExceptCode"]
        [::core::mem::offset_of!(ExecBase, TaskExceptCode) - 308usize];
    ["Offset of field: ExecBase::TaskExitCode"]
        [::core::mem::offset_of!(ExecBase, TaskExitCode) - 312usize];
    ["Offset of field: ExecBase::TaskSigAlloc"]
        [::core::mem::offset_of!(ExecBase, TaskSigAlloc) - 316usize];
    ["Offset of field: ExecBase::TaskTrapAlloc"]
        [::core::mem::offset_of!(ExecBase, TaskTrapAlloc) - 320usize];
    ["Offset of field: ExecBase::MemList"][::core::mem::offset_of!(ExecBase, MemList) - 322usize];
    ["Offset of field: ExecBase::ResourceList"]
        [::core::mem::offset_of!(ExecBase, ResourceList) - 336usize];
    ["Offset of field: ExecBase::DeviceList"]
        [::core::mem::offset_of!(ExecBase, DeviceList) - 350usize];
    ["Offset of field: ExecBase::IntrList"][::core::mem::offset_of!(ExecBase, IntrList) - 364usize];
    ["Offset of field: ExecBase::LibList"][::core::mem::offset_of!(ExecBase, LibList) - 378usize];
    ["Offset of field: ExecBase::PortList"][::core::mem::offset_of!(ExecBase, PortList) - 392usize];
    ["Offset of field: ExecBase::TaskReady"]
        [::core::mem::offset_of!(ExecBase, TaskReady) - 406usize];
    ["Offset of field: ExecBase::TaskWait"][::core::mem::offset_of!(ExecBase, TaskWait) - 420usize];
    ["Offset of field: ExecBase::SoftInts"][::core::mem::offset_of!(ExecBase, SoftInts) - 434usize];
    ["Offset of field: ExecBase::LastAlert"]
        [::core::mem::offset_of!(ExecBase, LastAlert) - 514usize];
    ["Offset of field: ExecBase::VBlankFrequency"]
        [::core::mem::offset_of!(ExecBase, VBlankFrequency) - 530usize];
    ["Offset of field: ExecBase::PowerSupplyFrequency"]
        [::core::mem::offset_of!(ExecBase, PowerSupplyFrequency) - 531usize];
    ["Offset of field: ExecBase::SemaphoreList"]
        [::core::mem::offset_of!(ExecBase, SemaphoreList) - 532usize];
    ["Offset of field: ExecBase::KickMemPtr"]
        [::core::mem::offset_of!(ExecBase, KickMemPtr) - 546usize];
    ["Offset of field: ExecBase::KickTagPtr"]
        [::core::mem::offset_of!(ExecBase, KickTagPtr) - 550usize];
    ["Offset of field: ExecBase::KickCheckSum"]
        [::core::mem::offset_of!(ExecBase, KickCheckSum) - 554usize];
    ["Offset of field: ExecBase::ex_Pad0"][::core::mem::offset_of!(ExecBase, ex_Pad0) - 558usize];
    ["Offset of field: ExecBase::ex_LaunchPoint"]
        [::core::mem::offset_of!(ExecBase, ex_LaunchPoint) - 560usize];
    ["Offset of field: ExecBase::ex_RamLibPrivate"]
        [::core::mem::offset_of!(ExecBase, ex_RamLibPrivate) - 564usize];
    ["Offset of field: ExecBase::ex_EClockFrequency"]
        [::core::mem::offset_of!(ExecBase, ex_EClockFrequency) - 568usize];
    ["Offset of field: ExecBase::ex_CacheControl"]
        [::core::mem::offset_of!(ExecBase, ex_CacheControl) - 572usize];
    ["Offset of field: ExecBase::ex_TaskID"]
        [::core::mem::offset_of!(ExecBase, ex_TaskID) - 576usize];
    ["Offset of field: ExecBase::ex_Reserved1"]
        [::core::mem::offset_of!(ExecBase, ex_Reserved1) - 580usize];
    ["Offset of field: ExecBase::ex_MMULock"]
        [::core::mem::offset_of!(ExecBase, ex_MMULock) - 600usize];
    ["Offset of field: ExecBase::ex_Reserved2"]
        [::core::mem::offset_of!(ExecBase, ex_Reserved2) - 604usize];
    ["Offset of field: ExecBase::ex_MemHandlers"]
        [::core::mem::offset_of!(ExecBase, ex_MemHandlers) - 616usize];
    ["Offset of field: ExecBase::ex_MemHandler"]
        [::core::mem::offset_of!(ExecBase, ex_MemHandler) - 628usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct DateStamp {
    pub ds_Days: LONG,
    pub ds_Minute: LONG,
    pub ds_Tick: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DateStamp"][::core::mem::size_of::<DateStamp>() - 12usize];
    ["Alignment of DateStamp"][::core::mem::align_of::<DateStamp>() - 2usize];
    ["Offset of field: DateStamp::ds_Days"][::core::mem::offset_of!(DateStamp, ds_Days) - 0usize];
    ["Offset of field: DateStamp::ds_Minute"]
        [::core::mem::offset_of!(DateStamp, ds_Minute) - 4usize];
    ["Offset of field: DateStamp::ds_Tick"][::core::mem::offset_of!(DateStamp, ds_Tick) - 8usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct FileInfoBlock {
    pub fib_DiskKey: LONG,
    pub fib_DirEntryType: LONG,
    pub fib_FileName: [TEXT; 108usize],
    pub fib_Protection: LONG,
    pub fib_EntryType: LONG,
    pub fib_Size: LONG,
    pub fib_NumBlocks: LONG,
    pub fib_Date: DateStamp,
    pub fib_Comment: [TEXT; 80usize],
    pub fib_OwnerUID: UWORD,
    pub fib_OwnerGID: UWORD,
    pub fib_Reserved: [UBYTE; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FileInfoBlock"][::core::mem::size_of::<FileInfoBlock>() - 260usize];
    ["Alignment of FileInfoBlock"][::core::mem::align_of::<FileInfoBlock>() - 2usize];
    ["Offset of field: FileInfoBlock::fib_DiskKey"]
        [::core::mem::offset_of!(FileInfoBlock, fib_DiskKey) - 0usize];
    ["Offset of field: FileInfoBlock::fib_DirEntryType"]
        [::core::mem::offset_of!(FileInfoBlock, fib_DirEntryType) - 4usize];
    ["Offset of field: FileInfoBlock::fib_FileName"]
        [::core::mem::offset_of!(FileInfoBlock, fib_FileName) - 8usize];
    ["Offset of field: FileInfoBlock::fib_Protection"]
        [::core::mem::offset_of!(FileInfoBlock, fib_Protection) - 116usize];
    ["Offset of field: FileInfoBlock::fib_EntryType"]
        [::core::mem::offset_of!(FileInfoBlock, fib_EntryType) - 120usize];
    ["Offset of field: FileInfoBlock::fib_Size"]
        [::core::mem::offset_of!(FileInfoBlock, fib_Size) - 124usize];
    ["Offset of field: FileInfoBlock::fib_NumBlocks"]
        [::core::mem::offset_of!(FileInfoBlock, fib_NumBlocks) - 128usize];
    ["Offset of field: FileInfoBlock::fib_Date"]
        [::core::mem::offset_of!(FileInfoBlock, fib_Date) - 132usize];
    ["Offset of field: FileInfoBlock::fib_Comment"]
        [::core::mem::offset_of!(FileInfoBlock, fib_Comment) - 144usize];
    ["Offset of field: FileInfoBlock::fib_OwnerUID"]
        [::core::mem::offset_of!(FileInfoBlock, fib_OwnerUID) - 224usize];
    ["Offset of field: FileInfoBlock::fib_OwnerGID"]
        [::core::mem::offset_of!(FileInfoBlock, fib_OwnerGID) - 226usize];
    ["Offset of field: FileInfoBlock::fib_Reserved"]
        [::core::mem::offset_of!(FileInfoBlock, fib_Reserved) - 228usize];
};
pub type BPTR = ::core::ffi::c_long;
pub type BSTR = ::core::ffi::c_long;
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct InfoData {
    pub id_NumSoftErrors: LONG,
    pub id_UnitNumber: LONG,
    pub id_DiskState: LONG,
    pub id_NumBlocks: LONG,
    pub id_NumBlocksUsed: LONG,
    pub id_BytesPerBlock: LONG,
    pub id_DiskType: LONG,
    pub id_VolumeNode: BPTR,
    pub id_InUse: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of InfoData"][::core::mem::size_of::<InfoData>() - 36usize];
    ["Alignment of InfoData"][::core::mem::align_of::<InfoData>() - 2usize];
    ["Offset of field: InfoData::id_NumSoftErrors"]
        [::core::mem::offset_of!(InfoData, id_NumSoftErrors) - 0usize];
    ["Offset of field: InfoData::id_UnitNumber"]
        [::core::mem::offset_of!(InfoData, id_UnitNumber) - 4usize];
    ["Offset of field: InfoData::id_DiskState"]
        [::core::mem::offset_of!(InfoData, id_DiskState) - 8usize];
    ["Offset of field: InfoData::id_NumBlocks"]
        [::core::mem::offset_of!(InfoData, id_NumBlocks) - 12usize];
    ["Offset of field: InfoData::id_NumBlocksUsed"]
        [::core::mem::offset_of!(InfoData, id_NumBlocksUsed) - 16usize];
    ["Offset of field: InfoData::id_BytesPerBlock"]
        [::core::mem::offset_of!(InfoData, id_BytesPerBlock) - 20usize];
    ["Offset of field: InfoData::id_DiskType"]
        [::core::mem::offset_of!(InfoData, id_DiskType) - 24usize];
    ["Offset of field: InfoData::id_VolumeNode"]
        [::core::mem::offset_of!(InfoData, id_VolumeNode) - 28usize];
    ["Offset of field: InfoData::id_InUse"][::core::mem::offset_of!(InfoData, id_InUse) - 32usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct CSource {
    pub CS_Buffer: STRPTR,
    pub CS_Length: LONG,
    pub CS_CurChr: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CSource"][::core::mem::size_of::<CSource>() - 12usize];
    ["Alignment of CSource"][::core::mem::align_of::<CSource>() - 2usize];
    ["Offset of field: CSource::CS_Buffer"][::core::mem::offset_of!(CSource, CS_Buffer) - 0usize];
    ["Offset of field: CSource::CS_Length"][::core::mem::offset_of!(CSource, CS_Length) - 4usize];
    ["Offset of field: CSource::CS_CurChr"][::core::mem::offset_of!(CSource, CS_CurChr) - 8usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct RDArgs {
    pub RDA_Source: CSource,
    pub RDA_DAList: LONG,
    pub RDA_Buffer: STRPTR,
    pub RDA_BufSiz: LONG,
    pub RDA_ExtHelp: STRPTR,
    pub RDA_Flags: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RDArgs"][::core::mem::size_of::<RDArgs>() - 32usize];
    ["Alignment of RDArgs"][::core::mem::align_of::<RDArgs>() - 2usize];
    ["Offset of field: RDArgs::RDA_Source"][::core::mem::offset_of!(RDArgs, RDA_Source) - 0usize];
    ["Offset of field: RDArgs::RDA_DAList"][::core::mem::offset_of!(RDArgs, RDA_DAList) - 12usize];
    ["Offset of field: RDArgs::RDA_Buffer"][::core::mem::offset_of!(RDArgs, RDA_Buffer) - 16usize];
    ["Offset of field: RDArgs::RDA_BufSiz"][::core::mem::offset_of!(RDArgs, RDA_BufSiz) - 20usize];
    ["Offset of field: RDArgs::RDA_ExtHelp"]
        [::core::mem::offset_of!(RDArgs, RDA_ExtHelp) - 24usize];
    ["Offset of field: RDArgs::RDA_Flags"][::core::mem::offset_of!(RDArgs, RDA_Flags) - 28usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct NexxStr {
    pub ns_Ivalue: LONG,
    pub ns_Length: UWORD,
    pub ns_Flags: UBYTE,
    pub ns_Hash: UBYTE,
    pub ns_Buff: [BYTE; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NexxStr"][::core::mem::size_of::<NexxStr>() - 16usize];
    ["Alignment of NexxStr"][::core::mem::align_of::<NexxStr>() - 2usize];
    ["Offset of field: NexxStr::ns_Ivalue"][::core::mem::offset_of!(NexxStr, ns_Ivalue) - 0usize];
    ["Offset of field: NexxStr::ns_Length"][::core::mem::offset_of!(NexxStr, ns_Length) - 4usize];
    ["Offset of field: NexxStr::ns_Flags"][::core::mem::offset_of!(NexxStr, ns_Flags) - 6usize];
    ["Offset of field: NexxStr::ns_Hash"][::core::mem::offset_of!(NexxStr, ns_Hash) - 7usize];
    ["Offset of field: NexxStr::ns_Buff"][::core::mem::offset_of!(NexxStr, ns_Buff) - 8usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct RexxArg {
    pub ra_Size: LONG,
    pub ra_Length: UWORD,
    pub ra_Flags: UBYTE,
    pub ra_Hash: UBYTE,
    pub ra_Buff: [BYTE; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RexxArg"][::core::mem::size_of::<RexxArg>() - 16usize];
    ["Alignment of RexxArg"][::core::mem::align_of::<RexxArg>() - 2usize];
    ["Offset of field: RexxArg::ra_Size"][::core::mem::offset_of!(RexxArg, ra_Size) - 0usize];
    ["Offset of field: RexxArg::ra_Length"][::core::mem::offset_of!(RexxArg, ra_Length) - 4usize];
    ["Offset of field: RexxArg::ra_Flags"][::core::mem::offset_of!(RexxArg, ra_Flags) - 6usize];
    ["Offset of field: RexxArg::ra_Hash"][::core::mem::offset_of!(RexxArg, ra_Hash) - 7usize];
    ["Offset of field: RexxArg::ra_Buff"][::core::mem::offset_of!(RexxArg, ra_Buff) - 8usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct RexxMsg {
    pub rm_Node: Message,
    pub rm_TaskBlock: APTR,
    pub rm_LibBase: APTR,
    pub rm_Action: LONG,
    pub rm_Result1: LONG,
    pub rm_Result2: LONG,
    pub rm_Args: [STRPTR; 16usize],
    pub rm_PassPort: *mut MsgPort,
    pub rm_CommAddr: STRPTR,
    pub rm_FileExt: STRPTR,
    pub rm_Stdin: LONG,
    pub rm_Stdout: LONG,
    pub rm_avail: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RexxMsg"][::core::mem::size_of::<RexxMsg>() - 128usize];
    ["Alignment of RexxMsg"][::core::mem::align_of::<RexxMsg>() - 2usize];
    ["Offset of field: RexxMsg::rm_Node"][::core::mem::offset_of!(RexxMsg, rm_Node) - 0usize];
    ["Offset of field: RexxMsg::rm_TaskBlock"]
        [::core::mem::offset_of!(RexxMsg, rm_TaskBlock) - 20usize];
    ["Offset of field: RexxMsg::rm_LibBase"]
        [::core::mem::offset_of!(RexxMsg, rm_LibBase) - 24usize];
    ["Offset of field: RexxMsg::rm_Action"][::core::mem::offset_of!(RexxMsg, rm_Action) - 28usize];
    ["Offset of field: RexxMsg::rm_Result1"]
        [::core::mem::offset_of!(RexxMsg, rm_Result1) - 32usize];
    ["Offset of field: RexxMsg::rm_Result2"]
        [::core::mem::offset_of!(RexxMsg, rm_Result2) - 36usize];
    ["Offset of field: RexxMsg::rm_Args"][::core::mem::offset_of!(RexxMsg, rm_Args) - 40usize];
    ["Offset of field: RexxMsg::rm_PassPort"]
        [::core::mem::offset_of!(RexxMsg, rm_PassPort) - 104usize];
    ["Offset of field: RexxMsg::rm_CommAddr"]
        [::core::mem::offset_of!(RexxMsg, rm_CommAddr) - 108usize];
    ["Offset of field: RexxMsg::rm_FileExt"]
        [::core::mem::offset_of!(RexxMsg, rm_FileExt) - 112usize];
    ["Offset of field: RexxMsg::rm_Stdin"][::core::mem::offset_of!(RexxMsg, rm_Stdin) - 116usize];
    ["Offset of field: RexxMsg::rm_Stdout"][::core::mem::offset_of!(RexxMsg, rm_Stdout) - 120usize];
    ["Offset of field: RexxMsg::rm_avail"][::core::mem::offset_of!(RexxMsg, rm_avail) - 124usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct RexxRsrc {
    pub rr_Node: Node,
    pub rr_Func: WORD,
    pub rr_Base: APTR,
    pub rr_Size: LONG,
    pub rr_Arg1: LONG,
    pub rr_Arg2: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RexxRsrc"][::core::mem::size_of::<RexxRsrc>() - 32usize];
    ["Alignment of RexxRsrc"][::core::mem::align_of::<RexxRsrc>() - 2usize];
    ["Offset of field: RexxRsrc::rr_Node"][::core::mem::offset_of!(RexxRsrc, rr_Node) - 0usize];
    ["Offset of field: RexxRsrc::rr_Func"][::core::mem::offset_of!(RexxRsrc, rr_Func) - 14usize];
    ["Offset of field: RexxRsrc::rr_Base"][::core::mem::offset_of!(RexxRsrc, rr_Base) - 16usize];
    ["Offset of field: RexxRsrc::rr_Size"][::core::mem::offset_of!(RexxRsrc, rr_Size) - 20usize];
    ["Offset of field: RexxRsrc::rr_Arg1"][::core::mem::offset_of!(RexxRsrc, rr_Arg1) - 24usize];
    ["Offset of field: RexxRsrc::rr_Arg2"][::core::mem::offset_of!(RexxRsrc, rr_Arg2) - 28usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct RexxTask {
    pub rt_Global: [BYTE; 200usize],
    pub rt_MsgPort: MsgPort,
    pub rt_Flags: UBYTE,
    pub rt_SigBit: BYTE,
    pub rt_ClientID: APTR,
    pub rt_MsgPkt: APTR,
    pub rt_TaskID: APTR,
    pub rt_RexxPort: APTR,
    pub rt_ErrTrap: APTR,
    pub rt_StackPtr: APTR,
    pub rt_Header1: List,
    pub rt_Header2: List,
    pub rt_Header3: List,
    pub rt_Header4: List,
    pub rt_Header5: List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RexxTask"][::core::mem::size_of::<RexxTask>() - 330usize];
    ["Alignment of RexxTask"][::core::mem::align_of::<RexxTask>() - 2usize];
    ["Offset of field: RexxTask::rt_Global"][::core::mem::offset_of!(RexxTask, rt_Global) - 0usize];
    ["Offset of field: RexxTask::rt_MsgPort"]
        [::core::mem::offset_of!(RexxTask, rt_MsgPort) - 200usize];
    ["Offset of field: RexxTask::rt_Flags"][::core::mem::offset_of!(RexxTask, rt_Flags) - 234usize];
    ["Offset of field: RexxTask::rt_SigBit"]
        [::core::mem::offset_of!(RexxTask, rt_SigBit) - 235usize];
    ["Offset of field: RexxTask::rt_ClientID"]
        [::core::mem::offset_of!(RexxTask, rt_ClientID) - 236usize];
    ["Offset of field: RexxTask::rt_MsgPkt"]
        [::core::mem::offset_of!(RexxTask, rt_MsgPkt) - 240usize];
    ["Offset of field: RexxTask::rt_TaskID"]
        [::core::mem::offset_of!(RexxTask, rt_TaskID) - 244usize];
    ["Offset of field: RexxTask::rt_RexxPort"]
        [::core::mem::offset_of!(RexxTask, rt_RexxPort) - 248usize];
    ["Offset of field: RexxTask::rt_ErrTrap"]
        [::core::mem::offset_of!(RexxTask, rt_ErrTrap) - 252usize];
    ["Offset of field: RexxTask::rt_StackPtr"]
        [::core::mem::offset_of!(RexxTask, rt_StackPtr) - 256usize];
    ["Offset of field: RexxTask::rt_Header1"]
        [::core::mem::offset_of!(RexxTask, rt_Header1) - 260usize];
    ["Offset of field: RexxTask::rt_Header2"]
        [::core::mem::offset_of!(RexxTask, rt_Header2) - 274usize];
    ["Offset of field: RexxTask::rt_Header3"]
        [::core::mem::offset_of!(RexxTask, rt_Header3) - 288usize];
    ["Offset of field: RexxTask::rt_Header4"]
        [::core::mem::offset_of!(RexxTask, rt_Header4) - 302usize];
    ["Offset of field: RexxTask::rt_Header5"]
        [::core::mem::offset_of!(RexxTask, rt_Header5) - 316usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct SrcNode {
    pub sn_Succ: *mut SrcNode,
    pub sn_Pred: *mut SrcNode,
    pub sn_Ptr: APTR,
    pub sn_Size: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SrcNode"][::core::mem::size_of::<SrcNode>() - 16usize];
    ["Alignment of SrcNode"][::core::mem::align_of::<SrcNode>() - 2usize];
    ["Offset of field: SrcNode::sn_Succ"][::core::mem::offset_of!(SrcNode, sn_Succ) - 0usize];
    ["Offset of field: SrcNode::sn_Pred"][::core::mem::offset_of!(SrcNode, sn_Pred) - 4usize];
    ["Offset of field: SrcNode::sn_Ptr"][::core::mem::offset_of!(SrcNode, sn_Ptr) - 8usize];
    ["Offset of field: SrcNode::sn_Size"][::core::mem::offset_of!(SrcNode, sn_Size) - 12usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct RxsLib {
    pub rl_Node: Library,
    pub rl_Flags: UBYTE,
    pub rl_Shadow: UBYTE,
    pub rl_SysBase: APTR,
    pub rl_DOSBase: APTR,
    pub rl_IeeeDPBase: APTR,
    pub rl_SegList: LONG,
    pub rl_NIL: LONG,
    pub rl_Chunk: LONG,
    pub rl_MaxNest: LONG,
    pub rl_NULL: *mut NexxStr,
    pub rl_FALSE: *mut NexxStr,
    pub rl_TRUE: *mut NexxStr,
    pub rl_REXX: *mut NexxStr,
    pub rl_COMMAND: *mut NexxStr,
    pub rl_STDIN: *mut NexxStr,
    pub rl_STDOUT: *mut NexxStr,
    pub rl_STDERR: *mut NexxStr,
    pub rl_Version: STRPTR,
    pub rl_TaskName: STRPTR,
    pub rl_TaskPri: LONG,
    pub rl_TaskSeg: LONG,
    pub rl_StackSize: LONG,
    pub rl_RexxDir: STRPTR,
    pub rl_CTABLE: STRPTR,
    pub rl_Notice: STRPTR,
    pub rl_RexxPort: MsgPort,
    pub rl_ReadLock: UWORD,
    pub rl_TraceFH: LONG,
    pub rl_TaskList: List,
    pub rl_NumTask: WORD,
    pub rl_LibList: List,
    pub rl_NumLib: WORD,
    pub rl_ClipList: List,
    pub rl_NumClip: WORD,
    pub rl_MsgList: List,
    pub rl_NumMsg: WORD,
    pub rl_PgmList: List,
    pub rl_NumPgm: WORD,
    pub rl_TraceCnt: UWORD,
    pub rl_avail: WORD,
    pub rl_UtilityBase: APTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RxsLib"][::core::mem::size_of::<RxsLib>() - 256usize];
    ["Alignment of RxsLib"][::core::mem::align_of::<RxsLib>() - 2usize];
    ["Offset of field: RxsLib::rl_Node"][::core::mem::offset_of!(RxsLib, rl_Node) - 0usize];
    ["Offset of field: RxsLib::rl_Flags"][::core::mem::offset_of!(RxsLib, rl_Flags) - 34usize];
    ["Offset of field: RxsLib::rl_Shadow"][::core::mem::offset_of!(RxsLib, rl_Shadow) - 35usize];
    ["Offset of field: RxsLib::rl_SysBase"][::core::mem::offset_of!(RxsLib, rl_SysBase) - 36usize];
    ["Offset of field: RxsLib::rl_DOSBase"][::core::mem::offset_of!(RxsLib, rl_DOSBase) - 40usize];
    ["Offset of field: RxsLib::rl_IeeeDPBase"]
        [::core::mem::offset_of!(RxsLib, rl_IeeeDPBase) - 44usize];
    ["Offset of field: RxsLib::rl_SegList"][::core::mem::offset_of!(RxsLib, rl_SegList) - 48usize];
    ["Offset of field: RxsLib::rl_NIL"][::core::mem::offset_of!(RxsLib, rl_NIL) - 52usize];
    ["Offset of field: RxsLib::rl_Chunk"][::core::mem::offset_of!(RxsLib, rl_Chunk) - 56usize];
    ["Offset of field: RxsLib::rl_MaxNest"][::core::mem::offset_of!(RxsLib, rl_MaxNest) - 60usize];
    ["Offset of field: RxsLib::rl_NULL"][::core::mem::offset_of!(RxsLib, rl_NULL) - 64usize];
    ["Offset of field: RxsLib::rl_FALSE"][::core::mem::offset_of!(RxsLib, rl_FALSE) - 68usize];
    ["Offset of field: RxsLib::rl_TRUE"][::core::mem::offset_of!(RxsLib, rl_TRUE) - 72usize];
    ["Offset of field: RxsLib::rl_REXX"][::core::mem::offset_of!(RxsLib, rl_REXX) - 76usize];
    ["Offset of field: RxsLib::rl_COMMAND"][::core::mem::offset_of!(RxsLib, rl_COMMAND) - 80usize];
    ["Offset of field: RxsLib::rl_STDIN"][::core::mem::offset_of!(RxsLib, rl_STDIN) - 84usize];
    ["Offset of field: RxsLib::rl_STDOUT"][::core::mem::offset_of!(RxsLib, rl_STDOUT) - 88usize];
    ["Offset of field: RxsLib::rl_STDERR"][::core::mem::offset_of!(RxsLib, rl_STDERR) - 92usize];
    ["Offset of field: RxsLib::rl_Version"][::core::mem::offset_of!(RxsLib, rl_Version) - 96usize];
    ["Offset of field: RxsLib::rl_TaskName"]
        [::core::mem::offset_of!(RxsLib, rl_TaskName) - 100usize];
    ["Offset of field: RxsLib::rl_TaskPri"][::core::mem::offset_of!(RxsLib, rl_TaskPri) - 104usize];
    ["Offset of field: RxsLib::rl_TaskSeg"][::core::mem::offset_of!(RxsLib, rl_TaskSeg) - 108usize];
    ["Offset of field: RxsLib::rl_StackSize"]
        [::core::mem::offset_of!(RxsLib, rl_StackSize) - 112usize];
    ["Offset of field: RxsLib::rl_RexxDir"][::core::mem::offset_of!(RxsLib, rl_RexxDir) - 116usize];
    ["Offset of field: RxsLib::rl_CTABLE"][::core::mem::offset_of!(RxsLib, rl_CTABLE) - 120usize];
    ["Offset of field: RxsLib::rl_Notice"][::core::mem::offset_of!(RxsLib, rl_Notice) - 124usize];
    ["Offset of field: RxsLib::rl_RexxPort"]
        [::core::mem::offset_of!(RxsLib, rl_RexxPort) - 128usize];
    ["Offset of field: RxsLib::rl_ReadLock"]
        [::core::mem::offset_of!(RxsLib, rl_ReadLock) - 162usize];
    ["Offset of field: RxsLib::rl_TraceFH"][::core::mem::offset_of!(RxsLib, rl_TraceFH) - 164usize];
    ["Offset of field: RxsLib::rl_TaskList"]
        [::core::mem::offset_of!(RxsLib, rl_TaskList) - 168usize];
    ["Offset of field: RxsLib::rl_NumTask"][::core::mem::offset_of!(RxsLib, rl_NumTask) - 182usize];
    ["Offset of field: RxsLib::rl_LibList"][::core::mem::offset_of!(RxsLib, rl_LibList) - 184usize];
    ["Offset of field: RxsLib::rl_NumLib"][::core::mem::offset_of!(RxsLib, rl_NumLib) - 198usize];
    ["Offset of field: RxsLib::rl_ClipList"]
        [::core::mem::offset_of!(RxsLib, rl_ClipList) - 200usize];
    ["Offset of field: RxsLib::rl_NumClip"][::core::mem::offset_of!(RxsLib, rl_NumClip) - 214usize];
    ["Offset of field: RxsLib::rl_MsgList"][::core::mem::offset_of!(RxsLib, rl_MsgList) - 216usize];
    ["Offset of field: RxsLib::rl_NumMsg"][::core::mem::offset_of!(RxsLib, rl_NumMsg) - 230usize];
    ["Offset of field: RxsLib::rl_PgmList"][::core::mem::offset_of!(RxsLib, rl_PgmList) - 232usize];
    ["Offset of field: RxsLib::rl_NumPgm"][::core::mem::offset_of!(RxsLib, rl_NumPgm) - 246usize];
    ["Offset of field: RxsLib::rl_TraceCnt"]
        [::core::mem::offset_of!(RxsLib, rl_TraceCnt) - 248usize];
    ["Offset of field: RxsLib::rl_avail"][::core::mem::offset_of!(RxsLib, rl_avail) - 250usize];
    ["Offset of field: RxsLib::rl_UtilityBase"]
        [::core::mem::offset_of!(RxsLib, rl_UtilityBase) - 252usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct Hook {
    pub h_MinNode: MinNode,
    pub h_Entry: FPTR,
    pub h_SubEntry: FPTR,
    pub h_Data: APTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Hook"][::core::mem::size_of::<Hook>() - 20usize];
    ["Alignment of Hook"][::core::mem::align_of::<Hook>() - 2usize];
    ["Offset of field: Hook::h_MinNode"][::core::mem::offset_of!(Hook, h_MinNode) - 0usize];
    ["Offset of field: Hook::h_Entry"][::core::mem::offset_of!(Hook, h_Entry) - 8usize];
    ["Offset of field: Hook::h_SubEntry"][::core::mem::offset_of!(Hook, h_SubEntry) - 12usize];
    ["Offset of field: Hook::h_Data"][::core::mem::offset_of!(Hook, h_Data) - 16usize];
};
pub type HOOKFUNC = FPTR;
pub type Object = ULONG;
pub type ClassID = STRPTR;
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct _bindgen_ty_1 {
    pub MethodID: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _bindgen_ty_1"][::core::mem::size_of::<_bindgen_ty_1>() - 4usize];
    ["Alignment of _bindgen_ty_1"][::core::mem::align_of::<_bindgen_ty_1>() - 2usize];
    ["Offset of field: _bindgen_ty_1::MethodID"]
        [::core::mem::offset_of!(_bindgen_ty_1, MethodID) - 0usize];
};
pub type Msg = *mut _bindgen_ty_1;
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct opSet {
    pub MethodID: ULONG,
    pub ops_AttrList: *mut TagItem,
    pub ops_GInfo: *mut GadgetInfo,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of opSet"][::core::mem::size_of::<opSet>() - 12usize];
    ["Alignment of opSet"][::core::mem::align_of::<opSet>() - 2usize];
    ["Offset of field: opSet::MethodID"][::core::mem::offset_of!(opSet, MethodID) - 0usize];
    ["Offset of field: opSet::ops_AttrList"][::core::mem::offset_of!(opSet, ops_AttrList) - 4usize];
    ["Offset of field: opSet::ops_GInfo"][::core::mem::offset_of!(opSet, ops_GInfo) - 8usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct opUpdate {
    pub MethodID: ULONG,
    pub opu_AttrList: *mut TagItem,
    pub opu_GInfo: *mut GadgetInfo,
    pub opu_Flags: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of opUpdate"][::core::mem::size_of::<opUpdate>() - 16usize];
    ["Alignment of opUpdate"][::core::mem::align_of::<opUpdate>() - 2usize];
    ["Offset of field: opUpdate::MethodID"][::core::mem::offset_of!(opUpdate, MethodID) - 0usize];
    ["Offset of field: opUpdate::opu_AttrList"]
        [::core::mem::offset_of!(opUpdate, opu_AttrList) - 4usize];
    ["Offset of field: opUpdate::opu_GInfo"][::core::mem::offset_of!(opUpdate, opu_GInfo) - 8usize];
    ["Offset of field: opUpdate::opu_Flags"]
        [::core::mem::offset_of!(opUpdate, opu_Flags) - 12usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct opGet {
    pub MethodID: ULONG,
    pub opg_AttrID: ULONG,
    pub opg_Storage: *mut ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of opGet"][::core::mem::size_of::<opGet>() - 12usize];
    ["Alignment of opGet"][::core::mem::align_of::<opGet>() - 2usize];
    ["Offset of field: opGet::MethodID"][::core::mem::offset_of!(opGet, MethodID) - 0usize];
    ["Offset of field: opGet::opg_AttrID"][::core::mem::offset_of!(opGet, opg_AttrID) - 4usize];
    ["Offset of field: opGet::opg_Storage"][::core::mem::offset_of!(opGet, opg_Storage) - 8usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct opAddTail {
    pub MethodID: ULONG,
    pub opat_List: *mut List,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of opAddTail"][::core::mem::size_of::<opAddTail>() - 8usize];
    ["Alignment of opAddTail"][::core::mem::align_of::<opAddTail>() - 2usize];
    ["Offset of field: opAddTail::MethodID"][::core::mem::offset_of!(opAddTail, MethodID) - 0usize];
    ["Offset of field: opAddTail::opat_List"]
        [::core::mem::offset_of!(opAddTail, opat_List) - 4usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct opMember {
    pub MethodID: ULONG,
    pub opam_Object: *mut Object,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of opMember"][::core::mem::size_of::<opMember>() - 8usize];
    ["Alignment of opMember"][::core::mem::align_of::<opMember>() - 2usize];
    ["Offset of field: opMember::MethodID"][::core::mem::offset_of!(opMember, MethodID) - 0usize];
    ["Offset of field: opMember::opam_Object"]
        [::core::mem::offset_of!(opMember, opam_Object) - 4usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct IClass {
    pub cl_Dispatcher: Hook,
    pub cl_Reserved: ULONG,
    pub cl_Super: *mut IClass,
    pub cl_ID: ClassID,
    pub cl_InstOffset: UWORD,
    pub cl_InstSize: UWORD,
    pub cl_UserData: ULONG,
    pub cl_SubclassCount: ULONG,
    pub cl_ObjectCount: ULONG,
    pub cl_Flags: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IClass"][::core::mem::size_of::<IClass>() - 52usize];
    ["Alignment of IClass"][::core::mem::align_of::<IClass>() - 2usize];
    ["Offset of field: IClass::cl_Dispatcher"]
        [::core::mem::offset_of!(IClass, cl_Dispatcher) - 0usize];
    ["Offset of field: IClass::cl_Reserved"]
        [::core::mem::offset_of!(IClass, cl_Reserved) - 20usize];
    ["Offset of field: IClass::cl_Super"][::core::mem::offset_of!(IClass, cl_Super) - 24usize];
    ["Offset of field: IClass::cl_ID"][::core::mem::offset_of!(IClass, cl_ID) - 28usize];
    ["Offset of field: IClass::cl_InstOffset"]
        [::core::mem::offset_of!(IClass, cl_InstOffset) - 32usize];
    ["Offset of field: IClass::cl_InstSize"]
        [::core::mem::offset_of!(IClass, cl_InstSize) - 34usize];
    ["Offset of field: IClass::cl_UserData"]
        [::core::mem::offset_of!(IClass, cl_UserData) - 36usize];
    ["Offset of field: IClass::cl_SubclassCount"]
        [::core::mem::offset_of!(IClass, cl_SubclassCount) - 40usize];
    ["Offset of field: IClass::cl_ObjectCount"]
        [::core::mem::offset_of!(IClass, cl_ObjectCount) - 44usize];
    ["Offset of field: IClass::cl_Flags"][::core::mem::offset_of!(IClass, cl_Flags) - 48usize];
};
pub type Class = IClass;
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct _Object {
    pub o_Node: MinNode,
    pub o_Class: *mut IClass,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _Object"][::core::mem::size_of::<_Object>() - 12usize];
    ["Alignment of _Object"][::core::mem::align_of::<_Object>() - 2usize];
    ["Offset of field: _Object::o_Node"][::core::mem::offset_of!(_Object, o_Node) - 0usize];
    ["Offset of field: _Object::o_Class"][::core::mem::offset_of!(_Object, o_Class) - 8usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct ClassLibrary {
    pub cl_Lib: Library,
    pub cl_Pad: UWORD,
    pub cl_Class: *mut Class,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ClassLibrary"][::core::mem::size_of::<ClassLibrary>() - 40usize];
    ["Alignment of ClassLibrary"][::core::mem::align_of::<ClassLibrary>() - 2usize];
    ["Offset of field: ClassLibrary::cl_Lib"]
        [::core::mem::offset_of!(ClassLibrary, cl_Lib) - 0usize];
    ["Offset of field: ClassLibrary::cl_Pad"]
        [::core::mem::offset_of!(ClassLibrary, cl_Pad) - 34usize];
    ["Offset of field: ClassLibrary::cl_Class"]
        [::core::mem::offset_of!(ClassLibrary, cl_Class) - 36usize];
};
pub type Tag = ULONG;
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct TagItem {
    pub ti_Tag: Tag,
    pub ti_Data: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TagItem"][::core::mem::size_of::<TagItem>() - 8usize];
    ["Alignment of TagItem"][::core::mem::align_of::<TagItem>() - 2usize];
    ["Offset of field: TagItem::ti_Tag"][::core::mem::offset_of!(TagItem, ti_Tag) - 0usize];
    ["Offset of field: TagItem::ti_Data"][::core::mem::offset_of!(TagItem, ti_Data) - 4usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct apExecute {
    pub MethodID: ULONG,
    pub ape_CommandString: STRPTR,
    pub ape_PortName: STRPTR,
    pub ape_RC: *mut LONG,
    pub ape_RC2: *mut LONG,
    pub ape_Result: *mut STRPTR,
    pub ape_IO: BPTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of apExecute"][::core::mem::size_of::<apExecute>() - 28usize];
    ["Alignment of apExecute"][::core::mem::align_of::<apExecute>() - 2usize];
    ["Offset of field: apExecute::MethodID"][::core::mem::offset_of!(apExecute, MethodID) - 0usize];
    ["Offset of field: apExecute::ape_CommandString"]
        [::core::mem::offset_of!(apExecute, ape_CommandString) - 4usize];
    ["Offset of field: apExecute::ape_PortName"]
        [::core::mem::offset_of!(apExecute, ape_PortName) - 8usize];
    ["Offset of field: apExecute::ape_RC"][::core::mem::offset_of!(apExecute, ape_RC) - 12usize];
    ["Offset of field: apExecute::ape_RC2"][::core::mem::offset_of!(apExecute, ape_RC2) - 16usize];
    ["Offset of field: apExecute::ape_Result"]
        [::core::mem::offset_of!(apExecute, ape_Result) - 20usize];
    ["Offset of field: apExecute::ape_IO"][::core::mem::offset_of!(apExecute, ape_IO) - 24usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct ARexxCmd {
    pub ac_Name: STRPTR,
    pub ac_ID: UWORD,
    pub ac_Func: FPTR,
    pub ac_ArgTemplate: STRPTR,
    pub ac_Flags: ULONG,
    pub ac_ArgList: *mut ULONG,
    pub ac_RC: LONG,
    pub ac_RC2: LONG,
    pub ac_Result: STRPTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ARexxCmd"][::core::mem::size_of::<ARexxCmd>() - 34usize];
    ["Alignment of ARexxCmd"][::core::mem::align_of::<ARexxCmd>() - 2usize];
    ["Offset of field: ARexxCmd::ac_Name"][::core::mem::offset_of!(ARexxCmd, ac_Name) - 0usize];
    ["Offset of field: ARexxCmd::ac_ID"][::core::mem::offset_of!(ARexxCmd, ac_ID) - 4usize];
    ["Offset of field: ARexxCmd::ac_Func"][::core::mem::offset_of!(ARexxCmd, ac_Func) - 6usize];
    ["Offset of field: ARexxCmd::ac_ArgTemplate"]
        [::core::mem::offset_of!(ARexxCmd, ac_ArgTemplate) - 10usize];
    ["Offset of field: ARexxCmd::ac_Flags"][::core::mem::offset_of!(ARexxCmd, ac_Flags) - 14usize];
    ["Offset of field: ARexxCmd::ac_ArgList"]
        [::core::mem::offset_of!(ARexxCmd, ac_ArgList) - 18usize];
    ["Offset of field: ARexxCmd::ac_RC"][::core::mem::offset_of!(ARexxCmd, ac_RC) - 22usize];
    ["Offset of field: ARexxCmd::ac_RC2"][::core::mem::offset_of!(ARexxCmd, ac_RC2) - 26usize];
    ["Offset of field: ARexxCmd::ac_Result"]
        [::core::mem::offset_of!(ARexxCmd, ac_Result) - 30usize];
};
pub const REQIMAGE_DEFAULT: _bindgen_ty_2 = 0;
pub const REQIMAGE_INFO: _bindgen_ty_2 = 1;
pub const REQIMAGE_WARNING: _bindgen_ty_2 = 2;
pub const REQIMAGE_ERROR: _bindgen_ty_2 = 3;
pub const REQIMAGE_QUESTION: _bindgen_ty_2 = 4;
pub const REQIMAGE_INSERTDISK: _bindgen_ty_2 = 5;
pub type _bindgen_ty_2 = ::core::ffi::c_uint;
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct orRequest {
    pub MethodID: ULONG,
    pub or_Attrs: *mut TagItem,
    pub or_Window: *mut Window,
    pub or_Screen: *mut Screen,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of orRequest"][::core::mem::size_of::<orRequest>() - 16usize];
    ["Alignment of orRequest"][::core::mem::align_of::<orRequest>() - 2usize];
    ["Offset of field: orRequest::MethodID"][::core::mem::offset_of!(orRequest, MethodID) - 0usize];
    ["Offset of field: orRequest::or_Attrs"][::core::mem::offset_of!(orRequest, or_Attrs) - 4usize];
    ["Offset of field: orRequest::or_Window"]
        [::core::mem::offset_of!(orRequest, or_Window) - 8usize];
    ["Offset of field: orRequest::or_Screen"]
        [::core::mem::offset_of!(orRequest, or_Screen) - 12usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct wmHandle {
    pub MethodID: ULONG,
    pub wmh_Code: *mut WORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of wmHandle"][::core::mem::size_of::<wmHandle>() - 8usize];
    ["Alignment of wmHandle"][::core::mem::align_of::<wmHandle>() - 2usize];
    ["Offset of field: wmHandle::MethodID"][::core::mem::offset_of!(wmHandle, MethodID) - 0usize];
    ["Offset of field: wmHandle::wmh_Code"][::core::mem::offset_of!(wmHandle, wmh_Code) - 4usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct wmActivateGadget {
    pub MethodID: ULONG,
    pub wma_Object: *mut Gadget,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of wmActivateGadget"][::core::mem::size_of::<wmActivateGadget>() - 8usize];
    ["Alignment of wmActivateGadget"][::core::mem::align_of::<wmActivateGadget>() - 2usize];
    ["Offset of field: wmActivateGadget::MethodID"]
        [::core::mem::offset_of!(wmActivateGadget, MethodID) - 0usize];
    ["Offset of field: wmActivateGadget::wma_Object"]
        [::core::mem::offset_of!(wmActivateGadget, wma_Object) - 4usize];
};
pub const SnapHow_SAVE: SnapHow = 0;
pub const SnapHow_USE: SnapHow = 1;
pub type SnapHow = ::core::ffi::c_uint;
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct wmSnapshot {
    pub MethodID: ULONG,
    pub How: SnapHow,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of wmSnapshot"][::core::mem::size_of::<wmSnapshot>() - 8usize];
    ["Alignment of wmSnapshot"][::core::mem::align_of::<wmSnapshot>() - 2usize];
    ["Offset of field: wmSnapshot::MethodID"]
        [::core::mem::offset_of!(wmSnapshot, MethodID) - 0usize];
    ["Offset of field: wmSnapshot::How"][::core::mem::offset_of!(wmSnapshot, How) - 4usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct HintInfo {
    pub hi_GadgetID: WORD,
    pub hi_Code: WORD,
    pub hi_Text: STRPTR,
    pub hi_Flags: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HintInfo"][::core::mem::size_of::<HintInfo>() - 12usize];
    ["Alignment of HintInfo"][::core::mem::align_of::<HintInfo>() - 2usize];
    ["Offset of field: HintInfo::hi_GadgetID"]
        [::core::mem::offset_of!(HintInfo, hi_GadgetID) - 0usize];
    ["Offset of field: HintInfo::hi_Code"][::core::mem::offset_of!(HintInfo, hi_Code) - 2usize];
    ["Offset of field: HintInfo::hi_Text"][::core::mem::offset_of!(HintInfo, hi_Text) - 4usize];
    ["Offset of field: HintInfo::hi_Flags"][::core::mem::offset_of!(HintInfo, hi_Flags) - 8usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct ClipboardUnitPartial {
    pub cu_Node: Node,
    pub cu_UnitNum: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ClipboardUnitPartial"][::core::mem::size_of::<ClipboardUnitPartial>() - 18usize];
    ["Alignment of ClipboardUnitPartial"][::core::mem::align_of::<ClipboardUnitPartial>() - 2usize];
    ["Offset of field: ClipboardUnitPartial::cu_Node"]
        [::core::mem::offset_of!(ClipboardUnitPartial, cu_Node) - 0usize];
    ["Offset of field: ClipboardUnitPartial::cu_UnitNum"]
        [::core::mem::offset_of!(ClipboardUnitPartial, cu_UnitNum) - 14usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct IOClipReq {
    pub io_Message: Message,
    pub io_Device: *mut Device,
    pub io_Unit: *mut ClipboardUnitPartial,
    pub io_Command: UWORD,
    pub io_Flags: UBYTE,
    pub io_Error: BYTE,
    pub io_Actual: ULONG,
    pub io_Length: ULONG,
    pub io_Data: STRPTR,
    pub io_Offset: ULONG,
    pub io_ClipID: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IOClipReq"][::core::mem::size_of::<IOClipReq>() - 52usize];
    ["Alignment of IOClipReq"][::core::mem::align_of::<IOClipReq>() - 2usize];
    ["Offset of field: IOClipReq::io_Message"]
        [::core::mem::offset_of!(IOClipReq, io_Message) - 0usize];
    ["Offset of field: IOClipReq::io_Device"]
        [::core::mem::offset_of!(IOClipReq, io_Device) - 20usize];
    ["Offset of field: IOClipReq::io_Unit"][::core::mem::offset_of!(IOClipReq, io_Unit) - 24usize];
    ["Offset of field: IOClipReq::io_Command"]
        [::core::mem::offset_of!(IOClipReq, io_Command) - 28usize];
    ["Offset of field: IOClipReq::io_Flags"]
        [::core::mem::offset_of!(IOClipReq, io_Flags) - 30usize];
    ["Offset of field: IOClipReq::io_Error"]
        [::core::mem::offset_of!(IOClipReq, io_Error) - 31usize];
    ["Offset of field: IOClipReq::io_Actual"]
        [::core::mem::offset_of!(IOClipReq, io_Actual) - 32usize];
    ["Offset of field: IOClipReq::io_Length"]
        [::core::mem::offset_of!(IOClipReq, io_Length) - 36usize];
    ["Offset of field: IOClipReq::io_Data"][::core::mem::offset_of!(IOClipReq, io_Data) - 40usize];
    ["Offset of field: IOClipReq::io_Offset"]
        [::core::mem::offset_of!(IOClipReq, io_Offset) - 44usize];
    ["Offset of field: IOClipReq::io_ClipID"]
        [::core::mem::offset_of!(IOClipReq, io_ClipID) - 48usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct SatisfyMsg {
    pub sm_Msg: Message,
    pub sm_Unit: UWORD,
    pub sm_ClipID: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SatisfyMsg"][::core::mem::size_of::<SatisfyMsg>() - 26usize];
    ["Alignment of SatisfyMsg"][::core::mem::align_of::<SatisfyMsg>() - 2usize];
    ["Offset of field: SatisfyMsg::sm_Msg"][::core::mem::offset_of!(SatisfyMsg, sm_Msg) - 0usize];
    ["Offset of field: SatisfyMsg::sm_Unit"]
        [::core::mem::offset_of!(SatisfyMsg, sm_Unit) - 20usize];
    ["Offset of field: SatisfyMsg::sm_ClipID"]
        [::core::mem::offset_of!(SatisfyMsg, sm_ClipID) - 22usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct ClipHookMsg {
    pub chm_Type: ULONG,
    pub chm_ChangeCmd: LONG,
    pub chm_ClipID: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ClipHookMsg"][::core::mem::size_of::<ClipHookMsg>() - 12usize];
    ["Alignment of ClipHookMsg"][::core::mem::align_of::<ClipHookMsg>() - 2usize];
    ["Offset of field: ClipHookMsg::chm_Type"]
        [::core::mem::offset_of!(ClipHookMsg, chm_Type) - 0usize];
    ["Offset of field: ClipHookMsg::chm_ChangeCmd"]
        [::core::mem::offset_of!(ClipHookMsg, chm_ChangeCmd) - 4usize];
    ["Offset of field: ClipHookMsg::chm_ClipID"]
        [::core::mem::offset_of!(ClipHookMsg, chm_ClipID) - 8usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct IFFHandle {
    pub iff_Stream: ULONG,
    pub iff_Flags: ULONG,
    pub iff_Depth: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IFFHandle"][::core::mem::size_of::<IFFHandle>() - 12usize];
    ["Alignment of IFFHandle"][::core::mem::align_of::<IFFHandle>() - 2usize];
    ["Offset of field: IFFHandle::iff_Stream"]
        [::core::mem::offset_of!(IFFHandle, iff_Stream) - 0usize];
    ["Offset of field: IFFHandle::iff_Flags"]
        [::core::mem::offset_of!(IFFHandle, iff_Flags) - 4usize];
    ["Offset of field: IFFHandle::iff_Depth"]
        [::core::mem::offset_of!(IFFHandle, iff_Depth) - 8usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct IFFStreamCmd {
    pub sc_Command: LONG,
    pub sc_Buf: APTR,
    pub sc_NBytes: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IFFStreamCmd"][::core::mem::size_of::<IFFStreamCmd>() - 12usize];
    ["Alignment of IFFStreamCmd"][::core::mem::align_of::<IFFStreamCmd>() - 2usize];
    ["Offset of field: IFFStreamCmd::sc_Command"]
        [::core::mem::offset_of!(IFFStreamCmd, sc_Command) - 0usize];
    ["Offset of field: IFFStreamCmd::sc_Buf"]
        [::core::mem::offset_of!(IFFStreamCmd, sc_Buf) - 4usize];
    ["Offset of field: IFFStreamCmd::sc_NBytes"]
        [::core::mem::offset_of!(IFFStreamCmd, sc_NBytes) - 8usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct ContextNode {
    pub cn_Node: MinNode,
    pub cn_ID: LONG,
    pub cn_Type: LONG,
    pub cn_Size: LONG,
    pub cn_Scan: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ContextNode"][::core::mem::size_of::<ContextNode>() - 24usize];
    ["Alignment of ContextNode"][::core::mem::align_of::<ContextNode>() - 2usize];
    ["Offset of field: ContextNode::cn_Node"]
        [::core::mem::offset_of!(ContextNode, cn_Node) - 0usize];
    ["Offset of field: ContextNode::cn_ID"][::core::mem::offset_of!(ContextNode, cn_ID) - 8usize];
    ["Offset of field: ContextNode::cn_Type"]
        [::core::mem::offset_of!(ContextNode, cn_Type) - 12usize];
    ["Offset of field: ContextNode::cn_Size"]
        [::core::mem::offset_of!(ContextNode, cn_Size) - 16usize];
    ["Offset of field: ContextNode::cn_Scan"]
        [::core::mem::offset_of!(ContextNode, cn_Scan) - 20usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct LocalContextItem {
    pub lci_Node: MinNode,
    pub lci_ID: ULONG,
    pub lci_Type: ULONG,
    pub lci_Ident: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of LocalContextItem"][::core::mem::size_of::<LocalContextItem>() - 20usize];
    ["Alignment of LocalContextItem"][::core::mem::align_of::<LocalContextItem>() - 2usize];
    ["Offset of field: LocalContextItem::lci_Node"]
        [::core::mem::offset_of!(LocalContextItem, lci_Node) - 0usize];
    ["Offset of field: LocalContextItem::lci_ID"]
        [::core::mem::offset_of!(LocalContextItem, lci_ID) - 8usize];
    ["Offset of field: LocalContextItem::lci_Type"]
        [::core::mem::offset_of!(LocalContextItem, lci_Type) - 12usize];
    ["Offset of field: LocalContextItem::lci_Ident"]
        [::core::mem::offset_of!(LocalContextItem, lci_Ident) - 16usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct StoredProperty {
    pub sp_Size: LONG,
    pub sp_Data: APTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StoredProperty"][::core::mem::size_of::<StoredProperty>() - 8usize];
    ["Alignment of StoredProperty"][::core::mem::align_of::<StoredProperty>() - 2usize];
    ["Offset of field: StoredProperty::sp_Size"]
        [::core::mem::offset_of!(StoredProperty, sp_Size) - 0usize];
    ["Offset of field: StoredProperty::sp_Data"]
        [::core::mem::offset_of!(StoredProperty, sp_Data) - 4usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct CollectionItem {
    pub ci_Next: *mut CollectionItem,
    pub ci_Size: LONG,
    pub ci_Data: APTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CollectionItem"][::core::mem::size_of::<CollectionItem>() - 12usize];
    ["Alignment of CollectionItem"][::core::mem::align_of::<CollectionItem>() - 2usize];
    ["Offset of field: CollectionItem::ci_Next"]
        [::core::mem::offset_of!(CollectionItem, ci_Next) - 0usize];
    ["Offset of field: CollectionItem::ci_Size"]
        [::core::mem::offset_of!(CollectionItem, ci_Size) - 4usize];
    ["Offset of field: CollectionItem::ci_Data"]
        [::core::mem::offset_of!(CollectionItem, ci_Data) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ClipboardHandle {
    pub cbh_Req: IOClipReq,
    pub cbh_CBport: MsgPort,
    pub cbh_SatisfyPort: MsgPort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ClipboardHandle"][::core::mem::size_of::<ClipboardHandle>() - 120usize];
    ["Alignment of ClipboardHandle"][::core::mem::align_of::<ClipboardHandle>() - 2usize];
    ["Offset of field: ClipboardHandle::cbh_Req"]
        [::core::mem::offset_of!(ClipboardHandle, cbh_Req) - 0usize];
    ["Offset of field: ClipboardHandle::cbh_CBport"]
        [::core::mem::offset_of!(ClipboardHandle, cbh_CBport) - 52usize];
    ["Offset of field: ClipboardHandle::cbh_SatisfyPort"]
        [::core::mem::offset_of!(ClipboardHandle, cbh_SatisfyPort) - 86usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct DataTypeHeader {
    pub dth_Name: STRPTR,
    pub dth_BaseName: STRPTR,
    pub dth_Pattern: STRPTR,
    pub dth_Mask: *mut WORD,
    pub dth_GroupID: ULONG,
    pub dth_ID: ULONG,
    pub dth_MaskLen: WORD,
    pub dth_Pad: WORD,
    pub dth_Flags: UWORD,
    pub dth_Priority: UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DataTypeHeader"][::core::mem::size_of::<DataTypeHeader>() - 32usize];
    ["Alignment of DataTypeHeader"][::core::mem::align_of::<DataTypeHeader>() - 2usize];
    ["Offset of field: DataTypeHeader::dth_Name"]
        [::core::mem::offset_of!(DataTypeHeader, dth_Name) - 0usize];
    ["Offset of field: DataTypeHeader::dth_BaseName"]
        [::core::mem::offset_of!(DataTypeHeader, dth_BaseName) - 4usize];
    ["Offset of field: DataTypeHeader::dth_Pattern"]
        [::core::mem::offset_of!(DataTypeHeader, dth_Pattern) - 8usize];
    ["Offset of field: DataTypeHeader::dth_Mask"]
        [::core::mem::offset_of!(DataTypeHeader, dth_Mask) - 12usize];
    ["Offset of field: DataTypeHeader::dth_GroupID"]
        [::core::mem::offset_of!(DataTypeHeader, dth_GroupID) - 16usize];
    ["Offset of field: DataTypeHeader::dth_ID"]
        [::core::mem::offset_of!(DataTypeHeader, dth_ID) - 20usize];
    ["Offset of field: DataTypeHeader::dth_MaskLen"]
        [::core::mem::offset_of!(DataTypeHeader, dth_MaskLen) - 24usize];
    ["Offset of field: DataTypeHeader::dth_Pad"]
        [::core::mem::offset_of!(DataTypeHeader, dth_Pad) - 26usize];
    ["Offset of field: DataTypeHeader::dth_Flags"]
        [::core::mem::offset_of!(DataTypeHeader, dth_Flags) - 28usize];
    ["Offset of field: DataTypeHeader::dth_Priority"]
        [::core::mem::offset_of!(DataTypeHeader, dth_Priority) - 30usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct DTHookContext {
    pub dthc_SysBase: *mut Library,
    pub dthc_DOSBase: *mut Library,
    pub dthc_IFFParseBase: *mut Library,
    pub dthc_UtilityBase: *mut Library,
    pub dthc_Lock: BPTR,
    pub dthc_FIB: *mut FileInfoBlock,
    pub dthc_FileHandle: BPTR,
    pub dthc_IFF: *mut IFFHandle,
    pub dthc_Buffer: STRPTR,
    pub dthc_BufferLength: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DTHookContext"][::core::mem::size_of::<DTHookContext>() - 40usize];
    ["Alignment of DTHookContext"][::core::mem::align_of::<DTHookContext>() - 2usize];
    ["Offset of field: DTHookContext::dthc_SysBase"]
        [::core::mem::offset_of!(DTHookContext, dthc_SysBase) - 0usize];
    ["Offset of field: DTHookContext::dthc_DOSBase"]
        [::core::mem::offset_of!(DTHookContext, dthc_DOSBase) - 4usize];
    ["Offset of field: DTHookContext::dthc_IFFParseBase"]
        [::core::mem::offset_of!(DTHookContext, dthc_IFFParseBase) - 8usize];
    ["Offset of field: DTHookContext::dthc_UtilityBase"]
        [::core::mem::offset_of!(DTHookContext, dthc_UtilityBase) - 12usize];
    ["Offset of field: DTHookContext::dthc_Lock"]
        [::core::mem::offset_of!(DTHookContext, dthc_Lock) - 16usize];
    ["Offset of field: DTHookContext::dthc_FIB"]
        [::core::mem::offset_of!(DTHookContext, dthc_FIB) - 20usize];
    ["Offset of field: DTHookContext::dthc_FileHandle"]
        [::core::mem::offset_of!(DTHookContext, dthc_FileHandle) - 24usize];
    ["Offset of field: DTHookContext::dthc_IFF"]
        [::core::mem::offset_of!(DTHookContext, dthc_IFF) - 28usize];
    ["Offset of field: DTHookContext::dthc_Buffer"]
        [::core::mem::offset_of!(DTHookContext, dthc_Buffer) - 32usize];
    ["Offset of field: DTHookContext::dthc_BufferLength"]
        [::core::mem::offset_of!(DTHookContext, dthc_BufferLength) - 36usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct Tool {
    pub tn_Which: UWORD,
    pub tn_Flags: UWORD,
    pub tn_Program: STRPTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Tool"][::core::mem::size_of::<Tool>() - 8usize];
    ["Alignment of Tool"][::core::mem::align_of::<Tool>() - 2usize];
    ["Offset of field: Tool::tn_Which"][::core::mem::offset_of!(Tool, tn_Which) - 0usize];
    ["Offset of field: Tool::tn_Flags"][::core::mem::offset_of!(Tool, tn_Flags) - 2usize];
    ["Offset of field: Tool::tn_Program"][::core::mem::offset_of!(Tool, tn_Program) - 4usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct DataType {
    pub dtn_Node1: Node,
    pub dtn_Node2: Node,
    pub dtn_Header: *mut DataTypeHeader,
    pub dtn_ToolList: List,
    pub dtn_FunctionName: STRPTR,
    pub dtn_AttrList: *mut TagItem,
    pub dtn_Length: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DataType"][::core::mem::size_of::<DataType>() - 58usize];
    ["Alignment of DataType"][::core::mem::align_of::<DataType>() - 2usize];
    ["Offset of field: DataType::dtn_Node1"][::core::mem::offset_of!(DataType, dtn_Node1) - 0usize];
    ["Offset of field: DataType::dtn_Node2"]
        [::core::mem::offset_of!(DataType, dtn_Node2) - 14usize];
    ["Offset of field: DataType::dtn_Header"]
        [::core::mem::offset_of!(DataType, dtn_Header) - 28usize];
    ["Offset of field: DataType::dtn_ToolList"]
        [::core::mem::offset_of!(DataType, dtn_ToolList) - 32usize];
    ["Offset of field: DataType::dtn_FunctionName"]
        [::core::mem::offset_of!(DataType, dtn_FunctionName) - 46usize];
    ["Offset of field: DataType::dtn_AttrList"]
        [::core::mem::offset_of!(DataType, dtn_AttrList) - 50usize];
    ["Offset of field: DataType::dtn_Length"]
        [::core::mem::offset_of!(DataType, dtn_Length) - 54usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct ToolNode {
    pub tn_Node: Node,
    pub tn_Tool: Tool,
    pub tn_Length: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ToolNode"][::core::mem::size_of::<ToolNode>() - 26usize];
    ["Alignment of ToolNode"][::core::mem::align_of::<ToolNode>() - 2usize];
    ["Offset of field: ToolNode::tn_Node"][::core::mem::offset_of!(ToolNode, tn_Node) - 0usize];
    ["Offset of field: ToolNode::tn_Tool"][::core::mem::offset_of!(ToolNode, tn_Tool) - 14usize];
    ["Offset of field: ToolNode::tn_Length"]
        [::core::mem::offset_of!(ToolNode, tn_Length) - 22usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Rectangle {
    pub MinX: WORD,
    pub MinY: WORD,
    pub MaxX: WORD,
    pub MaxY: WORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Rectangle"][::core::mem::size_of::<Rectangle>() - 8usize];
    ["Alignment of Rectangle"][::core::mem::align_of::<Rectangle>() - 2usize];
    ["Offset of field: Rectangle::MinX"][::core::mem::offset_of!(Rectangle, MinX) - 0usize];
    ["Offset of field: Rectangle::MinY"][::core::mem::offset_of!(Rectangle, MinY) - 2usize];
    ["Offset of field: Rectangle::MaxX"][::core::mem::offset_of!(Rectangle, MaxX) - 4usize];
    ["Offset of field: Rectangle::MaxY"][::core::mem::offset_of!(Rectangle, MaxY) - 6usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct Rect32 {
    pub MinX: LONG,
    pub MinY: LONG,
    pub MaxX: LONG,
    pub MaxY: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Rect32"][::core::mem::size_of::<Rect32>() - 16usize];
    ["Alignment of Rect32"][::core::mem::align_of::<Rect32>() - 2usize];
    ["Offset of field: Rect32::MinX"][::core::mem::offset_of!(Rect32, MinX) - 0usize];
    ["Offset of field: Rect32::MinY"][::core::mem::offset_of!(Rect32, MinY) - 4usize];
    ["Offset of field: Rect32::MaxX"][::core::mem::offset_of!(Rect32, MaxX) - 8usize];
    ["Offset of field: Rect32::MaxY"][::core::mem::offset_of!(Rect32, MaxY) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tPoint {
    pub x: WORD,
    pub y: WORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tPoint"][::core::mem::size_of::<tPoint>() - 4usize];
    ["Alignment of tPoint"][::core::mem::align_of::<tPoint>() - 2usize];
    ["Offset of field: tPoint::x"][::core::mem::offset_of!(tPoint, x) - 0usize];
    ["Offset of field: tPoint::y"][::core::mem::offset_of!(tPoint, y) - 2usize];
};
pub type Point = tPoint;
pub type PLANEPTR = *mut UBYTE;
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct BitMap {
    pub BytesPerRow: UWORD,
    pub Rows: UWORD,
    pub Flags: UBYTE,
    pub Depth: UBYTE,
    pub pad: UWORD,
    pub Planes: [PLANEPTR; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BitMap"][::core::mem::size_of::<BitMap>() - 40usize];
    ["Alignment of BitMap"][::core::mem::align_of::<BitMap>() - 2usize];
    ["Offset of field: BitMap::BytesPerRow"][::core::mem::offset_of!(BitMap, BytesPerRow) - 0usize];
    ["Offset of field: BitMap::Rows"][::core::mem::offset_of!(BitMap, Rows) - 2usize];
    ["Offset of field: BitMap::Flags"][::core::mem::offset_of!(BitMap, Flags) - 4usize];
    ["Offset of field: BitMap::Depth"][::core::mem::offset_of!(BitMap, Depth) - 5usize];
    ["Offset of field: BitMap::pad"][::core::mem::offset_of!(BitMap, pad) - 6usize];
    ["Offset of field: BitMap::Planes"][::core::mem::offset_of!(BitMap, Planes) - 8usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct Layer {
    pub front: *mut Layer,
    pub back: *mut Layer,
    pub ClipRect: *mut ClipRect,
    pub rp: *mut RastPort,
    pub bounds: Rectangle,
    pub nlink: *mut Layer,
    pub priority: UWORD,
    pub Flags: UWORD,
    pub SuperBitMap: *mut BitMap,
    pub SuperClipRect: *mut ClipRect,
    pub Window: APTR,
    pub Scroll_X: WORD,
    pub Scroll_Y: WORD,
    pub OnScreen: *mut ClipRect,
    pub OffScreen: *mut ClipRect,
    pub Backup: *mut ClipRect,
    pub SuperSaveClipRects: *mut ClipRect,
    pub Undamaged: *mut ClipRect,
    pub LayerInfo: *mut Layer_Info,
    pub Lock: SignalSemaphore,
    pub BackFill: *mut Hook,
    pub reserved1: ULONG,
    pub ClipRegion: *mut Region,
    pub clipped: *mut ClipRect,
    pub Width: WORD,
    pub Height: WORD,
    pub reserved2: [UBYTE; 18usize],
    pub DamageList: *mut Region,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Layer"][::core::mem::size_of::<Layer>() - 160usize];
    ["Alignment of Layer"][::core::mem::align_of::<Layer>() - 2usize];
    ["Offset of field: Layer::front"][::core::mem::offset_of!(Layer, front) - 0usize];
    ["Offset of field: Layer::back"][::core::mem::offset_of!(Layer, back) - 4usize];
    ["Offset of field: Layer::ClipRect"][::core::mem::offset_of!(Layer, ClipRect) - 8usize];
    ["Offset of field: Layer::rp"][::core::mem::offset_of!(Layer, rp) - 12usize];
    ["Offset of field: Layer::bounds"][::core::mem::offset_of!(Layer, bounds) - 16usize];
    ["Offset of field: Layer::nlink"][::core::mem::offset_of!(Layer, nlink) - 24usize];
    ["Offset of field: Layer::priority"][::core::mem::offset_of!(Layer, priority) - 28usize];
    ["Offset of field: Layer::Flags"][::core::mem::offset_of!(Layer, Flags) - 30usize];
    ["Offset of field: Layer::SuperBitMap"][::core::mem::offset_of!(Layer, SuperBitMap) - 32usize];
    ["Offset of field: Layer::SuperClipRect"]
        [::core::mem::offset_of!(Layer, SuperClipRect) - 36usize];
    ["Offset of field: Layer::Window"][::core::mem::offset_of!(Layer, Window) - 40usize];
    ["Offset of field: Layer::Scroll_X"][::core::mem::offset_of!(Layer, Scroll_X) - 44usize];
    ["Offset of field: Layer::Scroll_Y"][::core::mem::offset_of!(Layer, Scroll_Y) - 46usize];
    ["Offset of field: Layer::OnScreen"][::core::mem::offset_of!(Layer, OnScreen) - 48usize];
    ["Offset of field: Layer::OffScreen"][::core::mem::offset_of!(Layer, OffScreen) - 52usize];
    ["Offset of field: Layer::Backup"][::core::mem::offset_of!(Layer, Backup) - 56usize];
    ["Offset of field: Layer::SuperSaveClipRects"]
        [::core::mem::offset_of!(Layer, SuperSaveClipRects) - 60usize];
    ["Offset of field: Layer::Undamaged"][::core::mem::offset_of!(Layer, Undamaged) - 64usize];
    ["Offset of field: Layer::LayerInfo"][::core::mem::offset_of!(Layer, LayerInfo) - 68usize];
    ["Offset of field: Layer::Lock"][::core::mem::offset_of!(Layer, Lock) - 72usize];
    ["Offset of field: Layer::BackFill"][::core::mem::offset_of!(Layer, BackFill) - 118usize];
    ["Offset of field: Layer::reserved1"][::core::mem::offset_of!(Layer, reserved1) - 122usize];
    ["Offset of field: Layer::ClipRegion"][::core::mem::offset_of!(Layer, ClipRegion) - 126usize];
    ["Offset of field: Layer::clipped"][::core::mem::offset_of!(Layer, clipped) - 130usize];
    ["Offset of field: Layer::Width"][::core::mem::offset_of!(Layer, Width) - 134usize];
    ["Offset of field: Layer::Height"][::core::mem::offset_of!(Layer, Height) - 136usize];
    ["Offset of field: Layer::reserved2"][::core::mem::offset_of!(Layer, reserved2) - 138usize];
    ["Offset of field: Layer::DamageList"][::core::mem::offset_of!(Layer, DamageList) - 156usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct ClipRect {
    pub Next: *mut ClipRect,
    pub reservedlink: *mut ClipRect,
    pub obscured: LONG,
    pub BitMap: *mut BitMap,
    pub bounds: Rectangle,
    pub vlink: *mut ClipRect,
    pub home: *mut Layer_Info,
    pub reserved: APTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ClipRect"][::core::mem::size_of::<ClipRect>() - 36usize];
    ["Alignment of ClipRect"][::core::mem::align_of::<ClipRect>() - 2usize];
    ["Offset of field: ClipRect::Next"][::core::mem::offset_of!(ClipRect, Next) - 0usize];
    ["Offset of field: ClipRect::reservedlink"]
        [::core::mem::offset_of!(ClipRect, reservedlink) - 4usize];
    ["Offset of field: ClipRect::obscured"][::core::mem::offset_of!(ClipRect, obscured) - 8usize];
    ["Offset of field: ClipRect::BitMap"][::core::mem::offset_of!(ClipRect, BitMap) - 12usize];
    ["Offset of field: ClipRect::bounds"][::core::mem::offset_of!(ClipRect, bounds) - 16usize];
    ["Offset of field: ClipRect::vlink"][::core::mem::offset_of!(ClipRect, vlink) - 24usize];
    ["Offset of field: ClipRect::home"][::core::mem::offset_of!(ClipRect, home) - 28usize];
    ["Offset of field: ClipRect::reserved"][::core::mem::offset_of!(ClipRect, reserved) - 32usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CopIns {
    pub OpCode: WORD,
    pub u3: CopIns__bindgen_ty_1,
}
#[repr(C, packed(2))]
#[derive(Copy, Clone)]
pub union CopIns__bindgen_ty_1 {
    pub nxtlist: *mut CopList,
    pub u4: CopIns__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CopIns__bindgen_ty_1__bindgen_ty_1 {
    pub u1: CopIns__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    pub u2: CopIns__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CopIns__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    pub VWaitPos: WORD,
    pub DestAddr: WORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CopIns__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<CopIns__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Alignment of CopIns__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<CopIns__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Offset of field: CopIns__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::VWaitPos"][::core::mem::offset_of!(
        CopIns__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        VWaitPos
    ) - 0usize];
    ["Offset of field: CopIns__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::DestAddr"][::core::mem::offset_of!(
        CopIns__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        DestAddr
    ) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union CopIns__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2 {
    pub HWaitPos: WORD,
    pub DestData: WORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CopIns__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::size_of::<CopIns__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2>() - 2usize];
    ["Alignment of CopIns__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::align_of::<CopIns__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2>() - 2usize];
    ["Offset of field: CopIns__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2::HWaitPos"][::core::mem::offset_of!(
        CopIns__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
        HWaitPos
    ) - 0usize];
    ["Offset of field: CopIns__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2::DestData"][::core::mem::offset_of!(
        CopIns__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
        DestData
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CopIns__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<CopIns__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Alignment of CopIns__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<CopIns__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Offset of field: CopIns__bindgen_ty_1__bindgen_ty_1::u1"]
        [::core::mem::offset_of!(CopIns__bindgen_ty_1__bindgen_ty_1, u1) - 0usize];
    ["Offset of field: CopIns__bindgen_ty_1__bindgen_ty_1::u2"]
        [::core::mem::offset_of!(CopIns__bindgen_ty_1__bindgen_ty_1, u2) - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CopIns__bindgen_ty_1"][::core::mem::size_of::<CopIns__bindgen_ty_1>() - 4usize];
    ["Alignment of CopIns__bindgen_ty_1"][::core::mem::align_of::<CopIns__bindgen_ty_1>() - 2usize];
    ["Offset of field: CopIns__bindgen_ty_1::nxtlist"]
        [::core::mem::offset_of!(CopIns__bindgen_ty_1, nxtlist) - 0usize];
    ["Offset of field: CopIns__bindgen_ty_1::u4"]
        [::core::mem::offset_of!(CopIns__bindgen_ty_1, u4) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CopIns"][::core::mem::size_of::<CopIns>() - 6usize];
    ["Alignment of CopIns"][::core::mem::align_of::<CopIns>() - 2usize];
    ["Offset of field: CopIns::OpCode"][::core::mem::offset_of!(CopIns, OpCode) - 0usize];
    ["Offset of field: CopIns::u3"][::core::mem::offset_of!(CopIns, u3) - 2usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct cprlist {
    pub Next: *mut cprlist,
    pub start: *mut UWORD,
    pub MaxCount: WORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cprlist"][::core::mem::size_of::<cprlist>() - 10usize];
    ["Alignment of cprlist"][::core::mem::align_of::<cprlist>() - 2usize];
    ["Offset of field: cprlist::Next"][::core::mem::offset_of!(cprlist, Next) - 0usize];
    ["Offset of field: cprlist::start"][::core::mem::offset_of!(cprlist, start) - 4usize];
    ["Offset of field: cprlist::MaxCount"][::core::mem::offset_of!(cprlist, MaxCount) - 8usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct CopList {
    pub Next: *mut CopList,
    pub _CopList: *mut CopList,
    pub _ViewPort: *mut ViewPort,
    pub CopIns: *mut CopIns,
    pub CopPtr: *mut CopIns,
    pub CopLStart: *mut UWORD,
    pub CopSStart: *mut UWORD,
    pub Count: WORD,
    pub MaxCount: WORD,
    pub DyOffset: WORD,
    pub SLRepeat: UWORD,
    pub Flags: UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CopList"][::core::mem::size_of::<CopList>() - 38usize];
    ["Alignment of CopList"][::core::mem::align_of::<CopList>() - 2usize];
    ["Offset of field: CopList::Next"][::core::mem::offset_of!(CopList, Next) - 0usize];
    ["Offset of field: CopList::_CopList"][::core::mem::offset_of!(CopList, _CopList) - 4usize];
    ["Offset of field: CopList::_ViewPort"][::core::mem::offset_of!(CopList, _ViewPort) - 8usize];
    ["Offset of field: CopList::CopIns"][::core::mem::offset_of!(CopList, CopIns) - 12usize];
    ["Offset of field: CopList::CopPtr"][::core::mem::offset_of!(CopList, CopPtr) - 16usize];
    ["Offset of field: CopList::CopLStart"][::core::mem::offset_of!(CopList, CopLStart) - 20usize];
    ["Offset of field: CopList::CopSStart"][::core::mem::offset_of!(CopList, CopSStart) - 24usize];
    ["Offset of field: CopList::Count"][::core::mem::offset_of!(CopList, Count) - 28usize];
    ["Offset of field: CopList::MaxCount"][::core::mem::offset_of!(CopList, MaxCount) - 30usize];
    ["Offset of field: CopList::DyOffset"][::core::mem::offset_of!(CopList, DyOffset) - 32usize];
    ["Offset of field: CopList::SLRepeat"][::core::mem::offset_of!(CopList, SLRepeat) - 34usize];
    ["Offset of field: CopList::Flags"][::core::mem::offset_of!(CopList, Flags) - 36usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct UCopList {
    pub Next: *mut UCopList,
    pub FirstCopList: *mut CopList,
    pub CopList: *mut CopList,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of UCopList"][::core::mem::size_of::<UCopList>() - 12usize];
    ["Alignment of UCopList"][::core::mem::align_of::<UCopList>() - 2usize];
    ["Offset of field: UCopList::Next"][::core::mem::offset_of!(UCopList, Next) - 0usize];
    ["Offset of field: UCopList::FirstCopList"]
        [::core::mem::offset_of!(UCopList, FirstCopList) - 4usize];
    ["Offset of field: UCopList::CopList"][::core::mem::offset_of!(UCopList, CopList) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct copinit {
    pub vsync_hblank: [UWORD; 2usize],
    pub diagstrt: [UWORD; 12usize],
    pub fm0: [UWORD; 2usize],
    pub diwstart: [UWORD; 10usize],
    pub bplcon2: [UWORD; 2usize],
    pub sprfix: [UWORD; 16usize],
    pub sprstrtup: [UWORD; 32usize],
    pub wait14: [UWORD; 2usize],
    pub norm_hblank: [UWORD; 2usize],
    pub jump: [UWORD; 2usize],
    pub wait_forever: [UWORD; 6usize],
    pub sprstop: [UWORD; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of copinit"][::core::mem::size_of::<copinit>() - 192usize];
    ["Alignment of copinit"][::core::mem::align_of::<copinit>() - 2usize];
    ["Offset of field: copinit::vsync_hblank"]
        [::core::mem::offset_of!(copinit, vsync_hblank) - 0usize];
    ["Offset of field: copinit::diagstrt"][::core::mem::offset_of!(copinit, diagstrt) - 4usize];
    ["Offset of field: copinit::fm0"][::core::mem::offset_of!(copinit, fm0) - 28usize];
    ["Offset of field: copinit::diwstart"][::core::mem::offset_of!(copinit, diwstart) - 32usize];
    ["Offset of field: copinit::bplcon2"][::core::mem::offset_of!(copinit, bplcon2) - 52usize];
    ["Offset of field: copinit::sprfix"][::core::mem::offset_of!(copinit, sprfix) - 56usize];
    ["Offset of field: copinit::sprstrtup"][::core::mem::offset_of!(copinit, sprstrtup) - 88usize];
    ["Offset of field: copinit::wait14"][::core::mem::offset_of!(copinit, wait14) - 152usize];
    ["Offset of field: copinit::norm_hblank"]
        [::core::mem::offset_of!(copinit, norm_hblank) - 156usize];
    ["Offset of field: copinit::jump"][::core::mem::offset_of!(copinit, jump) - 160usize];
    ["Offset of field: copinit::wait_forever"]
        [::core::mem::offset_of!(copinit, wait_forever) - 164usize];
    ["Offset of field: copinit::sprstop"][::core::mem::offset_of!(copinit, sprstop) - 176usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct ExtendedNode {
    pub xln_Succ: *mut Node,
    pub xln_Pred: *mut Node,
    pub xln_Type: UBYTE,
    pub xln_Pri: BYTE,
    pub xln_Name: *mut ::core::ffi::c_char,
    pub xln_Subsystem: UBYTE,
    pub xln_Subtype: UBYTE,
    pub xln_Library: *mut GfxBase,
    pub xln_Init: FPTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ExtendedNode"][::core::mem::size_of::<ExtendedNode>() - 24usize];
    ["Alignment of ExtendedNode"][::core::mem::align_of::<ExtendedNode>() - 2usize];
    ["Offset of field: ExtendedNode::xln_Succ"]
        [::core::mem::offset_of!(ExtendedNode, xln_Succ) - 0usize];
    ["Offset of field: ExtendedNode::xln_Pred"]
        [::core::mem::offset_of!(ExtendedNode, xln_Pred) - 4usize];
    ["Offset of field: ExtendedNode::xln_Type"]
        [::core::mem::offset_of!(ExtendedNode, xln_Type) - 8usize];
    ["Offset of field: ExtendedNode::xln_Pri"]
        [::core::mem::offset_of!(ExtendedNode, xln_Pri) - 9usize];
    ["Offset of field: ExtendedNode::xln_Name"]
        [::core::mem::offset_of!(ExtendedNode, xln_Name) - 10usize];
    ["Offset of field: ExtendedNode::xln_Subsystem"]
        [::core::mem::offset_of!(ExtendedNode, xln_Subsystem) - 14usize];
    ["Offset of field: ExtendedNode::xln_Subtype"]
        [::core::mem::offset_of!(ExtendedNode, xln_Subtype) - 15usize];
    ["Offset of field: ExtendedNode::xln_Library"]
        [::core::mem::offset_of!(ExtendedNode, xln_Library) - 16usize];
    ["Offset of field: ExtendedNode::xln_Init"]
        [::core::mem::offset_of!(ExtendedNode, xln_Init) - 20usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct MonitorSpec {
    pub ms_Node: ExtendedNode,
    pub ms_Flags: UWORD,
    pub ratioh: LONG,
    pub ratiov: LONG,
    pub total_rows: UWORD,
    pub total_colorclocks: UWORD,
    pub DeniseMaxDisplayColumn: UWORD,
    pub BeamCon0: UWORD,
    pub min_row: UWORD,
    pub ms_Special: *mut SpecialMonitor,
    pub ms_OpenCount: WORD,
    pub ms_transform: FPTR,
    pub ms_translate: FPTR,
    pub ms_scale: FPTR,
    pub ms_xoffset: UWORD,
    pub ms_yoffset: UWORD,
    pub ms_LegalView: Rectangle,
    pub ms_maxoscan: FPTR,
    pub ms_videoscan: FPTR,
    pub DeniseMinDisplayColumn: UWORD,
    pub DisplayCompatible: ULONG,
    pub DisplayInfoDataBase: List,
    pub DisplayInfoDataBaseSemaphore: SignalSemaphore,
    pub ms_MrgCop: FPTR,
    pub ms_LoadView: FPTR,
    pub ms_KillView: FPTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MonitorSpec"][::core::mem::size_of::<MonitorSpec>() - 160usize];
    ["Alignment of MonitorSpec"][::core::mem::align_of::<MonitorSpec>() - 2usize];
    ["Offset of field: MonitorSpec::ms_Node"]
        [::core::mem::offset_of!(MonitorSpec, ms_Node) - 0usize];
    ["Offset of field: MonitorSpec::ms_Flags"]
        [::core::mem::offset_of!(MonitorSpec, ms_Flags) - 24usize];
    ["Offset of field: MonitorSpec::ratioh"]
        [::core::mem::offset_of!(MonitorSpec, ratioh) - 26usize];
    ["Offset of field: MonitorSpec::ratiov"]
        [::core::mem::offset_of!(MonitorSpec, ratiov) - 30usize];
    ["Offset of field: MonitorSpec::total_rows"]
        [::core::mem::offset_of!(MonitorSpec, total_rows) - 34usize];
    ["Offset of field: MonitorSpec::total_colorclocks"]
        [::core::mem::offset_of!(MonitorSpec, total_colorclocks) - 36usize];
    ["Offset of field: MonitorSpec::DeniseMaxDisplayColumn"]
        [::core::mem::offset_of!(MonitorSpec, DeniseMaxDisplayColumn) - 38usize];
    ["Offset of field: MonitorSpec::BeamCon0"]
        [::core::mem::offset_of!(MonitorSpec, BeamCon0) - 40usize];
    ["Offset of field: MonitorSpec::min_row"]
        [::core::mem::offset_of!(MonitorSpec, min_row) - 42usize];
    ["Offset of field: MonitorSpec::ms_Special"]
        [::core::mem::offset_of!(MonitorSpec, ms_Special) - 44usize];
    ["Offset of field: MonitorSpec::ms_OpenCount"]
        [::core::mem::offset_of!(MonitorSpec, ms_OpenCount) - 48usize];
    ["Offset of field: MonitorSpec::ms_transform"]
        [::core::mem::offset_of!(MonitorSpec, ms_transform) - 50usize];
    ["Offset of field: MonitorSpec::ms_translate"]
        [::core::mem::offset_of!(MonitorSpec, ms_translate) - 54usize];
    ["Offset of field: MonitorSpec::ms_scale"]
        [::core::mem::offset_of!(MonitorSpec, ms_scale) - 58usize];
    ["Offset of field: MonitorSpec::ms_xoffset"]
        [::core::mem::offset_of!(MonitorSpec, ms_xoffset) - 62usize];
    ["Offset of field: MonitorSpec::ms_yoffset"]
        [::core::mem::offset_of!(MonitorSpec, ms_yoffset) - 64usize];
    ["Offset of field: MonitorSpec::ms_LegalView"]
        [::core::mem::offset_of!(MonitorSpec, ms_LegalView) - 66usize];
    ["Offset of field: MonitorSpec::ms_maxoscan"]
        [::core::mem::offset_of!(MonitorSpec, ms_maxoscan) - 74usize];
    ["Offset of field: MonitorSpec::ms_videoscan"]
        [::core::mem::offset_of!(MonitorSpec, ms_videoscan) - 78usize];
    ["Offset of field: MonitorSpec::DeniseMinDisplayColumn"]
        [::core::mem::offset_of!(MonitorSpec, DeniseMinDisplayColumn) - 82usize];
    ["Offset of field: MonitorSpec::DisplayCompatible"]
        [::core::mem::offset_of!(MonitorSpec, DisplayCompatible) - 84usize];
    ["Offset of field: MonitorSpec::DisplayInfoDataBase"]
        [::core::mem::offset_of!(MonitorSpec, DisplayInfoDataBase) - 88usize];
    ["Offset of field: MonitorSpec::DisplayInfoDataBaseSemaphore"]
        [::core::mem::offset_of!(MonitorSpec, DisplayInfoDataBaseSemaphore) - 102usize];
    ["Offset of field: MonitorSpec::ms_MrgCop"]
        [::core::mem::offset_of!(MonitorSpec, ms_MrgCop) - 148usize];
    ["Offset of field: MonitorSpec::ms_LoadView"]
        [::core::mem::offset_of!(MonitorSpec, ms_LoadView) - 152usize];
    ["Offset of field: MonitorSpec::ms_KillView"]
        [::core::mem::offset_of!(MonitorSpec, ms_KillView) - 156usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AnalogSignalInterval {
    pub asi_Start: UWORD,
    pub asi_Stop: UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AnalogSignalInterval"][::core::mem::size_of::<AnalogSignalInterval>() - 4usize];
    ["Alignment of AnalogSignalInterval"][::core::mem::align_of::<AnalogSignalInterval>() - 2usize];
    ["Offset of field: AnalogSignalInterval::asi_Start"]
        [::core::mem::offset_of!(AnalogSignalInterval, asi_Start) - 0usize];
    ["Offset of field: AnalogSignalInterval::asi_Stop"]
        [::core::mem::offset_of!(AnalogSignalInterval, asi_Stop) - 2usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct SpecialMonitor {
    pub spm_Node: ExtendedNode,
    pub spm_Flags: UWORD,
    pub do_monitor: FPTR,
    pub reserved1: FPTR,
    pub reserved2: FPTR,
    pub reserved3: FPTR,
    pub hblank: AnalogSignalInterval,
    pub vblank: AnalogSignalInterval,
    pub hsync: AnalogSignalInterval,
    pub vsync: AnalogSignalInterval,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SpecialMonitor"][::core::mem::size_of::<SpecialMonitor>() - 58usize];
    ["Alignment of SpecialMonitor"][::core::mem::align_of::<SpecialMonitor>() - 2usize];
    ["Offset of field: SpecialMonitor::spm_Node"]
        [::core::mem::offset_of!(SpecialMonitor, spm_Node) - 0usize];
    ["Offset of field: SpecialMonitor::spm_Flags"]
        [::core::mem::offset_of!(SpecialMonitor, spm_Flags) - 24usize];
    ["Offset of field: SpecialMonitor::do_monitor"]
        [::core::mem::offset_of!(SpecialMonitor, do_monitor) - 26usize];
    ["Offset of field: SpecialMonitor::reserved1"]
        [::core::mem::offset_of!(SpecialMonitor, reserved1) - 30usize];
    ["Offset of field: SpecialMonitor::reserved2"]
        [::core::mem::offset_of!(SpecialMonitor, reserved2) - 34usize];
    ["Offset of field: SpecialMonitor::reserved3"]
        [::core::mem::offset_of!(SpecialMonitor, reserved3) - 38usize];
    ["Offset of field: SpecialMonitor::hblank"]
        [::core::mem::offset_of!(SpecialMonitor, hblank) - 42usize];
    ["Offset of field: SpecialMonitor::vblank"]
        [::core::mem::offset_of!(SpecialMonitor, vblank) - 46usize];
    ["Offset of field: SpecialMonitor::hsync"]
        [::core::mem::offset_of!(SpecialMonitor, hsync) - 50usize];
    ["Offset of field: SpecialMonitor::vsync"]
        [::core::mem::offset_of!(SpecialMonitor, vsync) - 54usize];
};
pub type DisplayInfoHandle = APTR;
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct QueryHeader {
    pub StructID: ULONG,
    pub DisplayID: ULONG,
    pub SkipID: ULONG,
    pub Length: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of QueryHeader"][::core::mem::size_of::<QueryHeader>() - 16usize];
    ["Alignment of QueryHeader"][::core::mem::align_of::<QueryHeader>() - 2usize];
    ["Offset of field: QueryHeader::StructID"]
        [::core::mem::offset_of!(QueryHeader, StructID) - 0usize];
    ["Offset of field: QueryHeader::DisplayID"]
        [::core::mem::offset_of!(QueryHeader, DisplayID) - 4usize];
    ["Offset of field: QueryHeader::SkipID"][::core::mem::offset_of!(QueryHeader, SkipID) - 8usize];
    ["Offset of field: QueryHeader::Length"]
        [::core::mem::offset_of!(QueryHeader, Length) - 12usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct DisplayInfo {
    pub Header: QueryHeader,
    pub NotAvailable: UWORD,
    pub PropertyFlags: ULONG,
    pub Resolution: Point,
    pub PixelSpeed: UWORD,
    pub NumStdSprites: UWORD,
    pub PaletteRange: UWORD,
    pub SpriteResolution: Point,
    pub pad: [UBYTE; 4usize],
    pub RedBits: UBYTE,
    pub GreenBits: UBYTE,
    pub BlueBits: UBYTE,
    pub pad2: [UBYTE; 5usize],
    pub reserved: [ULONG; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DisplayInfo"][::core::mem::size_of::<DisplayInfo>() - 56usize];
    ["Alignment of DisplayInfo"][::core::mem::align_of::<DisplayInfo>() - 2usize];
    ["Offset of field: DisplayInfo::Header"][::core::mem::offset_of!(DisplayInfo, Header) - 0usize];
    ["Offset of field: DisplayInfo::NotAvailable"]
        [::core::mem::offset_of!(DisplayInfo, NotAvailable) - 16usize];
    ["Offset of field: DisplayInfo::PropertyFlags"]
        [::core::mem::offset_of!(DisplayInfo, PropertyFlags) - 18usize];
    ["Offset of field: DisplayInfo::Resolution"]
        [::core::mem::offset_of!(DisplayInfo, Resolution) - 22usize];
    ["Offset of field: DisplayInfo::PixelSpeed"]
        [::core::mem::offset_of!(DisplayInfo, PixelSpeed) - 26usize];
    ["Offset of field: DisplayInfo::NumStdSprites"]
        [::core::mem::offset_of!(DisplayInfo, NumStdSprites) - 28usize];
    ["Offset of field: DisplayInfo::PaletteRange"]
        [::core::mem::offset_of!(DisplayInfo, PaletteRange) - 30usize];
    ["Offset of field: DisplayInfo::SpriteResolution"]
        [::core::mem::offset_of!(DisplayInfo, SpriteResolution) - 32usize];
    ["Offset of field: DisplayInfo::pad"][::core::mem::offset_of!(DisplayInfo, pad) - 36usize];
    ["Offset of field: DisplayInfo::RedBits"]
        [::core::mem::offset_of!(DisplayInfo, RedBits) - 40usize];
    ["Offset of field: DisplayInfo::GreenBits"]
        [::core::mem::offset_of!(DisplayInfo, GreenBits) - 41usize];
    ["Offset of field: DisplayInfo::BlueBits"]
        [::core::mem::offset_of!(DisplayInfo, BlueBits) - 42usize];
    ["Offset of field: DisplayInfo::pad2"][::core::mem::offset_of!(DisplayInfo, pad2) - 43usize];
    ["Offset of field: DisplayInfo::reserved"]
        [::core::mem::offset_of!(DisplayInfo, reserved) - 48usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct DimensionInfo {
    pub Header: QueryHeader,
    pub MaxDepth: UWORD,
    pub MinRasterWidth: UWORD,
    pub MinRasterHeight: UWORD,
    pub MaxRasterWidth: UWORD,
    pub MaxRasterHeight: UWORD,
    pub Nominal: Rectangle,
    pub MaxOScan: Rectangle,
    pub VideoOScan: Rectangle,
    pub TxtOScan: Rectangle,
    pub StdOScan: Rectangle,
    pub pad: [UBYTE; 14usize],
    pub reserved: [ULONG; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DimensionInfo"][::core::mem::size_of::<DimensionInfo>() - 88usize];
    ["Alignment of DimensionInfo"][::core::mem::align_of::<DimensionInfo>() - 2usize];
    ["Offset of field: DimensionInfo::Header"]
        [::core::mem::offset_of!(DimensionInfo, Header) - 0usize];
    ["Offset of field: DimensionInfo::MaxDepth"]
        [::core::mem::offset_of!(DimensionInfo, MaxDepth) - 16usize];
    ["Offset of field: DimensionInfo::MinRasterWidth"]
        [::core::mem::offset_of!(DimensionInfo, MinRasterWidth) - 18usize];
    ["Offset of field: DimensionInfo::MinRasterHeight"]
        [::core::mem::offset_of!(DimensionInfo, MinRasterHeight) - 20usize];
    ["Offset of field: DimensionInfo::MaxRasterWidth"]
        [::core::mem::offset_of!(DimensionInfo, MaxRasterWidth) - 22usize];
    ["Offset of field: DimensionInfo::MaxRasterHeight"]
        [::core::mem::offset_of!(DimensionInfo, MaxRasterHeight) - 24usize];
    ["Offset of field: DimensionInfo::Nominal"]
        [::core::mem::offset_of!(DimensionInfo, Nominal) - 26usize];
    ["Offset of field: DimensionInfo::MaxOScan"]
        [::core::mem::offset_of!(DimensionInfo, MaxOScan) - 34usize];
    ["Offset of field: DimensionInfo::VideoOScan"]
        [::core::mem::offset_of!(DimensionInfo, VideoOScan) - 42usize];
    ["Offset of field: DimensionInfo::TxtOScan"]
        [::core::mem::offset_of!(DimensionInfo, TxtOScan) - 50usize];
    ["Offset of field: DimensionInfo::StdOScan"]
        [::core::mem::offset_of!(DimensionInfo, StdOScan) - 58usize];
    ["Offset of field: DimensionInfo::pad"][::core::mem::offset_of!(DimensionInfo, pad) - 66usize];
    ["Offset of field: DimensionInfo::reserved"]
        [::core::mem::offset_of!(DimensionInfo, reserved) - 80usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct MonitorInfo {
    pub Header: QueryHeader,
    pub Mspc: *mut MonitorSpec,
    pub ViewPosition: Point,
    pub ViewResolution: Point,
    pub ViewPositionRange: Rectangle,
    pub TotalRows: UWORD,
    pub TotalColorClocks: UWORD,
    pub MinRow: UWORD,
    pub Compatibility: WORD,
    pub pad: [UBYTE; 32usize],
    pub MouseTicks: Point,
    pub DefaultViewPosition: Point,
    pub PreferredModeID: ULONG,
    pub reserved: [ULONG; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MonitorInfo"][::core::mem::size_of::<MonitorInfo>() - 96usize];
    ["Alignment of MonitorInfo"][::core::mem::align_of::<MonitorInfo>() - 2usize];
    ["Offset of field: MonitorInfo::Header"][::core::mem::offset_of!(MonitorInfo, Header) - 0usize];
    ["Offset of field: MonitorInfo::Mspc"][::core::mem::offset_of!(MonitorInfo, Mspc) - 16usize];
    ["Offset of field: MonitorInfo::ViewPosition"]
        [::core::mem::offset_of!(MonitorInfo, ViewPosition) - 20usize];
    ["Offset of field: MonitorInfo::ViewResolution"]
        [::core::mem::offset_of!(MonitorInfo, ViewResolution) - 24usize];
    ["Offset of field: MonitorInfo::ViewPositionRange"]
        [::core::mem::offset_of!(MonitorInfo, ViewPositionRange) - 28usize];
    ["Offset of field: MonitorInfo::TotalRows"]
        [::core::mem::offset_of!(MonitorInfo, TotalRows) - 36usize];
    ["Offset of field: MonitorInfo::TotalColorClocks"]
        [::core::mem::offset_of!(MonitorInfo, TotalColorClocks) - 38usize];
    ["Offset of field: MonitorInfo::MinRow"]
        [::core::mem::offset_of!(MonitorInfo, MinRow) - 40usize];
    ["Offset of field: MonitorInfo::Compatibility"]
        [::core::mem::offset_of!(MonitorInfo, Compatibility) - 42usize];
    ["Offset of field: MonitorInfo::pad"][::core::mem::offset_of!(MonitorInfo, pad) - 44usize];
    ["Offset of field: MonitorInfo::MouseTicks"]
        [::core::mem::offset_of!(MonitorInfo, MouseTicks) - 76usize];
    ["Offset of field: MonitorInfo::DefaultViewPosition"]
        [::core::mem::offset_of!(MonitorInfo, DefaultViewPosition) - 80usize];
    ["Offset of field: MonitorInfo::PreferredModeID"]
        [::core::mem::offset_of!(MonitorInfo, PreferredModeID) - 84usize];
    ["Offset of field: MonitorInfo::reserved"]
        [::core::mem::offset_of!(MonitorInfo, reserved) - 88usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct NameInfo {
    pub Header: QueryHeader,
    pub Name: [UBYTE; 32usize],
    pub reserved: [ULONG; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NameInfo"][::core::mem::size_of::<NameInfo>() - 56usize];
    ["Alignment of NameInfo"][::core::mem::align_of::<NameInfo>() - 2usize];
    ["Offset of field: NameInfo::Header"][::core::mem::offset_of!(NameInfo, Header) - 0usize];
    ["Offset of field: NameInfo::Name"][::core::mem::offset_of!(NameInfo, Name) - 16usize];
    ["Offset of field: NameInfo::reserved"][::core::mem::offset_of!(NameInfo, reserved) - 48usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct VecInfo {
    pub Header: QueryHeader,
    pub Vec: APTR,
    pub Data: APTR,
    pub Type: UWORD,
    pub pad: [UWORD; 3usize],
    pub reserved: [ULONG; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of VecInfo"][::core::mem::size_of::<VecInfo>() - 40usize];
    ["Alignment of VecInfo"][::core::mem::align_of::<VecInfo>() - 2usize];
    ["Offset of field: VecInfo::Header"][::core::mem::offset_of!(VecInfo, Header) - 0usize];
    ["Offset of field: VecInfo::Vec"][::core::mem::offset_of!(VecInfo, Vec) - 16usize];
    ["Offset of field: VecInfo::Data"][::core::mem::offset_of!(VecInfo, Data) - 20usize];
    ["Offset of field: VecInfo::Type"][::core::mem::offset_of!(VecInfo, Type) - 24usize];
    ["Offset of field: VecInfo::pad"][::core::mem::offset_of!(VecInfo, pad) - 26usize];
    ["Offset of field: VecInfo::reserved"][::core::mem::offset_of!(VecInfo, reserved) - 32usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct Custom {
    pub bltddat: UWORD,
    pub dmaconr: UWORD,
    pub vposr: UWORD,
    pub vhposr: UWORD,
    pub dskdatr: UWORD,
    pub joy0dat: UWORD,
    pub joy1dat: UWORD,
    pub clxdat: UWORD,
    pub adkconr: UWORD,
    pub pot0dat: UWORD,
    pub pot1dat: UWORD,
    pub potinp: UWORD,
    pub serdatr: UWORD,
    pub dskbytr: UWORD,
    pub intenar: UWORD,
    pub intreqr: UWORD,
    pub dskpt: APTR,
    pub dsklen: UWORD,
    pub dskdat: UWORD,
    pub refptr: UWORD,
    pub vposw: UWORD,
    pub vhposw: UWORD,
    pub copcon: UWORD,
    pub serdat: UWORD,
    pub serper: UWORD,
    pub potgo: UWORD,
    pub joytest: UWORD,
    pub strequ: UWORD,
    pub strvbl: UWORD,
    pub strhor: UWORD,
    pub strlong: UWORD,
    pub bltcon0: UWORD,
    pub bltcon1: UWORD,
    pub bltafwm: UWORD,
    pub bltalwm: UWORD,
    pub bltcpt: APTR,
    pub bltbpt: APTR,
    pub bltapt: APTR,
    pub bltdpt: APTR,
    pub bltsize: UWORD,
    pub pad2d: UBYTE,
    pub bltcon0l: UBYTE,
    pub bltsizv: UWORD,
    pub bltsizh: UWORD,
    pub bltcmod: UWORD,
    pub bltbmod: UWORD,
    pub bltamod: UWORD,
    pub bltdmod: UWORD,
    pub pad34: [UWORD; 4usize],
    pub bltcdat: UWORD,
    pub bltbdat: UWORD,
    pub bltadat: UWORD,
    pub pad3b: [UWORD; 3usize],
    pub deniseid: UWORD,
    pub dsksync: UWORD,
    pub cop1lc: ULONG,
    pub cop2lc: ULONG,
    pub copjmp1: UWORD,
    pub copjmp2: UWORD,
    pub copins: UWORD,
    pub diwstrt: UWORD,
    pub diwstop: UWORD,
    pub ddfstrt: UWORD,
    pub ddfstop: UWORD,
    pub dmacon: UWORD,
    pub clxcon: UWORD,
    pub intena: UWORD,
    pub intreq: UWORD,
    pub adkcon: UWORD,
    pub aud: [Custom_AudChannel; 4usize],
    pub bplpt: [APTR; 8usize],
    pub bplcon0: UWORD,
    pub bplcon1: UWORD,
    pub bplcon2: UWORD,
    pub bplcon3: UWORD,
    pub bpl1mod: UWORD,
    pub bpl2mod: UWORD,
    pub bplcon4: UWORD,
    pub clxcon2: UWORD,
    pub bpldat: [UWORD; 8usize],
    pub sprpt: [APTR; 8usize],
    pub spr: [Custom_SpriteDef; 8usize],
    pub color: [UWORD; 32usize],
    pub htotal: UWORD,
    pub hsstop: UWORD,
    pub hbstrt: UWORD,
    pub hbstop: UWORD,
    pub vtotal: UWORD,
    pub vsstop: UWORD,
    pub vbstrt: UWORD,
    pub vbstop: UWORD,
    pub sprhstrt: UWORD,
    pub sprhstop: UWORD,
    pub bplhstrt: UWORD,
    pub bplhstop: UWORD,
    pub hhposw: UWORD,
    pub hhposr: UWORD,
    pub beamcon0: UWORD,
    pub hsstrt: UWORD,
    pub vsstrt: UWORD,
    pub hcenter: UWORD,
    pub diwhigh: UWORD,
    pub padf3: [UWORD; 11usize],
    pub fmode: UWORD,
}
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct Custom_AudChannel {
    pub ac_ptr: *mut UWORD,
    pub ac_len: UWORD,
    pub ac_per: UWORD,
    pub ac_vol: UWORD,
    pub ac_dat: UWORD,
    pub ac_pad: [UWORD; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Custom_AudChannel"][::core::mem::size_of::<Custom_AudChannel>() - 16usize];
    ["Alignment of Custom_AudChannel"][::core::mem::align_of::<Custom_AudChannel>() - 2usize];
    ["Offset of field: Custom_AudChannel::ac_ptr"]
        [::core::mem::offset_of!(Custom_AudChannel, ac_ptr) - 0usize];
    ["Offset of field: Custom_AudChannel::ac_len"]
        [::core::mem::offset_of!(Custom_AudChannel, ac_len) - 4usize];
    ["Offset of field: Custom_AudChannel::ac_per"]
        [::core::mem::offset_of!(Custom_AudChannel, ac_per) - 6usize];
    ["Offset of field: Custom_AudChannel::ac_vol"]
        [::core::mem::offset_of!(Custom_AudChannel, ac_vol) - 8usize];
    ["Offset of field: Custom_AudChannel::ac_dat"]
        [::core::mem::offset_of!(Custom_AudChannel, ac_dat) - 10usize];
    ["Offset of field: Custom_AudChannel::ac_pad"]
        [::core::mem::offset_of!(Custom_AudChannel, ac_pad) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Custom_SpriteDef {
    pub pos: UWORD,
    pub ctl: UWORD,
    pub dataa: UWORD,
    pub datab: UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Custom_SpriteDef"][::core::mem::size_of::<Custom_SpriteDef>() - 8usize];
    ["Alignment of Custom_SpriteDef"][::core::mem::align_of::<Custom_SpriteDef>() - 2usize];
    ["Offset of field: Custom_SpriteDef::pos"]
        [::core::mem::offset_of!(Custom_SpriteDef, pos) - 0usize];
    ["Offset of field: Custom_SpriteDef::ctl"]
        [::core::mem::offset_of!(Custom_SpriteDef, ctl) - 2usize];
    ["Offset of field: Custom_SpriteDef::dataa"]
        [::core::mem::offset_of!(Custom_SpriteDef, dataa) - 4usize];
    ["Offset of field: Custom_SpriteDef::datab"]
        [::core::mem::offset_of!(Custom_SpriteDef, datab) - 6usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Custom"][::core::mem::size_of::<Custom>() - 510usize];
    ["Alignment of Custom"][::core::mem::align_of::<Custom>() - 2usize];
    ["Offset of field: Custom::bltddat"][::core::mem::offset_of!(Custom, bltddat) - 0usize];
    ["Offset of field: Custom::dmaconr"][::core::mem::offset_of!(Custom, dmaconr) - 2usize];
    ["Offset of field: Custom::vposr"][::core::mem::offset_of!(Custom, vposr) - 4usize];
    ["Offset of field: Custom::vhposr"][::core::mem::offset_of!(Custom, vhposr) - 6usize];
    ["Offset of field: Custom::dskdatr"][::core::mem::offset_of!(Custom, dskdatr) - 8usize];
    ["Offset of field: Custom::joy0dat"][::core::mem::offset_of!(Custom, joy0dat) - 10usize];
    ["Offset of field: Custom::joy1dat"][::core::mem::offset_of!(Custom, joy1dat) - 12usize];
    ["Offset of field: Custom::clxdat"][::core::mem::offset_of!(Custom, clxdat) - 14usize];
    ["Offset of field: Custom::adkconr"][::core::mem::offset_of!(Custom, adkconr) - 16usize];
    ["Offset of field: Custom::pot0dat"][::core::mem::offset_of!(Custom, pot0dat) - 18usize];
    ["Offset of field: Custom::pot1dat"][::core::mem::offset_of!(Custom, pot1dat) - 20usize];
    ["Offset of field: Custom::potinp"][::core::mem::offset_of!(Custom, potinp) - 22usize];
    ["Offset of field: Custom::serdatr"][::core::mem::offset_of!(Custom, serdatr) - 24usize];
    ["Offset of field: Custom::dskbytr"][::core::mem::offset_of!(Custom, dskbytr) - 26usize];
    ["Offset of field: Custom::intenar"][::core::mem::offset_of!(Custom, intenar) - 28usize];
    ["Offset of field: Custom::intreqr"][::core::mem::offset_of!(Custom, intreqr) - 30usize];
    ["Offset of field: Custom::dskpt"][::core::mem::offset_of!(Custom, dskpt) - 32usize];
    ["Offset of field: Custom::dsklen"][::core::mem::offset_of!(Custom, dsklen) - 36usize];
    ["Offset of field: Custom::dskdat"][::core::mem::offset_of!(Custom, dskdat) - 38usize];
    ["Offset of field: Custom::refptr"][::core::mem::offset_of!(Custom, refptr) - 40usize];
    ["Offset of field: Custom::vposw"][::core::mem::offset_of!(Custom, vposw) - 42usize];
    ["Offset of field: Custom::vhposw"][::core::mem::offset_of!(Custom, vhposw) - 44usize];
    ["Offset of field: Custom::copcon"][::core::mem::offset_of!(Custom, copcon) - 46usize];
    ["Offset of field: Custom::serdat"][::core::mem::offset_of!(Custom, serdat) - 48usize];
    ["Offset of field: Custom::serper"][::core::mem::offset_of!(Custom, serper) - 50usize];
    ["Offset of field: Custom::potgo"][::core::mem::offset_of!(Custom, potgo) - 52usize];
    ["Offset of field: Custom::joytest"][::core::mem::offset_of!(Custom, joytest) - 54usize];
    ["Offset of field: Custom::strequ"][::core::mem::offset_of!(Custom, strequ) - 56usize];
    ["Offset of field: Custom::strvbl"][::core::mem::offset_of!(Custom, strvbl) - 58usize];
    ["Offset of field: Custom::strhor"][::core::mem::offset_of!(Custom, strhor) - 60usize];
    ["Offset of field: Custom::strlong"][::core::mem::offset_of!(Custom, strlong) - 62usize];
    ["Offset of field: Custom::bltcon0"][::core::mem::offset_of!(Custom, bltcon0) - 64usize];
    ["Offset of field: Custom::bltcon1"][::core::mem::offset_of!(Custom, bltcon1) - 66usize];
    ["Offset of field: Custom::bltafwm"][::core::mem::offset_of!(Custom, bltafwm) - 68usize];
    ["Offset of field: Custom::bltalwm"][::core::mem::offset_of!(Custom, bltalwm) - 70usize];
    ["Offset of field: Custom::bltcpt"][::core::mem::offset_of!(Custom, bltcpt) - 72usize];
    ["Offset of field: Custom::bltbpt"][::core::mem::offset_of!(Custom, bltbpt) - 76usize];
    ["Offset of field: Custom::bltapt"][::core::mem::offset_of!(Custom, bltapt) - 80usize];
    ["Offset of field: Custom::bltdpt"][::core::mem::offset_of!(Custom, bltdpt) - 84usize];
    ["Offset of field: Custom::bltsize"][::core::mem::offset_of!(Custom, bltsize) - 88usize];
    ["Offset of field: Custom::pad2d"][::core::mem::offset_of!(Custom, pad2d) - 90usize];
    ["Offset of field: Custom::bltcon0l"][::core::mem::offset_of!(Custom, bltcon0l) - 91usize];
    ["Offset of field: Custom::bltsizv"][::core::mem::offset_of!(Custom, bltsizv) - 92usize];
    ["Offset of field: Custom::bltsizh"][::core::mem::offset_of!(Custom, bltsizh) - 94usize];
    ["Offset of field: Custom::bltcmod"][::core::mem::offset_of!(Custom, bltcmod) - 96usize];
    ["Offset of field: Custom::bltbmod"][::core::mem::offset_of!(Custom, bltbmod) - 98usize];
    ["Offset of field: Custom::bltamod"][::core::mem::offset_of!(Custom, bltamod) - 100usize];
    ["Offset of field: Custom::bltdmod"][::core::mem::offset_of!(Custom, bltdmod) - 102usize];
    ["Offset of field: Custom::pad34"][::core::mem::offset_of!(Custom, pad34) - 104usize];
    ["Offset of field: Custom::bltcdat"][::core::mem::offset_of!(Custom, bltcdat) - 112usize];
    ["Offset of field: Custom::bltbdat"][::core::mem::offset_of!(Custom, bltbdat) - 114usize];
    ["Offset of field: Custom::bltadat"][::core::mem::offset_of!(Custom, bltadat) - 116usize];
    ["Offset of field: Custom::pad3b"][::core::mem::offset_of!(Custom, pad3b) - 118usize];
    ["Offset of field: Custom::deniseid"][::core::mem::offset_of!(Custom, deniseid) - 124usize];
    ["Offset of field: Custom::dsksync"][::core::mem::offset_of!(Custom, dsksync) - 126usize];
    ["Offset of field: Custom::cop1lc"][::core::mem::offset_of!(Custom, cop1lc) - 128usize];
    ["Offset of field: Custom::cop2lc"][::core::mem::offset_of!(Custom, cop2lc) - 132usize];
    ["Offset of field: Custom::copjmp1"][::core::mem::offset_of!(Custom, copjmp1) - 136usize];
    ["Offset of field: Custom::copjmp2"][::core::mem::offset_of!(Custom, copjmp2) - 138usize];
    ["Offset of field: Custom::copins"][::core::mem::offset_of!(Custom, copins) - 140usize];
    ["Offset of field: Custom::diwstrt"][::core::mem::offset_of!(Custom, diwstrt) - 142usize];
    ["Offset of field: Custom::diwstop"][::core::mem::offset_of!(Custom, diwstop) - 144usize];
    ["Offset of field: Custom::ddfstrt"][::core::mem::offset_of!(Custom, ddfstrt) - 146usize];
    ["Offset of field: Custom::ddfstop"][::core::mem::offset_of!(Custom, ddfstop) - 148usize];
    ["Offset of field: Custom::dmacon"][::core::mem::offset_of!(Custom, dmacon) - 150usize];
    ["Offset of field: Custom::clxcon"][::core::mem::offset_of!(Custom, clxcon) - 152usize];
    ["Offset of field: Custom::intena"][::core::mem::offset_of!(Custom, intena) - 154usize];
    ["Offset of field: Custom::intreq"][::core::mem::offset_of!(Custom, intreq) - 156usize];
    ["Offset of field: Custom::adkcon"][::core::mem::offset_of!(Custom, adkcon) - 158usize];
    ["Offset of field: Custom::aud"][::core::mem::offset_of!(Custom, aud) - 160usize];
    ["Offset of field: Custom::bplpt"][::core::mem::offset_of!(Custom, bplpt) - 224usize];
    ["Offset of field: Custom::bplcon0"][::core::mem::offset_of!(Custom, bplcon0) - 256usize];
    ["Offset of field: Custom::bplcon1"][::core::mem::offset_of!(Custom, bplcon1) - 258usize];
    ["Offset of field: Custom::bplcon2"][::core::mem::offset_of!(Custom, bplcon2) - 260usize];
    ["Offset of field: Custom::bplcon3"][::core::mem::offset_of!(Custom, bplcon3) - 262usize];
    ["Offset of field: Custom::bpl1mod"][::core::mem::offset_of!(Custom, bpl1mod) - 264usize];
    ["Offset of field: Custom::bpl2mod"][::core::mem::offset_of!(Custom, bpl2mod) - 266usize];
    ["Offset of field: Custom::bplcon4"][::core::mem::offset_of!(Custom, bplcon4) - 268usize];
    ["Offset of field: Custom::clxcon2"][::core::mem::offset_of!(Custom, clxcon2) - 270usize];
    ["Offset of field: Custom::bpldat"][::core::mem::offset_of!(Custom, bpldat) - 272usize];
    ["Offset of field: Custom::sprpt"][::core::mem::offset_of!(Custom, sprpt) - 288usize];
    ["Offset of field: Custom::spr"][::core::mem::offset_of!(Custom, spr) - 320usize];
    ["Offset of field: Custom::color"][::core::mem::offset_of!(Custom, color) - 384usize];
    ["Offset of field: Custom::htotal"][::core::mem::offset_of!(Custom, htotal) - 448usize];
    ["Offset of field: Custom::hsstop"][::core::mem::offset_of!(Custom, hsstop) - 450usize];
    ["Offset of field: Custom::hbstrt"][::core::mem::offset_of!(Custom, hbstrt) - 452usize];
    ["Offset of field: Custom::hbstop"][::core::mem::offset_of!(Custom, hbstop) - 454usize];
    ["Offset of field: Custom::vtotal"][::core::mem::offset_of!(Custom, vtotal) - 456usize];
    ["Offset of field: Custom::vsstop"][::core::mem::offset_of!(Custom, vsstop) - 458usize];
    ["Offset of field: Custom::vbstrt"][::core::mem::offset_of!(Custom, vbstrt) - 460usize];
    ["Offset of field: Custom::vbstop"][::core::mem::offset_of!(Custom, vbstop) - 462usize];
    ["Offset of field: Custom::sprhstrt"][::core::mem::offset_of!(Custom, sprhstrt) - 464usize];
    ["Offset of field: Custom::sprhstop"][::core::mem::offset_of!(Custom, sprhstop) - 466usize];
    ["Offset of field: Custom::bplhstrt"][::core::mem::offset_of!(Custom, bplhstrt) - 468usize];
    ["Offset of field: Custom::bplhstop"][::core::mem::offset_of!(Custom, bplhstop) - 470usize];
    ["Offset of field: Custom::hhposw"][::core::mem::offset_of!(Custom, hhposw) - 472usize];
    ["Offset of field: Custom::hhposr"][::core::mem::offset_of!(Custom, hhposr) - 474usize];
    ["Offset of field: Custom::beamcon0"][::core::mem::offset_of!(Custom, beamcon0) - 476usize];
    ["Offset of field: Custom::hsstrt"][::core::mem::offset_of!(Custom, hsstrt) - 478usize];
    ["Offset of field: Custom::vsstrt"][::core::mem::offset_of!(Custom, vsstrt) - 480usize];
    ["Offset of field: Custom::hcenter"][::core::mem::offset_of!(Custom, hcenter) - 482usize];
    ["Offset of field: Custom::diwhigh"][::core::mem::offset_of!(Custom, diwhigh) - 484usize];
    ["Offset of field: Custom::padf3"][::core::mem::offset_of!(Custom, padf3) - 486usize];
    ["Offset of field: Custom::fmode"][::core::mem::offset_of!(Custom, fmode) - 508usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct ViewPort {
    pub Next: *mut ViewPort,
    pub ColorMap: *mut ColorMap,
    pub DspIns: *mut CopList,
    pub SprIns: *mut CopList,
    pub ClrIns: *mut CopList,
    pub UCopIns: *mut UCopList,
    pub DWidth: WORD,
    pub DHeight: WORD,
    pub DxOffset: WORD,
    pub DyOffset: WORD,
    pub Modes: UWORD,
    pub SpritePriorities: UBYTE,
    pub ExtendedModes: UBYTE,
    pub RasInfo: *mut RasInfo,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ViewPort"][::core::mem::size_of::<ViewPort>() - 40usize];
    ["Alignment of ViewPort"][::core::mem::align_of::<ViewPort>() - 2usize];
    ["Offset of field: ViewPort::Next"][::core::mem::offset_of!(ViewPort, Next) - 0usize];
    ["Offset of field: ViewPort::ColorMap"][::core::mem::offset_of!(ViewPort, ColorMap) - 4usize];
    ["Offset of field: ViewPort::DspIns"][::core::mem::offset_of!(ViewPort, DspIns) - 8usize];
    ["Offset of field: ViewPort::SprIns"][::core::mem::offset_of!(ViewPort, SprIns) - 12usize];
    ["Offset of field: ViewPort::ClrIns"][::core::mem::offset_of!(ViewPort, ClrIns) - 16usize];
    ["Offset of field: ViewPort::UCopIns"][::core::mem::offset_of!(ViewPort, UCopIns) - 20usize];
    ["Offset of field: ViewPort::DWidth"][::core::mem::offset_of!(ViewPort, DWidth) - 24usize];
    ["Offset of field: ViewPort::DHeight"][::core::mem::offset_of!(ViewPort, DHeight) - 26usize];
    ["Offset of field: ViewPort::DxOffset"][::core::mem::offset_of!(ViewPort, DxOffset) - 28usize];
    ["Offset of field: ViewPort::DyOffset"][::core::mem::offset_of!(ViewPort, DyOffset) - 30usize];
    ["Offset of field: ViewPort::Modes"][::core::mem::offset_of!(ViewPort, Modes) - 32usize];
    ["Offset of field: ViewPort::SpritePriorities"]
        [::core::mem::offset_of!(ViewPort, SpritePriorities) - 34usize];
    ["Offset of field: ViewPort::ExtendedModes"]
        [::core::mem::offset_of!(ViewPort, ExtendedModes) - 35usize];
    ["Offset of field: ViewPort::RasInfo"][::core::mem::offset_of!(ViewPort, RasInfo) - 36usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct View {
    pub ViewPort: *mut ViewPort,
    pub LOFCprList: *mut cprlist,
    pub SHFCprList: *mut cprlist,
    pub DyOffset: WORD,
    pub DxOffset: WORD,
    pub Modes: UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of View"][::core::mem::size_of::<View>() - 18usize];
    ["Alignment of View"][::core::mem::align_of::<View>() - 2usize];
    ["Offset of field: View::ViewPort"][::core::mem::offset_of!(View, ViewPort) - 0usize];
    ["Offset of field: View::LOFCprList"][::core::mem::offset_of!(View, LOFCprList) - 4usize];
    ["Offset of field: View::SHFCprList"][::core::mem::offset_of!(View, SHFCprList) - 8usize];
    ["Offset of field: View::DyOffset"][::core::mem::offset_of!(View, DyOffset) - 12usize];
    ["Offset of field: View::DxOffset"][::core::mem::offset_of!(View, DxOffset) - 14usize];
    ["Offset of field: View::Modes"][::core::mem::offset_of!(View, Modes) - 16usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct ViewExtra {
    pub n: ExtendedNode,
    pub View: *mut View,
    pub Monitor: *mut MonitorSpec,
    pub TopLine: UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ViewExtra"][::core::mem::size_of::<ViewExtra>() - 34usize];
    ["Alignment of ViewExtra"][::core::mem::align_of::<ViewExtra>() - 2usize];
    ["Offset of field: ViewExtra::n"][::core::mem::offset_of!(ViewExtra, n) - 0usize];
    ["Offset of field: ViewExtra::View"][::core::mem::offset_of!(ViewExtra, View) - 24usize];
    ["Offset of field: ViewExtra::Monitor"][::core::mem::offset_of!(ViewExtra, Monitor) - 28usize];
    ["Offset of field: ViewExtra::TopLine"][::core::mem::offset_of!(ViewExtra, TopLine) - 32usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct ViewPortExtra {
    pub n: ExtendedNode,
    pub ViewPort: *mut ViewPort,
    pub DisplayClip: Rectangle,
    pub VecTable: APTR,
    pub DriverData: [APTR; 2usize],
    pub Flags: UWORD,
    pub Origin: [Point; 2usize],
    pub cop1ptr: ULONG,
    pub cop2ptr: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ViewPortExtra"][::core::mem::size_of::<ViewPortExtra>() - 66usize];
    ["Alignment of ViewPortExtra"][::core::mem::align_of::<ViewPortExtra>() - 2usize];
    ["Offset of field: ViewPortExtra::n"][::core::mem::offset_of!(ViewPortExtra, n) - 0usize];
    ["Offset of field: ViewPortExtra::ViewPort"]
        [::core::mem::offset_of!(ViewPortExtra, ViewPort) - 24usize];
    ["Offset of field: ViewPortExtra::DisplayClip"]
        [::core::mem::offset_of!(ViewPortExtra, DisplayClip) - 28usize];
    ["Offset of field: ViewPortExtra::VecTable"]
        [::core::mem::offset_of!(ViewPortExtra, VecTable) - 36usize];
    ["Offset of field: ViewPortExtra::DriverData"]
        [::core::mem::offset_of!(ViewPortExtra, DriverData) - 40usize];
    ["Offset of field: ViewPortExtra::Flags"]
        [::core::mem::offset_of!(ViewPortExtra, Flags) - 48usize];
    ["Offset of field: ViewPortExtra::Origin"]
        [::core::mem::offset_of!(ViewPortExtra, Origin) - 50usize];
    ["Offset of field: ViewPortExtra::cop1ptr"]
        [::core::mem::offset_of!(ViewPortExtra, cop1ptr) - 58usize];
    ["Offset of field: ViewPortExtra::cop2ptr"]
        [::core::mem::offset_of!(ViewPortExtra, cop2ptr) - 62usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct RasInfo {
    pub Next: *mut RasInfo,
    pub BitMap: *mut BitMap,
    pub RxOffset: WORD,
    pub RyOffset: WORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RasInfo"][::core::mem::size_of::<RasInfo>() - 12usize];
    ["Alignment of RasInfo"][::core::mem::align_of::<RasInfo>() - 2usize];
    ["Offset of field: RasInfo::Next"][::core::mem::offset_of!(RasInfo, Next) - 0usize];
    ["Offset of field: RasInfo::BitMap"][::core::mem::offset_of!(RasInfo, BitMap) - 4usize];
    ["Offset of field: RasInfo::RxOffset"][::core::mem::offset_of!(RasInfo, RxOffset) - 8usize];
    ["Offset of field: RasInfo::RyOffset"][::core::mem::offset_of!(RasInfo, RyOffset) - 10usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct ColorMap {
    pub Flags: UBYTE,
    pub Type: UBYTE,
    pub Count: UWORD,
    pub ColorTable: APTR,
    pub cm_vpe: *mut ViewPortExtra,
    pub LowColorBits: APTR,
    pub TransparencyPlane: UBYTE,
    pub SpriteResolution: UBYTE,
    pub SpriteResDefault: UBYTE,
    pub AuxFlags: UBYTE,
    pub cm_vp: *mut ViewPort,
    pub NormalDisplayInfo: APTR,
    pub CoerceDisplayInfo: APTR,
    pub cm_batch_items: *mut TagItem,
    pub VPModeID: ULONG,
    pub PalExtra: *mut PaletteExtra,
    pub SpriteBase_Even: UWORD,
    pub SpriteBase_Odd: UWORD,
    pub Bp_0_base: UWORD,
    pub Bp_1_base: UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ColorMap"][::core::mem::size_of::<ColorMap>() - 52usize];
    ["Alignment of ColorMap"][::core::mem::align_of::<ColorMap>() - 2usize];
    ["Offset of field: ColorMap::Flags"][::core::mem::offset_of!(ColorMap, Flags) - 0usize];
    ["Offset of field: ColorMap::Type"][::core::mem::offset_of!(ColorMap, Type) - 1usize];
    ["Offset of field: ColorMap::Count"][::core::mem::offset_of!(ColorMap, Count) - 2usize];
    ["Offset of field: ColorMap::ColorTable"]
        [::core::mem::offset_of!(ColorMap, ColorTable) - 4usize];
    ["Offset of field: ColorMap::cm_vpe"][::core::mem::offset_of!(ColorMap, cm_vpe) - 8usize];
    ["Offset of field: ColorMap::LowColorBits"]
        [::core::mem::offset_of!(ColorMap, LowColorBits) - 12usize];
    ["Offset of field: ColorMap::TransparencyPlane"]
        [::core::mem::offset_of!(ColorMap, TransparencyPlane) - 16usize];
    ["Offset of field: ColorMap::SpriteResolution"]
        [::core::mem::offset_of!(ColorMap, SpriteResolution) - 17usize];
    ["Offset of field: ColorMap::SpriteResDefault"]
        [::core::mem::offset_of!(ColorMap, SpriteResDefault) - 18usize];
    ["Offset of field: ColorMap::AuxFlags"][::core::mem::offset_of!(ColorMap, AuxFlags) - 19usize];
    ["Offset of field: ColorMap::cm_vp"][::core::mem::offset_of!(ColorMap, cm_vp) - 20usize];
    ["Offset of field: ColorMap::NormalDisplayInfo"]
        [::core::mem::offset_of!(ColorMap, NormalDisplayInfo) - 24usize];
    ["Offset of field: ColorMap::CoerceDisplayInfo"]
        [::core::mem::offset_of!(ColorMap, CoerceDisplayInfo) - 28usize];
    ["Offset of field: ColorMap::cm_batch_items"]
        [::core::mem::offset_of!(ColorMap, cm_batch_items) - 32usize];
    ["Offset of field: ColorMap::VPModeID"][::core::mem::offset_of!(ColorMap, VPModeID) - 36usize];
    ["Offset of field: ColorMap::PalExtra"][::core::mem::offset_of!(ColorMap, PalExtra) - 40usize];
    ["Offset of field: ColorMap::SpriteBase_Even"]
        [::core::mem::offset_of!(ColorMap, SpriteBase_Even) - 44usize];
    ["Offset of field: ColorMap::SpriteBase_Odd"]
        [::core::mem::offset_of!(ColorMap, SpriteBase_Odd) - 46usize];
    ["Offset of field: ColorMap::Bp_0_base"]
        [::core::mem::offset_of!(ColorMap, Bp_0_base) - 48usize];
    ["Offset of field: ColorMap::Bp_1_base"]
        [::core::mem::offset_of!(ColorMap, Bp_1_base) - 50usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct PaletteExtra {
    pub pe_Semaphore: SignalSemaphore,
    pub pe_FirstFree: UWORD,
    pub pe_NFree: UWORD,
    pub pe_FirstShared: UWORD,
    pub pe_NShared: UWORD,
    pub pe_RefCnt: *mut UBYTE,
    pub pe_AllocList: *mut UBYTE,
    pub pe_ViewPort: *mut ViewPort,
    pub pe_SharableColors: UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PaletteExtra"][::core::mem::size_of::<PaletteExtra>() - 68usize];
    ["Alignment of PaletteExtra"][::core::mem::align_of::<PaletteExtra>() - 2usize];
    ["Offset of field: PaletteExtra::pe_Semaphore"]
        [::core::mem::offset_of!(PaletteExtra, pe_Semaphore) - 0usize];
    ["Offset of field: PaletteExtra::pe_FirstFree"]
        [::core::mem::offset_of!(PaletteExtra, pe_FirstFree) - 46usize];
    ["Offset of field: PaletteExtra::pe_NFree"]
        [::core::mem::offset_of!(PaletteExtra, pe_NFree) - 48usize];
    ["Offset of field: PaletteExtra::pe_FirstShared"]
        [::core::mem::offset_of!(PaletteExtra, pe_FirstShared) - 50usize];
    ["Offset of field: PaletteExtra::pe_NShared"]
        [::core::mem::offset_of!(PaletteExtra, pe_NShared) - 52usize];
    ["Offset of field: PaletteExtra::pe_RefCnt"]
        [::core::mem::offset_of!(PaletteExtra, pe_RefCnt) - 54usize];
    ["Offset of field: PaletteExtra::pe_AllocList"]
        [::core::mem::offset_of!(PaletteExtra, pe_AllocList) - 58usize];
    ["Offset of field: PaletteExtra::pe_ViewPort"]
        [::core::mem::offset_of!(PaletteExtra, pe_ViewPort) - 62usize];
    ["Offset of field: PaletteExtra::pe_SharableColors"]
        [::core::mem::offset_of!(PaletteExtra, pe_SharableColors) - 66usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct DBufInfo {
    pub dbi_Link1: APTR,
    pub dbi_Count1: ULONG,
    pub dbi_SafeMessage: Message,
    pub dbi_UserData1: APTR,
    pub dbi_Link2: APTR,
    pub dbi_Count2: ULONG,
    pub dbi_DispMessage: Message,
    pub dbi_UserData2: APTR,
    pub dbi_MatchLong: ULONG,
    pub dbi_CopPtr1: APTR,
    pub dbi_CopPtr2: APTR,
    pub dbi_CopPtr3: APTR,
    pub dbi_BeamPos1: UWORD,
    pub dbi_BeamPos2: UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DBufInfo"][::core::mem::size_of::<DBufInfo>() - 84usize];
    ["Alignment of DBufInfo"][::core::mem::align_of::<DBufInfo>() - 2usize];
    ["Offset of field: DBufInfo::dbi_Link1"][::core::mem::offset_of!(DBufInfo, dbi_Link1) - 0usize];
    ["Offset of field: DBufInfo::dbi_Count1"]
        [::core::mem::offset_of!(DBufInfo, dbi_Count1) - 4usize];
    ["Offset of field: DBufInfo::dbi_SafeMessage"]
        [::core::mem::offset_of!(DBufInfo, dbi_SafeMessage) - 8usize];
    ["Offset of field: DBufInfo::dbi_UserData1"]
        [::core::mem::offset_of!(DBufInfo, dbi_UserData1) - 28usize];
    ["Offset of field: DBufInfo::dbi_Link2"]
        [::core::mem::offset_of!(DBufInfo, dbi_Link2) - 32usize];
    ["Offset of field: DBufInfo::dbi_Count2"]
        [::core::mem::offset_of!(DBufInfo, dbi_Count2) - 36usize];
    ["Offset of field: DBufInfo::dbi_DispMessage"]
        [::core::mem::offset_of!(DBufInfo, dbi_DispMessage) - 40usize];
    ["Offset of field: DBufInfo::dbi_UserData2"]
        [::core::mem::offset_of!(DBufInfo, dbi_UserData2) - 60usize];
    ["Offset of field: DBufInfo::dbi_MatchLong"]
        [::core::mem::offset_of!(DBufInfo, dbi_MatchLong) - 64usize];
    ["Offset of field: DBufInfo::dbi_CopPtr1"]
        [::core::mem::offset_of!(DBufInfo, dbi_CopPtr1) - 68usize];
    ["Offset of field: DBufInfo::dbi_CopPtr2"]
        [::core::mem::offset_of!(DBufInfo, dbi_CopPtr2) - 72usize];
    ["Offset of field: DBufInfo::dbi_CopPtr3"]
        [::core::mem::offset_of!(DBufInfo, dbi_CopPtr3) - 76usize];
    ["Offset of field: DBufInfo::dbi_BeamPos1"]
        [::core::mem::offset_of!(DBufInfo, dbi_BeamPos1) - 80usize];
    ["Offset of field: DBufInfo::dbi_BeamPos2"]
        [::core::mem::offset_of!(DBufInfo, dbi_BeamPos2) - 82usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct AreaInfo {
    pub VctrTbl: *mut WORD,
    pub VctrPtr: *mut WORD,
    pub FlagTbl: *mut BYTE,
    pub FlagPtr: *mut BYTE,
    pub Count: WORD,
    pub MaxCount: WORD,
    pub FirstX: WORD,
    pub FirstY: WORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AreaInfo"][::core::mem::size_of::<AreaInfo>() - 24usize];
    ["Alignment of AreaInfo"][::core::mem::align_of::<AreaInfo>() - 2usize];
    ["Offset of field: AreaInfo::VctrTbl"][::core::mem::offset_of!(AreaInfo, VctrTbl) - 0usize];
    ["Offset of field: AreaInfo::VctrPtr"][::core::mem::offset_of!(AreaInfo, VctrPtr) - 4usize];
    ["Offset of field: AreaInfo::FlagTbl"][::core::mem::offset_of!(AreaInfo, FlagTbl) - 8usize];
    ["Offset of field: AreaInfo::FlagPtr"][::core::mem::offset_of!(AreaInfo, FlagPtr) - 12usize];
    ["Offset of field: AreaInfo::Count"][::core::mem::offset_of!(AreaInfo, Count) - 16usize];
    ["Offset of field: AreaInfo::MaxCount"][::core::mem::offset_of!(AreaInfo, MaxCount) - 18usize];
    ["Offset of field: AreaInfo::FirstX"][::core::mem::offset_of!(AreaInfo, FirstX) - 20usize];
    ["Offset of field: AreaInfo::FirstY"][::core::mem::offset_of!(AreaInfo, FirstY) - 22usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct TmpRas {
    pub RasPtr: *mut BYTE,
    pub Size: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TmpRas"][::core::mem::size_of::<TmpRas>() - 8usize];
    ["Alignment of TmpRas"][::core::mem::align_of::<TmpRas>() - 2usize];
    ["Offset of field: TmpRas::RasPtr"][::core::mem::offset_of!(TmpRas, RasPtr) - 0usize];
    ["Offset of field: TmpRas::Size"][::core::mem::offset_of!(TmpRas, Size) - 4usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct GelsInfo {
    pub sprRsrvd: BYTE,
    pub Flags: UBYTE,
    pub gelHead: *mut VSprite,
    pub gelTail: *mut VSprite,
    pub nextLine: *mut WORD,
    pub lastColor: *mut *mut WORD,
    pub collHandler: *mut collTable,
    pub leftmost: WORD,
    pub rightmost: WORD,
    pub topmost: WORD,
    pub bottommost: WORD,
    pub firstBlissObj: APTR,
    pub lastBlissObj: APTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GelsInfo"][::core::mem::size_of::<GelsInfo>() - 38usize];
    ["Alignment of GelsInfo"][::core::mem::align_of::<GelsInfo>() - 2usize];
    ["Offset of field: GelsInfo::sprRsrvd"][::core::mem::offset_of!(GelsInfo, sprRsrvd) - 0usize];
    ["Offset of field: GelsInfo::Flags"][::core::mem::offset_of!(GelsInfo, Flags) - 1usize];
    ["Offset of field: GelsInfo::gelHead"][::core::mem::offset_of!(GelsInfo, gelHead) - 2usize];
    ["Offset of field: GelsInfo::gelTail"][::core::mem::offset_of!(GelsInfo, gelTail) - 6usize];
    ["Offset of field: GelsInfo::nextLine"][::core::mem::offset_of!(GelsInfo, nextLine) - 10usize];
    ["Offset of field: GelsInfo::lastColor"]
        [::core::mem::offset_of!(GelsInfo, lastColor) - 14usize];
    ["Offset of field: GelsInfo::collHandler"]
        [::core::mem::offset_of!(GelsInfo, collHandler) - 18usize];
    ["Offset of field: GelsInfo::leftmost"][::core::mem::offset_of!(GelsInfo, leftmost) - 22usize];
    ["Offset of field: GelsInfo::rightmost"]
        [::core::mem::offset_of!(GelsInfo, rightmost) - 24usize];
    ["Offset of field: GelsInfo::topmost"][::core::mem::offset_of!(GelsInfo, topmost) - 26usize];
    ["Offset of field: GelsInfo::bottommost"]
        [::core::mem::offset_of!(GelsInfo, bottommost) - 28usize];
    ["Offset of field: GelsInfo::firstBlissObj"]
        [::core::mem::offset_of!(GelsInfo, firstBlissObj) - 30usize];
    ["Offset of field: GelsInfo::lastBlissObj"]
        [::core::mem::offset_of!(GelsInfo, lastBlissObj) - 34usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct RastPort {
    pub Layer: *mut Layer,
    pub BitMap: *mut BitMap,
    pub AreaPtrn: *mut UWORD,
    pub TmpRas: *mut TmpRas,
    pub AreaInfo: *mut AreaInfo,
    pub GelsInfo: *mut GelsInfo,
    pub Mask: UBYTE,
    pub FgPen: BYTE,
    pub BgPen: BYTE,
    pub AOlPen: BYTE,
    pub DrawMode: BYTE,
    pub AreaPtSz: BYTE,
    pub linpatcnt: BYTE,
    pub dummy: BYTE,
    pub Flags: UWORD,
    pub LinePtrn: UWORD,
    pub cp_x: WORD,
    pub cp_y: WORD,
    pub minterms: [UBYTE; 8usize],
    pub PenWidth: WORD,
    pub PenHeight: WORD,
    pub Font: *mut TextFont,
    pub AlgoStyle: UBYTE,
    pub TxFlags: UBYTE,
    pub TxHeight: UWORD,
    pub TxWidth: UWORD,
    pub TxBaseline: UWORD,
    pub TxSpacing: WORD,
    pub RP_User: *mut APTR,
    pub longreserved: [ULONG; 2usize],
    pub wordreserved: [UWORD; 7usize],
    pub reserved: [UBYTE; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RastPort"][::core::mem::size_of::<RastPort>() - 100usize];
    ["Alignment of RastPort"][::core::mem::align_of::<RastPort>() - 2usize];
    ["Offset of field: RastPort::Layer"][::core::mem::offset_of!(RastPort, Layer) - 0usize];
    ["Offset of field: RastPort::BitMap"][::core::mem::offset_of!(RastPort, BitMap) - 4usize];
    ["Offset of field: RastPort::AreaPtrn"][::core::mem::offset_of!(RastPort, AreaPtrn) - 8usize];
    ["Offset of field: RastPort::TmpRas"][::core::mem::offset_of!(RastPort, TmpRas) - 12usize];
    ["Offset of field: RastPort::AreaInfo"][::core::mem::offset_of!(RastPort, AreaInfo) - 16usize];
    ["Offset of field: RastPort::GelsInfo"][::core::mem::offset_of!(RastPort, GelsInfo) - 20usize];
    ["Offset of field: RastPort::Mask"][::core::mem::offset_of!(RastPort, Mask) - 24usize];
    ["Offset of field: RastPort::FgPen"][::core::mem::offset_of!(RastPort, FgPen) - 25usize];
    ["Offset of field: RastPort::BgPen"][::core::mem::offset_of!(RastPort, BgPen) - 26usize];
    ["Offset of field: RastPort::AOlPen"][::core::mem::offset_of!(RastPort, AOlPen) - 27usize];
    ["Offset of field: RastPort::DrawMode"][::core::mem::offset_of!(RastPort, DrawMode) - 28usize];
    ["Offset of field: RastPort::AreaPtSz"][::core::mem::offset_of!(RastPort, AreaPtSz) - 29usize];
    ["Offset of field: RastPort::linpatcnt"]
        [::core::mem::offset_of!(RastPort, linpatcnt) - 30usize];
    ["Offset of field: RastPort::dummy"][::core::mem::offset_of!(RastPort, dummy) - 31usize];
    ["Offset of field: RastPort::Flags"][::core::mem::offset_of!(RastPort, Flags) - 32usize];
    ["Offset of field: RastPort::LinePtrn"][::core::mem::offset_of!(RastPort, LinePtrn) - 34usize];
    ["Offset of field: RastPort::cp_x"][::core::mem::offset_of!(RastPort, cp_x) - 36usize];
    ["Offset of field: RastPort::cp_y"][::core::mem::offset_of!(RastPort, cp_y) - 38usize];
    ["Offset of field: RastPort::minterms"][::core::mem::offset_of!(RastPort, minterms) - 40usize];
    ["Offset of field: RastPort::PenWidth"][::core::mem::offset_of!(RastPort, PenWidth) - 48usize];
    ["Offset of field: RastPort::PenHeight"]
        [::core::mem::offset_of!(RastPort, PenHeight) - 50usize];
    ["Offset of field: RastPort::Font"][::core::mem::offset_of!(RastPort, Font) - 52usize];
    ["Offset of field: RastPort::AlgoStyle"]
        [::core::mem::offset_of!(RastPort, AlgoStyle) - 56usize];
    ["Offset of field: RastPort::TxFlags"][::core::mem::offset_of!(RastPort, TxFlags) - 57usize];
    ["Offset of field: RastPort::TxHeight"][::core::mem::offset_of!(RastPort, TxHeight) - 58usize];
    ["Offset of field: RastPort::TxWidth"][::core::mem::offset_of!(RastPort, TxWidth) - 60usize];
    ["Offset of field: RastPort::TxBaseline"]
        [::core::mem::offset_of!(RastPort, TxBaseline) - 62usize];
    ["Offset of field: RastPort::TxSpacing"]
        [::core::mem::offset_of!(RastPort, TxSpacing) - 64usize];
    ["Offset of field: RastPort::RP_User"][::core::mem::offset_of!(RastPort, RP_User) - 66usize];
    ["Offset of field: RastPort::longreserved"]
        [::core::mem::offset_of!(RastPort, longreserved) - 70usize];
    ["Offset of field: RastPort::wordreserved"]
        [::core::mem::offset_of!(RastPort, wordreserved) - 78usize];
    ["Offset of field: RastPort::reserved"][::core::mem::offset_of!(RastPort, reserved) - 92usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct Layer_Info {
    pub top_layer: *mut Layer,
    pub resPtr1: *mut ::core::ffi::c_void,
    pub resPtr2: *mut ::core::ffi::c_void,
    pub FreeClipRects: *mut ClipRect,
    pub bounds: Rectangle,
    pub Lock: SignalSemaphore,
    pub gs_Head: MinList,
    pub PrivateReserve3: WORD,
    pub PrivateReserve4: *mut ::core::ffi::c_void,
    pub Flags: UWORD,
    pub res_count: BYTE,
    pub LockLayersCount: BYTE,
    pub PrivateReserve5: BYTE,
    pub UserClipRectsCount: BYTE,
    pub BlankHook: *mut Hook,
    pub resPtr5: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Layer_Info"][::core::mem::size_of::<Layer_Info>() - 102usize];
    ["Alignment of Layer_Info"][::core::mem::align_of::<Layer_Info>() - 2usize];
    ["Offset of field: Layer_Info::top_layer"]
        [::core::mem::offset_of!(Layer_Info, top_layer) - 0usize];
    ["Offset of field: Layer_Info::resPtr1"][::core::mem::offset_of!(Layer_Info, resPtr1) - 4usize];
    ["Offset of field: Layer_Info::resPtr2"][::core::mem::offset_of!(Layer_Info, resPtr2) - 8usize];
    ["Offset of field: Layer_Info::FreeClipRects"]
        [::core::mem::offset_of!(Layer_Info, FreeClipRects) - 12usize];
    ["Offset of field: Layer_Info::bounds"][::core::mem::offset_of!(Layer_Info, bounds) - 16usize];
    ["Offset of field: Layer_Info::Lock"][::core::mem::offset_of!(Layer_Info, Lock) - 24usize];
    ["Offset of field: Layer_Info::gs_Head"]
        [::core::mem::offset_of!(Layer_Info, gs_Head) - 70usize];
    ["Offset of field: Layer_Info::PrivateReserve3"]
        [::core::mem::offset_of!(Layer_Info, PrivateReserve3) - 82usize];
    ["Offset of field: Layer_Info::PrivateReserve4"]
        [::core::mem::offset_of!(Layer_Info, PrivateReserve4) - 84usize];
    ["Offset of field: Layer_Info::Flags"][::core::mem::offset_of!(Layer_Info, Flags) - 88usize];
    ["Offset of field: Layer_Info::res_count"]
        [::core::mem::offset_of!(Layer_Info, res_count) - 90usize];
    ["Offset of field: Layer_Info::LockLayersCount"]
        [::core::mem::offset_of!(Layer_Info, LockLayersCount) - 91usize];
    ["Offset of field: Layer_Info::PrivateReserve5"]
        [::core::mem::offset_of!(Layer_Info, PrivateReserve5) - 92usize];
    ["Offset of field: Layer_Info::UserClipRectsCount"]
        [::core::mem::offset_of!(Layer_Info, UserClipRectsCount) - 93usize];
    ["Offset of field: Layer_Info::BlankHook"]
        [::core::mem::offset_of!(Layer_Info, BlankHook) - 94usize];
    ["Offset of field: Layer_Info::resPtr5"]
        [::core::mem::offset_of!(Layer_Info, resPtr5) - 98usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct TextAttr {
    pub ta_Name: STRPTR,
    pub ta_YSize: UWORD,
    pub ta_Style: UBYTE,
    pub ta_Flags: UBYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TextAttr"][::core::mem::size_of::<TextAttr>() - 8usize];
    ["Alignment of TextAttr"][::core::mem::align_of::<TextAttr>() - 2usize];
    ["Offset of field: TextAttr::ta_Name"][::core::mem::offset_of!(TextAttr, ta_Name) - 0usize];
    ["Offset of field: TextAttr::ta_YSize"][::core::mem::offset_of!(TextAttr, ta_YSize) - 4usize];
    ["Offset of field: TextAttr::ta_Style"][::core::mem::offset_of!(TextAttr, ta_Style) - 6usize];
    ["Offset of field: TextAttr::ta_Flags"][::core::mem::offset_of!(TextAttr, ta_Flags) - 7usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct TTextAttr {
    pub tta_Name: STRPTR,
    pub tta_YSize: UWORD,
    pub tta_Style: UBYTE,
    pub tta_Flags: UBYTE,
    pub tta_Tags: *mut TagItem,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TTextAttr"][::core::mem::size_of::<TTextAttr>() - 12usize];
    ["Alignment of TTextAttr"][::core::mem::align_of::<TTextAttr>() - 2usize];
    ["Offset of field: TTextAttr::tta_Name"][::core::mem::offset_of!(TTextAttr, tta_Name) - 0usize];
    ["Offset of field: TTextAttr::tta_YSize"]
        [::core::mem::offset_of!(TTextAttr, tta_YSize) - 4usize];
    ["Offset of field: TTextAttr::tta_Style"]
        [::core::mem::offset_of!(TTextAttr, tta_Style) - 6usize];
    ["Offset of field: TTextAttr::tta_Flags"]
        [::core::mem::offset_of!(TTextAttr, tta_Flags) - 7usize];
    ["Offset of field: TTextAttr::tta_Tags"][::core::mem::offset_of!(TTextAttr, tta_Tags) - 8usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct TextFont {
    pub tf_Message: Message,
    pub tf_YSize: UWORD,
    pub tf_Style: UBYTE,
    pub tf_Flags: UBYTE,
    pub tf_XSize: UWORD,
    pub tf_Baseline: UWORD,
    pub tf_BoldSmear: UWORD,
    pub tf_Accessors: UWORD,
    pub tf_LoChar: UBYTE,
    pub tf_HiChar: UBYTE,
    pub tf_CharData: APTR,
    pub tf_Modulo: UWORD,
    pub tf_CharLoc: APTR,
    pub tf_CharSpace: APTR,
    pub tf_CharKern: APTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TextFont"][::core::mem::size_of::<TextFont>() - 52usize];
    ["Alignment of TextFont"][::core::mem::align_of::<TextFont>() - 2usize];
    ["Offset of field: TextFont::tf_Message"]
        [::core::mem::offset_of!(TextFont, tf_Message) - 0usize];
    ["Offset of field: TextFont::tf_YSize"][::core::mem::offset_of!(TextFont, tf_YSize) - 20usize];
    ["Offset of field: TextFont::tf_Style"][::core::mem::offset_of!(TextFont, tf_Style) - 22usize];
    ["Offset of field: TextFont::tf_Flags"][::core::mem::offset_of!(TextFont, tf_Flags) - 23usize];
    ["Offset of field: TextFont::tf_XSize"][::core::mem::offset_of!(TextFont, tf_XSize) - 24usize];
    ["Offset of field: TextFont::tf_Baseline"]
        [::core::mem::offset_of!(TextFont, tf_Baseline) - 26usize];
    ["Offset of field: TextFont::tf_BoldSmear"]
        [::core::mem::offset_of!(TextFont, tf_BoldSmear) - 28usize];
    ["Offset of field: TextFont::tf_Accessors"]
        [::core::mem::offset_of!(TextFont, tf_Accessors) - 30usize];
    ["Offset of field: TextFont::tf_LoChar"]
        [::core::mem::offset_of!(TextFont, tf_LoChar) - 32usize];
    ["Offset of field: TextFont::tf_HiChar"]
        [::core::mem::offset_of!(TextFont, tf_HiChar) - 33usize];
    ["Offset of field: TextFont::tf_CharData"]
        [::core::mem::offset_of!(TextFont, tf_CharData) - 34usize];
    ["Offset of field: TextFont::tf_Modulo"]
        [::core::mem::offset_of!(TextFont, tf_Modulo) - 38usize];
    ["Offset of field: TextFont::tf_CharLoc"]
        [::core::mem::offset_of!(TextFont, tf_CharLoc) - 40usize];
    ["Offset of field: TextFont::tf_CharSpace"]
        [::core::mem::offset_of!(TextFont, tf_CharSpace) - 44usize];
    ["Offset of field: TextFont::tf_CharKern"]
        [::core::mem::offset_of!(TextFont, tf_CharKern) - 48usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct TextFontExtension {
    pub tfe_MatchWord: UWORD,
    pub tfe_Flags0: UBYTE,
    pub tfe_Flags1: UBYTE,
    pub tfe_BackPtr: *mut TextFont,
    pub tfe_OrigReplyPort: *mut MsgPort,
    pub tfe_Tags: *mut TagItem,
    pub tfe_OFontPatchS: *mut UWORD,
    pub tfe_OFontPatchK: *mut UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TextFontExtension"][::core::mem::size_of::<TextFontExtension>() - 24usize];
    ["Alignment of TextFontExtension"][::core::mem::align_of::<TextFontExtension>() - 2usize];
    ["Offset of field: TextFontExtension::tfe_MatchWord"]
        [::core::mem::offset_of!(TextFontExtension, tfe_MatchWord) - 0usize];
    ["Offset of field: TextFontExtension::tfe_Flags0"]
        [::core::mem::offset_of!(TextFontExtension, tfe_Flags0) - 2usize];
    ["Offset of field: TextFontExtension::tfe_Flags1"]
        [::core::mem::offset_of!(TextFontExtension, tfe_Flags1) - 3usize];
    ["Offset of field: TextFontExtension::tfe_BackPtr"]
        [::core::mem::offset_of!(TextFontExtension, tfe_BackPtr) - 4usize];
    ["Offset of field: TextFontExtension::tfe_OrigReplyPort"]
        [::core::mem::offset_of!(TextFontExtension, tfe_OrigReplyPort) - 8usize];
    ["Offset of field: TextFontExtension::tfe_Tags"]
        [::core::mem::offset_of!(TextFontExtension, tfe_Tags) - 12usize];
    ["Offset of field: TextFontExtension::tfe_OFontPatchS"]
        [::core::mem::offset_of!(TextFontExtension, tfe_OFontPatchS) - 16usize];
    ["Offset of field: TextFontExtension::tfe_OFontPatchK"]
        [::core::mem::offset_of!(TextFontExtension, tfe_OFontPatchK) - 20usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct ColorFontColors {
    pub cfc_Reserved: UWORD,
    pub cfc_Count: UWORD,
    pub cfc_ColorTable: *mut UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ColorFontColors"][::core::mem::size_of::<ColorFontColors>() - 8usize];
    ["Alignment of ColorFontColors"][::core::mem::align_of::<ColorFontColors>() - 2usize];
    ["Offset of field: ColorFontColors::cfc_Reserved"]
        [::core::mem::offset_of!(ColorFontColors, cfc_Reserved) - 0usize];
    ["Offset of field: ColorFontColors::cfc_Count"]
        [::core::mem::offset_of!(ColorFontColors, cfc_Count) - 2usize];
    ["Offset of field: ColorFontColors::cfc_ColorTable"]
        [::core::mem::offset_of!(ColorFontColors, cfc_ColorTable) - 4usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct ColorTextFont {
    pub ctf_TF: TextFont,
    pub ctf_Flags: UWORD,
    pub ctf_Depth: UBYTE,
    pub ctf_FgColor: UBYTE,
    pub ctf_Low: UBYTE,
    pub ctf_High: UBYTE,
    pub ctf_PlanePick: UBYTE,
    pub ctf_PlaneOnOff: UBYTE,
    pub ctf_ColorFontColors: *mut ColorFontColors,
    pub ctf_CharData: [APTR; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ColorTextFont"][::core::mem::size_of::<ColorTextFont>() - 96usize];
    ["Alignment of ColorTextFont"][::core::mem::align_of::<ColorTextFont>() - 2usize];
    ["Offset of field: ColorTextFont::ctf_TF"]
        [::core::mem::offset_of!(ColorTextFont, ctf_TF) - 0usize];
    ["Offset of field: ColorTextFont::ctf_Flags"]
        [::core::mem::offset_of!(ColorTextFont, ctf_Flags) - 52usize];
    ["Offset of field: ColorTextFont::ctf_Depth"]
        [::core::mem::offset_of!(ColorTextFont, ctf_Depth) - 54usize];
    ["Offset of field: ColorTextFont::ctf_FgColor"]
        [::core::mem::offset_of!(ColorTextFont, ctf_FgColor) - 55usize];
    ["Offset of field: ColorTextFont::ctf_Low"]
        [::core::mem::offset_of!(ColorTextFont, ctf_Low) - 56usize];
    ["Offset of field: ColorTextFont::ctf_High"]
        [::core::mem::offset_of!(ColorTextFont, ctf_High) - 57usize];
    ["Offset of field: ColorTextFont::ctf_PlanePick"]
        [::core::mem::offset_of!(ColorTextFont, ctf_PlanePick) - 58usize];
    ["Offset of field: ColorTextFont::ctf_PlaneOnOff"]
        [::core::mem::offset_of!(ColorTextFont, ctf_PlaneOnOff) - 59usize];
    ["Offset of field: ColorTextFont::ctf_ColorFontColors"]
        [::core::mem::offset_of!(ColorTextFont, ctf_ColorFontColors) - 60usize];
    ["Offset of field: ColorTextFont::ctf_CharData"]
        [::core::mem::offset_of!(ColorTextFont, ctf_CharData) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TextExtent {
    pub te_Width: UWORD,
    pub te_Height: UWORD,
    pub te_Extent: Rectangle,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TextExtent"][::core::mem::size_of::<TextExtent>() - 12usize];
    ["Alignment of TextExtent"][::core::mem::align_of::<TextExtent>() - 2usize];
    ["Offset of field: TextExtent::te_Width"]
        [::core::mem::offset_of!(TextExtent, te_Width) - 0usize];
    ["Offset of field: TextExtent::te_Height"]
        [::core::mem::offset_of!(TextExtent, te_Height) - 2usize];
    ["Offset of field: TextExtent::te_Extent"]
        [::core::mem::offset_of!(TextExtent, te_Extent) - 4usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct TimeVal {
    pub tv_secs: ULONG,
    pub tv_micro: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TimeVal"][::core::mem::size_of::<TimeVal>() - 8usize];
    ["Alignment of TimeVal"][::core::mem::align_of::<TimeVal>() - 2usize];
    ["Offset of field: TimeVal::tv_secs"][::core::mem::offset_of!(TimeVal, tv_secs) - 0usize];
    ["Offset of field: TimeVal::tv_micro"][::core::mem::offset_of!(TimeVal, tv_micro) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TimeRequest {
    pub tr_node: IORequest,
    pub tr_time: TimeVal,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TimeRequest"][::core::mem::size_of::<TimeRequest>() - 40usize];
    ["Alignment of TimeRequest"][::core::mem::align_of::<TimeRequest>() - 2usize];
    ["Offset of field: TimeRequest::tr_node"]
        [::core::mem::offset_of!(TimeRequest, tr_node) - 0usize];
    ["Offset of field: TimeRequest::tr_time"]
        [::core::mem::offset_of!(TimeRequest, tr_time) - 32usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_secs: ULONG,
    pub tv_micro: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::core::mem::size_of::<timeval>() - 8usize];
    ["Alignment of timeval"][::core::mem::align_of::<timeval>() - 2usize];
    ["Offset of field: timeval::tv_secs"][::core::mem::offset_of!(timeval, tv_secs) - 0usize];
    ["Offset of field: timeval::tv_micro"][::core::mem::offset_of!(timeval, tv_micro) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timerequest {
    pub tr_node: IORequest,
    pub tr_time: timeval,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timerequest"][::core::mem::size_of::<timerequest>() - 40usize];
    ["Alignment of timerequest"][::core::mem::align_of::<timerequest>() - 2usize];
    ["Offset of field: timerequest::tr_node"]
        [::core::mem::offset_of!(timerequest, tr_node) - 0usize];
    ["Offset of field: timerequest::tr_time"]
        [::core::mem::offset_of!(timerequest, tr_time) - 32usize];
};
pub type TimeVal_Type = timeval;
pub type TimeRequest_Type = timerequest;
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct EClockVal {
    pub ev_hi: ULONG,
    pub ev_lo: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of EClockVal"][::core::mem::size_of::<EClockVal>() - 8usize];
    ["Alignment of EClockVal"][::core::mem::align_of::<EClockVal>() - 2usize];
    ["Offset of field: EClockVal::ev_hi"][::core::mem::offset_of!(EClockVal, ev_hi) - 0usize];
    ["Offset of field: EClockVal::ev_lo"][::core::mem::offset_of!(EClockVal, ev_lo) - 4usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct IEPointerPixel {
    pub iepp_Screen: *mut Screen,
    pub iepp_Position: IEPointerPixel__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IEPointerPixel__bindgen_ty_1 {
    pub X: WORD,
    pub Y: WORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IEPointerPixel__bindgen_ty_1"]
        [::core::mem::size_of::<IEPointerPixel__bindgen_ty_1>() - 4usize];
    ["Alignment of IEPointerPixel__bindgen_ty_1"]
        [::core::mem::align_of::<IEPointerPixel__bindgen_ty_1>() - 2usize];
    ["Offset of field: IEPointerPixel__bindgen_ty_1::X"]
        [::core::mem::offset_of!(IEPointerPixel__bindgen_ty_1, X) - 0usize];
    ["Offset of field: IEPointerPixel__bindgen_ty_1::Y"]
        [::core::mem::offset_of!(IEPointerPixel__bindgen_ty_1, Y) - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IEPointerPixel"][::core::mem::size_of::<IEPointerPixel>() - 8usize];
    ["Alignment of IEPointerPixel"][::core::mem::align_of::<IEPointerPixel>() - 2usize];
    ["Offset of field: IEPointerPixel::iepp_Screen"]
        [::core::mem::offset_of!(IEPointerPixel, iepp_Screen) - 0usize];
    ["Offset of field: IEPointerPixel::iepp_Position"]
        [::core::mem::offset_of!(IEPointerPixel, iepp_Position) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IEPointerTablet {
    pub iept_Range: IEPointerTablet__bindgen_ty_1,
    pub iept_Value: IEPointerTablet__bindgen_ty_2,
    pub iept_Pressure: WORD,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IEPointerTablet__bindgen_ty_1 {
    pub X: UWORD,
    pub Y: UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IEPointerTablet__bindgen_ty_1"]
        [::core::mem::size_of::<IEPointerTablet__bindgen_ty_1>() - 4usize];
    ["Alignment of IEPointerTablet__bindgen_ty_1"]
        [::core::mem::align_of::<IEPointerTablet__bindgen_ty_1>() - 2usize];
    ["Offset of field: IEPointerTablet__bindgen_ty_1::X"]
        [::core::mem::offset_of!(IEPointerTablet__bindgen_ty_1, X) - 0usize];
    ["Offset of field: IEPointerTablet__bindgen_ty_1::Y"]
        [::core::mem::offset_of!(IEPointerTablet__bindgen_ty_1, Y) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IEPointerTablet__bindgen_ty_2 {
    pub X: UWORD,
    pub Y: UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IEPointerTablet__bindgen_ty_2"]
        [::core::mem::size_of::<IEPointerTablet__bindgen_ty_2>() - 4usize];
    ["Alignment of IEPointerTablet__bindgen_ty_2"]
        [::core::mem::align_of::<IEPointerTablet__bindgen_ty_2>() - 2usize];
    ["Offset of field: IEPointerTablet__bindgen_ty_2::X"]
        [::core::mem::offset_of!(IEPointerTablet__bindgen_ty_2, X) - 0usize];
    ["Offset of field: IEPointerTablet__bindgen_ty_2::Y"]
        [::core::mem::offset_of!(IEPointerTablet__bindgen_ty_2, Y) - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IEPointerTablet"][::core::mem::size_of::<IEPointerTablet>() - 10usize];
    ["Alignment of IEPointerTablet"][::core::mem::align_of::<IEPointerTablet>() - 2usize];
    ["Offset of field: IEPointerTablet::iept_Range"]
        [::core::mem::offset_of!(IEPointerTablet, iept_Range) - 0usize];
    ["Offset of field: IEPointerTablet::iept_Value"]
        [::core::mem::offset_of!(IEPointerTablet, iept_Value) - 4usize];
    ["Offset of field: IEPointerTablet::iept_Pressure"]
        [::core::mem::offset_of!(IEPointerTablet, iept_Pressure) - 8usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct IENewTablet {
    pub ient_CallBack: *mut Hook,
    pub ient_ScaledX: UWORD,
    pub ient_ScaledY: UWORD,
    pub ient_ScaledXFraction: UWORD,
    pub ient_ScaledYFraction: UWORD,
    pub ient_TabletX: ULONG,
    pub ient_TabletY: ULONG,
    pub ient_RangeX: ULONG,
    pub ient_RangeY: ULONG,
    pub ient_TagList: *mut TagItem,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IENewTablet"][::core::mem::size_of::<IENewTablet>() - 32usize];
    ["Alignment of IENewTablet"][::core::mem::align_of::<IENewTablet>() - 2usize];
    ["Offset of field: IENewTablet::ient_CallBack"]
        [::core::mem::offset_of!(IENewTablet, ient_CallBack) - 0usize];
    ["Offset of field: IENewTablet::ient_ScaledX"]
        [::core::mem::offset_of!(IENewTablet, ient_ScaledX) - 4usize];
    ["Offset of field: IENewTablet::ient_ScaledY"]
        [::core::mem::offset_of!(IENewTablet, ient_ScaledY) - 6usize];
    ["Offset of field: IENewTablet::ient_ScaledXFraction"]
        [::core::mem::offset_of!(IENewTablet, ient_ScaledXFraction) - 8usize];
    ["Offset of field: IENewTablet::ient_ScaledYFraction"]
        [::core::mem::offset_of!(IENewTablet, ient_ScaledYFraction) - 10usize];
    ["Offset of field: IENewTablet::ient_TabletX"]
        [::core::mem::offset_of!(IENewTablet, ient_TabletX) - 12usize];
    ["Offset of field: IENewTablet::ient_TabletY"]
        [::core::mem::offset_of!(IENewTablet, ient_TabletY) - 16usize];
    ["Offset of field: IENewTablet::ient_RangeX"]
        [::core::mem::offset_of!(IENewTablet, ient_RangeX) - 20usize];
    ["Offset of field: IENewTablet::ient_RangeY"]
        [::core::mem::offset_of!(IENewTablet, ient_RangeY) - 24usize];
    ["Offset of field: IENewTablet::ient_TagList"]
        [::core::mem::offset_of!(IENewTablet, ient_TagList) - 28usize];
};
#[repr(C, packed(2))]
#[derive(Copy, Clone)]
pub struct InputEvent {
    pub ie_NextEvent: *mut InputEvent,
    pub ie_Class: UBYTE,
    pub ie_SubClass: UBYTE,
    pub ie_Code: UWORD,
    pub ie_Qualifier: UWORD,
    pub ie_position: InputEvent__bindgen_ty_1,
    pub ie_TimeStamp: TimeVal_Type,
}
#[repr(C, packed(2))]
#[derive(Copy, Clone)]
pub union InputEvent__bindgen_ty_1 {
    pub ie_xy: InputEvent__bindgen_ty_1__bindgen_ty_1,
    pub ie_addr: APTR,
    pub ie_dead: InputEvent__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct InputEvent__bindgen_ty_1__bindgen_ty_1 {
    pub ie_x: WORD,
    pub ie_y: WORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of InputEvent__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<InputEvent__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Alignment of InputEvent__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<InputEvent__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Offset of field: InputEvent__bindgen_ty_1__bindgen_ty_1::ie_x"]
        [::core::mem::offset_of!(InputEvent__bindgen_ty_1__bindgen_ty_1, ie_x) - 0usize];
    ["Offset of field: InputEvent__bindgen_ty_1__bindgen_ty_1::ie_y"]
        [::core::mem::offset_of!(InputEvent__bindgen_ty_1__bindgen_ty_1, ie_y) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct InputEvent__bindgen_ty_1__bindgen_ty_2 {
    pub ie_prev1DownCode: UBYTE,
    pub ie_prev1DownQual: UBYTE,
    pub ie_prev2DownCode: UBYTE,
    pub ie_prev2DownQual: UBYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of InputEvent__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::size_of::<InputEvent__bindgen_ty_1__bindgen_ty_2>() - 4usize];
    ["Alignment of InputEvent__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::align_of::<InputEvent__bindgen_ty_1__bindgen_ty_2>() - 1usize];
    ["Offset of field: InputEvent__bindgen_ty_1__bindgen_ty_2::ie_prev1DownCode"][::core::mem::offset_of!(
        InputEvent__bindgen_ty_1__bindgen_ty_2,
        ie_prev1DownCode
    ) - 0usize];
    ["Offset of field: InputEvent__bindgen_ty_1__bindgen_ty_2::ie_prev1DownQual"][::core::mem::offset_of!(
        InputEvent__bindgen_ty_1__bindgen_ty_2,
        ie_prev1DownQual
    ) - 1usize];
    ["Offset of field: InputEvent__bindgen_ty_1__bindgen_ty_2::ie_prev2DownCode"][::core::mem::offset_of!(
        InputEvent__bindgen_ty_1__bindgen_ty_2,
        ie_prev2DownCode
    ) - 2usize];
    ["Offset of field: InputEvent__bindgen_ty_1__bindgen_ty_2::ie_prev2DownQual"][::core::mem::offset_of!(
        InputEvent__bindgen_ty_1__bindgen_ty_2,
        ie_prev2DownQual
    ) - 3usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of InputEvent__bindgen_ty_1"]
        [::core::mem::size_of::<InputEvent__bindgen_ty_1>() - 4usize];
    ["Alignment of InputEvent__bindgen_ty_1"]
        [::core::mem::align_of::<InputEvent__bindgen_ty_1>() - 2usize];
    ["Offset of field: InputEvent__bindgen_ty_1::ie_xy"]
        [::core::mem::offset_of!(InputEvent__bindgen_ty_1, ie_xy) - 0usize];
    ["Offset of field: InputEvent__bindgen_ty_1::ie_addr"]
        [::core::mem::offset_of!(InputEvent__bindgen_ty_1, ie_addr) - 0usize];
    ["Offset of field: InputEvent__bindgen_ty_1::ie_dead"]
        [::core::mem::offset_of!(InputEvent__bindgen_ty_1, ie_dead) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of InputEvent"][::core::mem::size_of::<InputEvent>() - 22usize];
    ["Alignment of InputEvent"][::core::mem::align_of::<InputEvent>() - 2usize];
    ["Offset of field: InputEvent::ie_NextEvent"]
        [::core::mem::offset_of!(InputEvent, ie_NextEvent) - 0usize];
    ["Offset of field: InputEvent::ie_Class"]
        [::core::mem::offset_of!(InputEvent, ie_Class) - 4usize];
    ["Offset of field: InputEvent::ie_SubClass"]
        [::core::mem::offset_of!(InputEvent, ie_SubClass) - 5usize];
    ["Offset of field: InputEvent::ie_Code"][::core::mem::offset_of!(InputEvent, ie_Code) - 6usize];
    ["Offset of field: InputEvent::ie_Qualifier"]
        [::core::mem::offset_of!(InputEvent, ie_Qualifier) - 8usize];
    ["Offset of field: InputEvent::ie_position"]
        [::core::mem::offset_of!(InputEvent, ie_position) - 10usize];
    ["Offset of field: InputEvent::ie_TimeStamp"]
        [::core::mem::offset_of!(InputEvent, ie_TimeStamp) - 14usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct Menu {
    pub NextMenu: *mut Menu,
    pub LeftEdge: WORD,
    pub TopEdge: WORD,
    pub Width: WORD,
    pub Height: WORD,
    pub Flags: UWORD,
    pub MenuName: CONST_STRPTR,
    pub FirstItem: *mut MenuItem,
    pub JazzX: WORD,
    pub JazzY: WORD,
    pub BeatX: WORD,
    pub BeatY: WORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Menu"][::core::mem::size_of::<Menu>() - 30usize];
    ["Alignment of Menu"][::core::mem::align_of::<Menu>() - 2usize];
    ["Offset of field: Menu::NextMenu"][::core::mem::offset_of!(Menu, NextMenu) - 0usize];
    ["Offset of field: Menu::LeftEdge"][::core::mem::offset_of!(Menu, LeftEdge) - 4usize];
    ["Offset of field: Menu::TopEdge"][::core::mem::offset_of!(Menu, TopEdge) - 6usize];
    ["Offset of field: Menu::Width"][::core::mem::offset_of!(Menu, Width) - 8usize];
    ["Offset of field: Menu::Height"][::core::mem::offset_of!(Menu, Height) - 10usize];
    ["Offset of field: Menu::Flags"][::core::mem::offset_of!(Menu, Flags) - 12usize];
    ["Offset of field: Menu::MenuName"][::core::mem::offset_of!(Menu, MenuName) - 14usize];
    ["Offset of field: Menu::FirstItem"][::core::mem::offset_of!(Menu, FirstItem) - 18usize];
    ["Offset of field: Menu::JazzX"][::core::mem::offset_of!(Menu, JazzX) - 22usize];
    ["Offset of field: Menu::JazzY"][::core::mem::offset_of!(Menu, JazzY) - 24usize];
    ["Offset of field: Menu::BeatX"][::core::mem::offset_of!(Menu, BeatX) - 26usize];
    ["Offset of field: Menu::BeatY"][::core::mem::offset_of!(Menu, BeatY) - 28usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct MenuItem {
    pub NextItem: *mut MenuItem,
    pub LeftEdge: WORD,
    pub TopEdge: WORD,
    pub Width: WORD,
    pub Height: WORD,
    pub Flags: UWORD,
    pub MutualExclude: LONG,
    pub ItemFill: APTR,
    pub SelectFill: APTR,
    pub Command: BYTE,
    pub SubItem: *mut MenuItem,
    pub NextSelect: UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MenuItem"][::core::mem::size_of::<MenuItem>() - 34usize];
    ["Alignment of MenuItem"][::core::mem::align_of::<MenuItem>() - 2usize];
    ["Offset of field: MenuItem::NextItem"][::core::mem::offset_of!(MenuItem, NextItem) - 0usize];
    ["Offset of field: MenuItem::LeftEdge"][::core::mem::offset_of!(MenuItem, LeftEdge) - 4usize];
    ["Offset of field: MenuItem::TopEdge"][::core::mem::offset_of!(MenuItem, TopEdge) - 6usize];
    ["Offset of field: MenuItem::Width"][::core::mem::offset_of!(MenuItem, Width) - 8usize];
    ["Offset of field: MenuItem::Height"][::core::mem::offset_of!(MenuItem, Height) - 10usize];
    ["Offset of field: MenuItem::Flags"][::core::mem::offset_of!(MenuItem, Flags) - 12usize];
    ["Offset of field: MenuItem::MutualExclude"]
        [::core::mem::offset_of!(MenuItem, MutualExclude) - 14usize];
    ["Offset of field: MenuItem::ItemFill"][::core::mem::offset_of!(MenuItem, ItemFill) - 18usize];
    ["Offset of field: MenuItem::SelectFill"]
        [::core::mem::offset_of!(MenuItem, SelectFill) - 22usize];
    ["Offset of field: MenuItem::Command"][::core::mem::offset_of!(MenuItem, Command) - 26usize];
    ["Offset of field: MenuItem::SubItem"][::core::mem::offset_of!(MenuItem, SubItem) - 28usize];
    ["Offset of field: MenuItem::NextSelect"]
        [::core::mem::offset_of!(MenuItem, NextSelect) - 32usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct Requester {
    pub OlderRequest: *mut Requester,
    pub LeftEdge: WORD,
    pub TopEdge: WORD,
    pub Width: WORD,
    pub Height: WORD,
    pub RelLeft: WORD,
    pub RelTop: WORD,
    pub ReqGadget: *mut Gadget,
    pub ReqBorder: *mut Border,
    pub ReqText: *mut IntuiText,
    pub Flags: UWORD,
    pub BackFill: UBYTE,
    pub ReqLayer: *mut Layer,
    pub ReqPad1: [UBYTE; 32usize],
    pub ImageBMap: *mut BitMap,
    pub RWindow: *mut Window,
    pub ReqImage: *mut Image,
    pub ReqPad2: [UBYTE; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Requester"][::core::mem::size_of::<Requester>() - 112usize];
    ["Alignment of Requester"][::core::mem::align_of::<Requester>() - 2usize];
    ["Offset of field: Requester::OlderRequest"]
        [::core::mem::offset_of!(Requester, OlderRequest) - 0usize];
    ["Offset of field: Requester::LeftEdge"][::core::mem::offset_of!(Requester, LeftEdge) - 4usize];
    ["Offset of field: Requester::TopEdge"][::core::mem::offset_of!(Requester, TopEdge) - 6usize];
    ["Offset of field: Requester::Width"][::core::mem::offset_of!(Requester, Width) - 8usize];
    ["Offset of field: Requester::Height"][::core::mem::offset_of!(Requester, Height) - 10usize];
    ["Offset of field: Requester::RelLeft"][::core::mem::offset_of!(Requester, RelLeft) - 12usize];
    ["Offset of field: Requester::RelTop"][::core::mem::offset_of!(Requester, RelTop) - 14usize];
    ["Offset of field: Requester::ReqGadget"]
        [::core::mem::offset_of!(Requester, ReqGadget) - 16usize];
    ["Offset of field: Requester::ReqBorder"]
        [::core::mem::offset_of!(Requester, ReqBorder) - 20usize];
    ["Offset of field: Requester::ReqText"][::core::mem::offset_of!(Requester, ReqText) - 24usize];
    ["Offset of field: Requester::Flags"][::core::mem::offset_of!(Requester, Flags) - 28usize];
    ["Offset of field: Requester::BackFill"]
        [::core::mem::offset_of!(Requester, BackFill) - 30usize];
    ["Offset of field: Requester::ReqLayer"]
        [::core::mem::offset_of!(Requester, ReqLayer) - 32usize];
    ["Offset of field: Requester::ReqPad1"][::core::mem::offset_of!(Requester, ReqPad1) - 36usize];
    ["Offset of field: Requester::ImageBMap"]
        [::core::mem::offset_of!(Requester, ImageBMap) - 68usize];
    ["Offset of field: Requester::RWindow"][::core::mem::offset_of!(Requester, RWindow) - 72usize];
    ["Offset of field: Requester::ReqImage"]
        [::core::mem::offset_of!(Requester, ReqImage) - 76usize];
    ["Offset of field: Requester::ReqPad2"][::core::mem::offset_of!(Requester, ReqPad2) - 80usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct Gadget {
    pub NextGadget: *mut Gadget,
    pub LeftEdge: WORD,
    pub TopEdge: WORD,
    pub Width: WORD,
    pub Height: WORD,
    pub Flags: UWORD,
    pub Activation: UWORD,
    pub GadgetType: UWORD,
    pub GadgetRender: APTR,
    pub SelectRender: APTR,
    pub GadgetText: *mut IntuiText,
    pub MutualExclude: LONG,
    pub SpecialInfo: APTR,
    pub GadgetID: UWORD,
    pub UserData: APTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Gadget"][::core::mem::size_of::<Gadget>() - 44usize];
    ["Alignment of Gadget"][::core::mem::align_of::<Gadget>() - 2usize];
    ["Offset of field: Gadget::NextGadget"][::core::mem::offset_of!(Gadget, NextGadget) - 0usize];
    ["Offset of field: Gadget::LeftEdge"][::core::mem::offset_of!(Gadget, LeftEdge) - 4usize];
    ["Offset of field: Gadget::TopEdge"][::core::mem::offset_of!(Gadget, TopEdge) - 6usize];
    ["Offset of field: Gadget::Width"][::core::mem::offset_of!(Gadget, Width) - 8usize];
    ["Offset of field: Gadget::Height"][::core::mem::offset_of!(Gadget, Height) - 10usize];
    ["Offset of field: Gadget::Flags"][::core::mem::offset_of!(Gadget, Flags) - 12usize];
    ["Offset of field: Gadget::Activation"][::core::mem::offset_of!(Gadget, Activation) - 14usize];
    ["Offset of field: Gadget::GadgetType"][::core::mem::offset_of!(Gadget, GadgetType) - 16usize];
    ["Offset of field: Gadget::GadgetRender"]
        [::core::mem::offset_of!(Gadget, GadgetRender) - 18usize];
    ["Offset of field: Gadget::SelectRender"]
        [::core::mem::offset_of!(Gadget, SelectRender) - 22usize];
    ["Offset of field: Gadget::GadgetText"][::core::mem::offset_of!(Gadget, GadgetText) - 26usize];
    ["Offset of field: Gadget::MutualExclude"]
        [::core::mem::offset_of!(Gadget, MutualExclude) - 30usize];
    ["Offset of field: Gadget::SpecialInfo"]
        [::core::mem::offset_of!(Gadget, SpecialInfo) - 34usize];
    ["Offset of field: Gadget::GadgetID"][::core::mem::offset_of!(Gadget, GadgetID) - 38usize];
    ["Offset of field: Gadget::UserData"][::core::mem::offset_of!(Gadget, UserData) - 40usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct ExtGadget {
    pub NextGadget: *mut ExtGadget,
    pub LeftEdge: WORD,
    pub TopEdge: WORD,
    pub Width: WORD,
    pub Height: WORD,
    pub Flags: UWORD,
    pub Activation: UWORD,
    pub GadgetType: UWORD,
    pub GadgetRender: APTR,
    pub SelectRender: APTR,
    pub GadgetText: *mut IntuiText,
    pub MutualExclude: LONG,
    pub SpecialInfo: APTR,
    pub GadgetID: UWORD,
    pub UserData: APTR,
    pub MoreFlags: ULONG,
    pub BoundsLeftEdge: WORD,
    pub BoundsTopEdge: WORD,
    pub BoundsWidth: WORD,
    pub BoundsHeight: WORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ExtGadget"][::core::mem::size_of::<ExtGadget>() - 56usize];
    ["Alignment of ExtGadget"][::core::mem::align_of::<ExtGadget>() - 2usize];
    ["Offset of field: ExtGadget::NextGadget"]
        [::core::mem::offset_of!(ExtGadget, NextGadget) - 0usize];
    ["Offset of field: ExtGadget::LeftEdge"][::core::mem::offset_of!(ExtGadget, LeftEdge) - 4usize];
    ["Offset of field: ExtGadget::TopEdge"][::core::mem::offset_of!(ExtGadget, TopEdge) - 6usize];
    ["Offset of field: ExtGadget::Width"][::core::mem::offset_of!(ExtGadget, Width) - 8usize];
    ["Offset of field: ExtGadget::Height"][::core::mem::offset_of!(ExtGadget, Height) - 10usize];
    ["Offset of field: ExtGadget::Flags"][::core::mem::offset_of!(ExtGadget, Flags) - 12usize];
    ["Offset of field: ExtGadget::Activation"]
        [::core::mem::offset_of!(ExtGadget, Activation) - 14usize];
    ["Offset of field: ExtGadget::GadgetType"]
        [::core::mem::offset_of!(ExtGadget, GadgetType) - 16usize];
    ["Offset of field: ExtGadget::GadgetRender"]
        [::core::mem::offset_of!(ExtGadget, GadgetRender) - 18usize];
    ["Offset of field: ExtGadget::SelectRender"]
        [::core::mem::offset_of!(ExtGadget, SelectRender) - 22usize];
    ["Offset of field: ExtGadget::GadgetText"]
        [::core::mem::offset_of!(ExtGadget, GadgetText) - 26usize];
    ["Offset of field: ExtGadget::MutualExclude"]
        [::core::mem::offset_of!(ExtGadget, MutualExclude) - 30usize];
    ["Offset of field: ExtGadget::SpecialInfo"]
        [::core::mem::offset_of!(ExtGadget, SpecialInfo) - 34usize];
    ["Offset of field: ExtGadget::GadgetID"]
        [::core::mem::offset_of!(ExtGadget, GadgetID) - 38usize];
    ["Offset of field: ExtGadget::UserData"]
        [::core::mem::offset_of!(ExtGadget, UserData) - 40usize];
    ["Offset of field: ExtGadget::MoreFlags"]
        [::core::mem::offset_of!(ExtGadget, MoreFlags) - 44usize];
    ["Offset of field: ExtGadget::BoundsLeftEdge"]
        [::core::mem::offset_of!(ExtGadget, BoundsLeftEdge) - 48usize];
    ["Offset of field: ExtGadget::BoundsTopEdge"]
        [::core::mem::offset_of!(ExtGadget, BoundsTopEdge) - 50usize];
    ["Offset of field: ExtGadget::BoundsWidth"]
        [::core::mem::offset_of!(ExtGadget, BoundsWidth) - 52usize];
    ["Offset of field: ExtGadget::BoundsHeight"]
        [::core::mem::offset_of!(ExtGadget, BoundsHeight) - 54usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct BoolInfo {
    pub Flags: UWORD,
    pub Mask: *mut UWORD,
    pub Reserved: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BoolInfo"][::core::mem::size_of::<BoolInfo>() - 10usize];
    ["Alignment of BoolInfo"][::core::mem::align_of::<BoolInfo>() - 2usize];
    ["Offset of field: BoolInfo::Flags"][::core::mem::offset_of!(BoolInfo, Flags) - 0usize];
    ["Offset of field: BoolInfo::Mask"][::core::mem::offset_of!(BoolInfo, Mask) - 2usize];
    ["Offset of field: BoolInfo::Reserved"][::core::mem::offset_of!(BoolInfo, Reserved) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PropInfo {
    pub Flags: UWORD,
    pub HorizPot: UWORD,
    pub VertPot: UWORD,
    pub HorizBody: UWORD,
    pub VertBody: UWORD,
    pub CWidth: UWORD,
    pub CHeight: UWORD,
    pub HPotRes: UWORD,
    pub VPotRes: UWORD,
    pub LeftBorder: UWORD,
    pub TopBorder: UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PropInfo"][::core::mem::size_of::<PropInfo>() - 22usize];
    ["Alignment of PropInfo"][::core::mem::align_of::<PropInfo>() - 2usize];
    ["Offset of field: PropInfo::Flags"][::core::mem::offset_of!(PropInfo, Flags) - 0usize];
    ["Offset of field: PropInfo::HorizPot"][::core::mem::offset_of!(PropInfo, HorizPot) - 2usize];
    ["Offset of field: PropInfo::VertPot"][::core::mem::offset_of!(PropInfo, VertPot) - 4usize];
    ["Offset of field: PropInfo::HorizBody"][::core::mem::offset_of!(PropInfo, HorizBody) - 6usize];
    ["Offset of field: PropInfo::VertBody"][::core::mem::offset_of!(PropInfo, VertBody) - 8usize];
    ["Offset of field: PropInfo::CWidth"][::core::mem::offset_of!(PropInfo, CWidth) - 10usize];
    ["Offset of field: PropInfo::CHeight"][::core::mem::offset_of!(PropInfo, CHeight) - 12usize];
    ["Offset of field: PropInfo::HPotRes"][::core::mem::offset_of!(PropInfo, HPotRes) - 14usize];
    ["Offset of field: PropInfo::VPotRes"][::core::mem::offset_of!(PropInfo, VPotRes) - 16usize];
    ["Offset of field: PropInfo::LeftBorder"]
        [::core::mem::offset_of!(PropInfo, LeftBorder) - 18usize];
    ["Offset of field: PropInfo::TopBorder"]
        [::core::mem::offset_of!(PropInfo, TopBorder) - 20usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct StringInfo {
    pub Buffer: STRPTR,
    pub UndoBuffer: STRPTR,
    pub BufferPos: WORD,
    pub MaxChars: WORD,
    pub DispPos: WORD,
    pub UndoPos: WORD,
    pub NumChars: WORD,
    pub DispCount: WORD,
    pub CLeft: WORD,
    pub CTop: WORD,
    pub Extension: *mut StringExtend,
    pub LongInt: LONG,
    pub AltKeyMap: *mut KeyMap,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StringInfo"][::core::mem::size_of::<StringInfo>() - 36usize];
    ["Alignment of StringInfo"][::core::mem::align_of::<StringInfo>() - 2usize];
    ["Offset of field: StringInfo::Buffer"][::core::mem::offset_of!(StringInfo, Buffer) - 0usize];
    ["Offset of field: StringInfo::UndoBuffer"]
        [::core::mem::offset_of!(StringInfo, UndoBuffer) - 4usize];
    ["Offset of field: StringInfo::BufferPos"]
        [::core::mem::offset_of!(StringInfo, BufferPos) - 8usize];
    ["Offset of field: StringInfo::MaxChars"]
        [::core::mem::offset_of!(StringInfo, MaxChars) - 10usize];
    ["Offset of field: StringInfo::DispPos"]
        [::core::mem::offset_of!(StringInfo, DispPos) - 12usize];
    ["Offset of field: StringInfo::UndoPos"]
        [::core::mem::offset_of!(StringInfo, UndoPos) - 14usize];
    ["Offset of field: StringInfo::NumChars"]
        [::core::mem::offset_of!(StringInfo, NumChars) - 16usize];
    ["Offset of field: StringInfo::DispCount"]
        [::core::mem::offset_of!(StringInfo, DispCount) - 18usize];
    ["Offset of field: StringInfo::CLeft"][::core::mem::offset_of!(StringInfo, CLeft) - 20usize];
    ["Offset of field: StringInfo::CTop"][::core::mem::offset_of!(StringInfo, CTop) - 22usize];
    ["Offset of field: StringInfo::Extension"]
        [::core::mem::offset_of!(StringInfo, Extension) - 24usize];
    ["Offset of field: StringInfo::LongInt"]
        [::core::mem::offset_of!(StringInfo, LongInt) - 28usize];
    ["Offset of field: StringInfo::AltKeyMap"]
        [::core::mem::offset_of!(StringInfo, AltKeyMap) - 32usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct IntuiText {
    pub FrontPen: UBYTE,
    pub BackPen: UBYTE,
    pub DrawMode: UBYTE,
    pub LeftEdge: WORD,
    pub TopEdge: WORD,
    pub ITextFont: *const TextAttr,
    pub IText: STRPTR,
    pub NextText: *mut IntuiText,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IntuiText"][::core::mem::size_of::<IntuiText>() - 20usize];
    ["Alignment of IntuiText"][::core::mem::align_of::<IntuiText>() - 2usize];
    ["Offset of field: IntuiText::FrontPen"][::core::mem::offset_of!(IntuiText, FrontPen) - 0usize];
    ["Offset of field: IntuiText::BackPen"][::core::mem::offset_of!(IntuiText, BackPen) - 1usize];
    ["Offset of field: IntuiText::DrawMode"][::core::mem::offset_of!(IntuiText, DrawMode) - 2usize];
    ["Offset of field: IntuiText::LeftEdge"][::core::mem::offset_of!(IntuiText, LeftEdge) - 4usize];
    ["Offset of field: IntuiText::TopEdge"][::core::mem::offset_of!(IntuiText, TopEdge) - 6usize];
    ["Offset of field: IntuiText::ITextFont"]
        [::core::mem::offset_of!(IntuiText, ITextFont) - 8usize];
    ["Offset of field: IntuiText::IText"][::core::mem::offset_of!(IntuiText, IText) - 12usize];
    ["Offset of field: IntuiText::NextText"]
        [::core::mem::offset_of!(IntuiText, NextText) - 16usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct Border {
    pub LeftEdge: WORD,
    pub TopEdge: WORD,
    pub FrontPen: UBYTE,
    pub BackPen: UBYTE,
    pub DrawMode: UBYTE,
    pub Count: BYTE,
    pub XY: *mut WORD,
    pub NextBorder: *mut Border,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Border"][::core::mem::size_of::<Border>() - 16usize];
    ["Alignment of Border"][::core::mem::align_of::<Border>() - 2usize];
    ["Offset of field: Border::LeftEdge"][::core::mem::offset_of!(Border, LeftEdge) - 0usize];
    ["Offset of field: Border::TopEdge"][::core::mem::offset_of!(Border, TopEdge) - 2usize];
    ["Offset of field: Border::FrontPen"][::core::mem::offset_of!(Border, FrontPen) - 4usize];
    ["Offset of field: Border::BackPen"][::core::mem::offset_of!(Border, BackPen) - 5usize];
    ["Offset of field: Border::DrawMode"][::core::mem::offset_of!(Border, DrawMode) - 6usize];
    ["Offset of field: Border::Count"][::core::mem::offset_of!(Border, Count) - 7usize];
    ["Offset of field: Border::XY"][::core::mem::offset_of!(Border, XY) - 8usize];
    ["Offset of field: Border::NextBorder"][::core::mem::offset_of!(Border, NextBorder) - 12usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct Image {
    pub LeftEdge: WORD,
    pub TopEdge: WORD,
    pub Width: WORD,
    pub Height: WORD,
    pub Depth: WORD,
    pub ImageData: *mut UWORD,
    pub PlanePick: UBYTE,
    pub PlaneOnOff: UBYTE,
    pub NextImage: *mut Image,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Image"][::core::mem::size_of::<Image>() - 20usize];
    ["Alignment of Image"][::core::mem::align_of::<Image>() - 2usize];
    ["Offset of field: Image::LeftEdge"][::core::mem::offset_of!(Image, LeftEdge) - 0usize];
    ["Offset of field: Image::TopEdge"][::core::mem::offset_of!(Image, TopEdge) - 2usize];
    ["Offset of field: Image::Width"][::core::mem::offset_of!(Image, Width) - 4usize];
    ["Offset of field: Image::Height"][::core::mem::offset_of!(Image, Height) - 6usize];
    ["Offset of field: Image::Depth"][::core::mem::offset_of!(Image, Depth) - 8usize];
    ["Offset of field: Image::ImageData"][::core::mem::offset_of!(Image, ImageData) - 10usize];
    ["Offset of field: Image::PlanePick"][::core::mem::offset_of!(Image, PlanePick) - 14usize];
    ["Offset of field: Image::PlaneOnOff"][::core::mem::offset_of!(Image, PlaneOnOff) - 15usize];
    ["Offset of field: Image::NextImage"][::core::mem::offset_of!(Image, NextImage) - 16usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct IntuiMessage {
    pub ExecMessage: Message,
    pub Class: ULONG,
    pub Code: UWORD,
    pub Qualifier: UWORD,
    pub IAddress: APTR,
    pub MouseX: WORD,
    pub MouseY: WORD,
    pub Seconds: ULONG,
    pub Micros: ULONG,
    pub IDCMPWindow: *mut Window,
    pub SpecialLink: *mut IntuiMessage,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IntuiMessage"][::core::mem::size_of::<IntuiMessage>() - 52usize];
    ["Alignment of IntuiMessage"][::core::mem::align_of::<IntuiMessage>() - 2usize];
    ["Offset of field: IntuiMessage::ExecMessage"]
        [::core::mem::offset_of!(IntuiMessage, ExecMessage) - 0usize];
    ["Offset of field: IntuiMessage::Class"]
        [::core::mem::offset_of!(IntuiMessage, Class) - 20usize];
    ["Offset of field: IntuiMessage::Code"][::core::mem::offset_of!(IntuiMessage, Code) - 24usize];
    ["Offset of field: IntuiMessage::Qualifier"]
        [::core::mem::offset_of!(IntuiMessage, Qualifier) - 26usize];
    ["Offset of field: IntuiMessage::IAddress"]
        [::core::mem::offset_of!(IntuiMessage, IAddress) - 28usize];
    ["Offset of field: IntuiMessage::MouseX"]
        [::core::mem::offset_of!(IntuiMessage, MouseX) - 32usize];
    ["Offset of field: IntuiMessage::MouseY"]
        [::core::mem::offset_of!(IntuiMessage, MouseY) - 34usize];
    ["Offset of field: IntuiMessage::Seconds"]
        [::core::mem::offset_of!(IntuiMessage, Seconds) - 36usize];
    ["Offset of field: IntuiMessage::Micros"]
        [::core::mem::offset_of!(IntuiMessage, Micros) - 40usize];
    ["Offset of field: IntuiMessage::IDCMPWindow"]
        [::core::mem::offset_of!(IntuiMessage, IDCMPWindow) - 44usize];
    ["Offset of field: IntuiMessage::SpecialLink"]
        [::core::mem::offset_of!(IntuiMessage, SpecialLink) - 48usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct ExtIntuiMessage {
    pub eim_IntuiMessage: IntuiMessage,
    pub eim_TabletData: *mut TabletData,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ExtIntuiMessage"][::core::mem::size_of::<ExtIntuiMessage>() - 56usize];
    ["Alignment of ExtIntuiMessage"][::core::mem::align_of::<ExtIntuiMessage>() - 2usize];
    ["Offset of field: ExtIntuiMessage::eim_IntuiMessage"]
        [::core::mem::offset_of!(ExtIntuiMessage, eim_IntuiMessage) - 0usize];
    ["Offset of field: ExtIntuiMessage::eim_TabletData"]
        [::core::mem::offset_of!(ExtIntuiMessage, eim_TabletData) - 52usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct IntuiWheelData {
    pub Version: UWORD,
    pub Reserved: UWORD,
    pub WheelX: WORD,
    pub WheelY: WORD,
    pub HoveredGadget: *mut Gadget,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IntuiWheelData"][::core::mem::size_of::<IntuiWheelData>() - 12usize];
    ["Alignment of IntuiWheelData"][::core::mem::align_of::<IntuiWheelData>() - 2usize];
    ["Offset of field: IntuiWheelData::Version"]
        [::core::mem::offset_of!(IntuiWheelData, Version) - 0usize];
    ["Offset of field: IntuiWheelData::Reserved"]
        [::core::mem::offset_of!(IntuiWheelData, Reserved) - 2usize];
    ["Offset of field: IntuiWheelData::WheelX"]
        [::core::mem::offset_of!(IntuiWheelData, WheelX) - 4usize];
    ["Offset of field: IntuiWheelData::WheelY"]
        [::core::mem::offset_of!(IntuiWheelData, WheelY) - 6usize];
    ["Offset of field: IntuiWheelData::HoveredGadget"]
        [::core::mem::offset_of!(IntuiWheelData, HoveredGadget) - 8usize];
};
pub const IMSGCODE_INTUIWHEELDATA: _bindgen_ty_3 = 32768;
pub const IMSGCODE_INTUIRAWKEYDATA: _bindgen_ty_3 = 16384;
pub const IMSGCODE_INTUIWHEELDATAREJECT: _bindgen_ty_3 = 8192;
pub type _bindgen_ty_3 = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IBox {
    pub Left: WORD,
    pub Top: WORD,
    pub Width: WORD,
    pub Height: WORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IBox"][::core::mem::size_of::<IBox>() - 8usize];
    ["Alignment of IBox"][::core::mem::align_of::<IBox>() - 2usize];
    ["Offset of field: IBox::Left"][::core::mem::offset_of!(IBox, Left) - 0usize];
    ["Offset of field: IBox::Top"][::core::mem::offset_of!(IBox, Top) - 2usize];
    ["Offset of field: IBox::Width"][::core::mem::offset_of!(IBox, Width) - 4usize];
    ["Offset of field: IBox::Height"][::core::mem::offset_of!(IBox, Height) - 6usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct Window {
    pub NextWindow: *mut Window,
    pub LeftEdge: WORD,
    pub TopEdge: WORD,
    pub Width: WORD,
    pub Height: WORD,
    pub MouseY: WORD,
    pub MouseX: WORD,
    pub MinWidth: WORD,
    pub MinHeight: WORD,
    pub MaxWidth: UWORD,
    pub MaxHeight: UWORD,
    pub Flags: ULONG,
    pub MenuStrip: *mut Menu,
    pub Title: STRPTR,
    pub FirstRequest: *mut Requester,
    pub DMRequest: *mut Requester,
    pub ReqCount: WORD,
    pub WScreen: *mut Screen,
    pub RPort: *mut RastPort,
    pub BorderLeft: BYTE,
    pub BorderTop: BYTE,
    pub BorderRight: BYTE,
    pub BorderBottom: BYTE,
    pub BorderRPort: *mut RastPort,
    pub FirstGadget: *mut Gadget,
    pub Parent: *mut Window,
    pub Descendant: *mut Window,
    pub Pointer: *mut UWORD,
    pub PtrHeight: BYTE,
    pub PtrWidth: BYTE,
    pub XOffset: BYTE,
    pub YOffset: BYTE,
    pub IDCMPFlags: ULONG,
    pub UserPort: *mut MsgPort,
    pub WindowPort: *mut MsgPort,
    pub MessageKey: *mut IntuiMessage,
    pub DetailPen: UBYTE,
    pub BlockPen: UBYTE,
    pub CheckMark: *mut Image,
    pub ScreenTitle: STRPTR,
    pub GZZMouseX: WORD,
    pub GZZMouseY: WORD,
    pub GZZWidth: WORD,
    pub GZZHeight: WORD,
    pub ExtData: *mut UBYTE,
    pub UserData: *mut BYTE,
    pub WLayer: *mut Layer,
    pub IFont: *mut TextFont,
    pub MoreFlags: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Window"][::core::mem::size_of::<Window>() - 136usize];
    ["Alignment of Window"][::core::mem::align_of::<Window>() - 2usize];
    ["Offset of field: Window::NextWindow"][::core::mem::offset_of!(Window, NextWindow) - 0usize];
    ["Offset of field: Window::LeftEdge"][::core::mem::offset_of!(Window, LeftEdge) - 4usize];
    ["Offset of field: Window::TopEdge"][::core::mem::offset_of!(Window, TopEdge) - 6usize];
    ["Offset of field: Window::Width"][::core::mem::offset_of!(Window, Width) - 8usize];
    ["Offset of field: Window::Height"][::core::mem::offset_of!(Window, Height) - 10usize];
    ["Offset of field: Window::MouseY"][::core::mem::offset_of!(Window, MouseY) - 12usize];
    ["Offset of field: Window::MouseX"][::core::mem::offset_of!(Window, MouseX) - 14usize];
    ["Offset of field: Window::MinWidth"][::core::mem::offset_of!(Window, MinWidth) - 16usize];
    ["Offset of field: Window::MinHeight"][::core::mem::offset_of!(Window, MinHeight) - 18usize];
    ["Offset of field: Window::MaxWidth"][::core::mem::offset_of!(Window, MaxWidth) - 20usize];
    ["Offset of field: Window::MaxHeight"][::core::mem::offset_of!(Window, MaxHeight) - 22usize];
    ["Offset of field: Window::Flags"][::core::mem::offset_of!(Window, Flags) - 24usize];
    ["Offset of field: Window::MenuStrip"][::core::mem::offset_of!(Window, MenuStrip) - 28usize];
    ["Offset of field: Window::Title"][::core::mem::offset_of!(Window, Title) - 32usize];
    ["Offset of field: Window::FirstRequest"]
        [::core::mem::offset_of!(Window, FirstRequest) - 36usize];
    ["Offset of field: Window::DMRequest"][::core::mem::offset_of!(Window, DMRequest) - 40usize];
    ["Offset of field: Window::ReqCount"][::core::mem::offset_of!(Window, ReqCount) - 44usize];
    ["Offset of field: Window::WScreen"][::core::mem::offset_of!(Window, WScreen) - 46usize];
    ["Offset of field: Window::RPort"][::core::mem::offset_of!(Window, RPort) - 50usize];
    ["Offset of field: Window::BorderLeft"][::core::mem::offset_of!(Window, BorderLeft) - 54usize];
    ["Offset of field: Window::BorderTop"][::core::mem::offset_of!(Window, BorderTop) - 55usize];
    ["Offset of field: Window::BorderRight"]
        [::core::mem::offset_of!(Window, BorderRight) - 56usize];
    ["Offset of field: Window::BorderBottom"]
        [::core::mem::offset_of!(Window, BorderBottom) - 57usize];
    ["Offset of field: Window::BorderRPort"]
        [::core::mem::offset_of!(Window, BorderRPort) - 58usize];
    ["Offset of field: Window::FirstGadget"]
        [::core::mem::offset_of!(Window, FirstGadget) - 62usize];
    ["Offset of field: Window::Parent"][::core::mem::offset_of!(Window, Parent) - 66usize];
    ["Offset of field: Window::Descendant"][::core::mem::offset_of!(Window, Descendant) - 70usize];
    ["Offset of field: Window::Pointer"][::core::mem::offset_of!(Window, Pointer) - 74usize];
    ["Offset of field: Window::PtrHeight"][::core::mem::offset_of!(Window, PtrHeight) - 78usize];
    ["Offset of field: Window::PtrWidth"][::core::mem::offset_of!(Window, PtrWidth) - 79usize];
    ["Offset of field: Window::XOffset"][::core::mem::offset_of!(Window, XOffset) - 80usize];
    ["Offset of field: Window::YOffset"][::core::mem::offset_of!(Window, YOffset) - 81usize];
    ["Offset of field: Window::IDCMPFlags"][::core::mem::offset_of!(Window, IDCMPFlags) - 82usize];
    ["Offset of field: Window::UserPort"][::core::mem::offset_of!(Window, UserPort) - 86usize];
    ["Offset of field: Window::WindowPort"][::core::mem::offset_of!(Window, WindowPort) - 90usize];
    ["Offset of field: Window::MessageKey"][::core::mem::offset_of!(Window, MessageKey) - 94usize];
    ["Offset of field: Window::DetailPen"][::core::mem::offset_of!(Window, DetailPen) - 98usize];
    ["Offset of field: Window::BlockPen"][::core::mem::offset_of!(Window, BlockPen) - 99usize];
    ["Offset of field: Window::CheckMark"][::core::mem::offset_of!(Window, CheckMark) - 100usize];
    ["Offset of field: Window::ScreenTitle"]
        [::core::mem::offset_of!(Window, ScreenTitle) - 104usize];
    ["Offset of field: Window::GZZMouseX"][::core::mem::offset_of!(Window, GZZMouseX) - 108usize];
    ["Offset of field: Window::GZZMouseY"][::core::mem::offset_of!(Window, GZZMouseY) - 110usize];
    ["Offset of field: Window::GZZWidth"][::core::mem::offset_of!(Window, GZZWidth) - 112usize];
    ["Offset of field: Window::GZZHeight"][::core::mem::offset_of!(Window, GZZHeight) - 114usize];
    ["Offset of field: Window::ExtData"][::core::mem::offset_of!(Window, ExtData) - 116usize];
    ["Offset of field: Window::UserData"][::core::mem::offset_of!(Window, UserData) - 120usize];
    ["Offset of field: Window::WLayer"][::core::mem::offset_of!(Window, WLayer) - 124usize];
    ["Offset of field: Window::IFont"][::core::mem::offset_of!(Window, IFont) - 128usize];
    ["Offset of field: Window::MoreFlags"][::core::mem::offset_of!(Window, MoreFlags) - 132usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct NewWindow {
    pub LeftEdge: WORD,
    pub TopEdge: WORD,
    pub Width: WORD,
    pub Height: WORD,
    pub DetailPen: UBYTE,
    pub BlockPen: UBYTE,
    pub IDCMPFlags: ULONG,
    pub Flags: ULONG,
    pub FirstGadget: *mut Gadget,
    pub CheckMark: *mut Image,
    pub Title: STRPTR,
    pub Screen: *mut Screen,
    pub BitMap: *mut BitMap,
    pub MinWidth: WORD,
    pub MinHeight: WORD,
    pub MaxWidth: UWORD,
    pub MaxHeight: UWORD,
    pub Type: UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NewWindow"][::core::mem::size_of::<NewWindow>() - 48usize];
    ["Alignment of NewWindow"][::core::mem::align_of::<NewWindow>() - 2usize];
    ["Offset of field: NewWindow::LeftEdge"][::core::mem::offset_of!(NewWindow, LeftEdge) - 0usize];
    ["Offset of field: NewWindow::TopEdge"][::core::mem::offset_of!(NewWindow, TopEdge) - 2usize];
    ["Offset of field: NewWindow::Width"][::core::mem::offset_of!(NewWindow, Width) - 4usize];
    ["Offset of field: NewWindow::Height"][::core::mem::offset_of!(NewWindow, Height) - 6usize];
    ["Offset of field: NewWindow::DetailPen"]
        [::core::mem::offset_of!(NewWindow, DetailPen) - 8usize];
    ["Offset of field: NewWindow::BlockPen"][::core::mem::offset_of!(NewWindow, BlockPen) - 9usize];
    ["Offset of field: NewWindow::IDCMPFlags"]
        [::core::mem::offset_of!(NewWindow, IDCMPFlags) - 10usize];
    ["Offset of field: NewWindow::Flags"][::core::mem::offset_of!(NewWindow, Flags) - 14usize];
    ["Offset of field: NewWindow::FirstGadget"]
        [::core::mem::offset_of!(NewWindow, FirstGadget) - 18usize];
    ["Offset of field: NewWindow::CheckMark"]
        [::core::mem::offset_of!(NewWindow, CheckMark) - 22usize];
    ["Offset of field: NewWindow::Title"][::core::mem::offset_of!(NewWindow, Title) - 26usize];
    ["Offset of field: NewWindow::Screen"][::core::mem::offset_of!(NewWindow, Screen) - 30usize];
    ["Offset of field: NewWindow::BitMap"][::core::mem::offset_of!(NewWindow, BitMap) - 34usize];
    ["Offset of field: NewWindow::MinWidth"]
        [::core::mem::offset_of!(NewWindow, MinWidth) - 38usize];
    ["Offset of field: NewWindow::MinHeight"]
        [::core::mem::offset_of!(NewWindow, MinHeight) - 40usize];
    ["Offset of field: NewWindow::MaxWidth"]
        [::core::mem::offset_of!(NewWindow, MaxWidth) - 42usize];
    ["Offset of field: NewWindow::MaxHeight"]
        [::core::mem::offset_of!(NewWindow, MaxHeight) - 44usize];
    ["Offset of field: NewWindow::Type"][::core::mem::offset_of!(NewWindow, Type) - 46usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct ExtNewWindow {
    pub LeftEdge: WORD,
    pub TopEdge: WORD,
    pub Width: WORD,
    pub Height: WORD,
    pub DetailPen: UBYTE,
    pub BlockPen: UBYTE,
    pub IDCMPFlags: ULONG,
    pub Flags: ULONG,
    pub FirstGadget: *mut Gadget,
    pub CheckMark: *mut Image,
    pub Title: STRPTR,
    pub Screen: *mut Screen,
    pub BitMap: *mut BitMap,
    pub MinWidth: WORD,
    pub MinHeight: WORD,
    pub MaxWidth: UWORD,
    pub MaxHeight: UWORD,
    pub Type: UWORD,
    pub Extension: *mut TagItem,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ExtNewWindow"][::core::mem::size_of::<ExtNewWindow>() - 52usize];
    ["Alignment of ExtNewWindow"][::core::mem::align_of::<ExtNewWindow>() - 2usize];
    ["Offset of field: ExtNewWindow::LeftEdge"]
        [::core::mem::offset_of!(ExtNewWindow, LeftEdge) - 0usize];
    ["Offset of field: ExtNewWindow::TopEdge"]
        [::core::mem::offset_of!(ExtNewWindow, TopEdge) - 2usize];
    ["Offset of field: ExtNewWindow::Width"][::core::mem::offset_of!(ExtNewWindow, Width) - 4usize];
    ["Offset of field: ExtNewWindow::Height"]
        [::core::mem::offset_of!(ExtNewWindow, Height) - 6usize];
    ["Offset of field: ExtNewWindow::DetailPen"]
        [::core::mem::offset_of!(ExtNewWindow, DetailPen) - 8usize];
    ["Offset of field: ExtNewWindow::BlockPen"]
        [::core::mem::offset_of!(ExtNewWindow, BlockPen) - 9usize];
    ["Offset of field: ExtNewWindow::IDCMPFlags"]
        [::core::mem::offset_of!(ExtNewWindow, IDCMPFlags) - 10usize];
    ["Offset of field: ExtNewWindow::Flags"]
        [::core::mem::offset_of!(ExtNewWindow, Flags) - 14usize];
    ["Offset of field: ExtNewWindow::FirstGadget"]
        [::core::mem::offset_of!(ExtNewWindow, FirstGadget) - 18usize];
    ["Offset of field: ExtNewWindow::CheckMark"]
        [::core::mem::offset_of!(ExtNewWindow, CheckMark) - 22usize];
    ["Offset of field: ExtNewWindow::Title"]
        [::core::mem::offset_of!(ExtNewWindow, Title) - 26usize];
    ["Offset of field: ExtNewWindow::Screen"]
        [::core::mem::offset_of!(ExtNewWindow, Screen) - 30usize];
    ["Offset of field: ExtNewWindow::BitMap"]
        [::core::mem::offset_of!(ExtNewWindow, BitMap) - 34usize];
    ["Offset of field: ExtNewWindow::MinWidth"]
        [::core::mem::offset_of!(ExtNewWindow, MinWidth) - 38usize];
    ["Offset of field: ExtNewWindow::MinHeight"]
        [::core::mem::offset_of!(ExtNewWindow, MinHeight) - 40usize];
    ["Offset of field: ExtNewWindow::MaxWidth"]
        [::core::mem::offset_of!(ExtNewWindow, MaxWidth) - 42usize];
    ["Offset of field: ExtNewWindow::MaxHeight"]
        [::core::mem::offset_of!(ExtNewWindow, MaxHeight) - 44usize];
    ["Offset of field: ExtNewWindow::Type"][::core::mem::offset_of!(ExtNewWindow, Type) - 46usize];
    ["Offset of field: ExtNewWindow::Extension"]
        [::core::mem::offset_of!(ExtNewWindow, Extension) - 48usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct DrawInfo {
    pub dri_Version: UWORD,
    pub dri_NumPens: UWORD,
    pub dri_Pens: *mut UWORD,
    pub dri_Font: *mut TextFont,
    pub dri_Depth: UWORD,
    pub dri_Resolution: DrawInfo__bindgen_ty_1,
    pub dri_Flags: ULONG,
    pub dri_CheckMark: *mut Image,
    pub dri_AmigaKey: *mut Image,
    pub dri_Screen: *mut Screen,
    pub dri_Reserved: [ULONG; 4usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DrawInfo__bindgen_ty_1 {
    pub X: UWORD,
    pub Y: UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DrawInfo__bindgen_ty_1"][::core::mem::size_of::<DrawInfo__bindgen_ty_1>() - 4usize];
    ["Alignment of DrawInfo__bindgen_ty_1"]
        [::core::mem::align_of::<DrawInfo__bindgen_ty_1>() - 2usize];
    ["Offset of field: DrawInfo__bindgen_ty_1::X"]
        [::core::mem::offset_of!(DrawInfo__bindgen_ty_1, X) - 0usize];
    ["Offset of field: DrawInfo__bindgen_ty_1::Y"]
        [::core::mem::offset_of!(DrawInfo__bindgen_ty_1, Y) - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DrawInfo"][::core::mem::size_of::<DrawInfo>() - 50usize];
    ["Alignment of DrawInfo"][::core::mem::align_of::<DrawInfo>() - 2usize];
    ["Offset of field: DrawInfo::dri_Version"]
        [::core::mem::offset_of!(DrawInfo, dri_Version) - 0usize];
    ["Offset of field: DrawInfo::dri_NumPens"]
        [::core::mem::offset_of!(DrawInfo, dri_NumPens) - 2usize];
    ["Offset of field: DrawInfo::dri_Pens"][::core::mem::offset_of!(DrawInfo, dri_Pens) - 4usize];
    ["Offset of field: DrawInfo::dri_Font"][::core::mem::offset_of!(DrawInfo, dri_Font) - 8usize];
    ["Offset of field: DrawInfo::dri_Depth"]
        [::core::mem::offset_of!(DrawInfo, dri_Depth) - 12usize];
    ["Offset of field: DrawInfo::dri_Resolution"]
        [::core::mem::offset_of!(DrawInfo, dri_Resolution) - 14usize];
    ["Offset of field: DrawInfo::dri_Flags"]
        [::core::mem::offset_of!(DrawInfo, dri_Flags) - 18usize];
    ["Offset of field: DrawInfo::dri_CheckMark"]
        [::core::mem::offset_of!(DrawInfo, dri_CheckMark) - 22usize];
    ["Offset of field: DrawInfo::dri_AmigaKey"]
        [::core::mem::offset_of!(DrawInfo, dri_AmigaKey) - 26usize];
    ["Offset of field: DrawInfo::dri_Screen"]
        [::core::mem::offset_of!(DrawInfo, dri_Screen) - 30usize];
    ["Offset of field: DrawInfo::dri_Reserved"]
        [::core::mem::offset_of!(DrawInfo, dri_Reserved) - 34usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct Screen {
    pub NextScreen: *mut Screen,
    pub FirstWindow: *mut Window,
    pub LeftEdge: WORD,
    pub TopEdge: WORD,
    pub Width: WORD,
    pub Height: WORD,
    pub MouseY: WORD,
    pub MouseX: WORD,
    pub Flags: UWORD,
    pub Title: STRPTR,
    pub DefaultTitle: STRPTR,
    pub BarHeight: BYTE,
    pub BarVBorder: BYTE,
    pub BarHBorder: BYTE,
    pub MenuVBorder: BYTE,
    pub MenuHBorder: BYTE,
    pub WBorTop: BYTE,
    pub WBorLeft: BYTE,
    pub WBorRight: BYTE,
    pub WBorBottom: BYTE,
    pub Font: *mut TextAttr,
    pub ViewPort: ViewPort,
    pub RastPort: RastPort,
    pub BitMap: BitMap,
    pub LayerInfo: Layer_Info,
    pub FirstGadget: *mut Gadget,
    pub DetailPen: UBYTE,
    pub BlockPen: UBYTE,
    pub SaveColor0: UWORD,
    pub BarLayer: *mut Layer,
    pub ExtData: *mut UBYTE,
    pub UserData: *mut UBYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Screen"][::core::mem::size_of::<Screen>() - 346usize];
    ["Alignment of Screen"][::core::mem::align_of::<Screen>() - 2usize];
    ["Offset of field: Screen::NextScreen"][::core::mem::offset_of!(Screen, NextScreen) - 0usize];
    ["Offset of field: Screen::FirstWindow"][::core::mem::offset_of!(Screen, FirstWindow) - 4usize];
    ["Offset of field: Screen::LeftEdge"][::core::mem::offset_of!(Screen, LeftEdge) - 8usize];
    ["Offset of field: Screen::TopEdge"][::core::mem::offset_of!(Screen, TopEdge) - 10usize];
    ["Offset of field: Screen::Width"][::core::mem::offset_of!(Screen, Width) - 12usize];
    ["Offset of field: Screen::Height"][::core::mem::offset_of!(Screen, Height) - 14usize];
    ["Offset of field: Screen::MouseY"][::core::mem::offset_of!(Screen, MouseY) - 16usize];
    ["Offset of field: Screen::MouseX"][::core::mem::offset_of!(Screen, MouseX) - 18usize];
    ["Offset of field: Screen::Flags"][::core::mem::offset_of!(Screen, Flags) - 20usize];
    ["Offset of field: Screen::Title"][::core::mem::offset_of!(Screen, Title) - 22usize];
    ["Offset of field: Screen::DefaultTitle"]
        [::core::mem::offset_of!(Screen, DefaultTitle) - 26usize];
    ["Offset of field: Screen::BarHeight"][::core::mem::offset_of!(Screen, BarHeight) - 30usize];
    ["Offset of field: Screen::BarVBorder"][::core::mem::offset_of!(Screen, BarVBorder) - 31usize];
    ["Offset of field: Screen::BarHBorder"][::core::mem::offset_of!(Screen, BarHBorder) - 32usize];
    ["Offset of field: Screen::MenuVBorder"]
        [::core::mem::offset_of!(Screen, MenuVBorder) - 33usize];
    ["Offset of field: Screen::MenuHBorder"]
        [::core::mem::offset_of!(Screen, MenuHBorder) - 34usize];
    ["Offset of field: Screen::WBorTop"][::core::mem::offset_of!(Screen, WBorTop) - 35usize];
    ["Offset of field: Screen::WBorLeft"][::core::mem::offset_of!(Screen, WBorLeft) - 36usize];
    ["Offset of field: Screen::WBorRight"][::core::mem::offset_of!(Screen, WBorRight) - 37usize];
    ["Offset of field: Screen::WBorBottom"][::core::mem::offset_of!(Screen, WBorBottom) - 38usize];
    ["Offset of field: Screen::Font"][::core::mem::offset_of!(Screen, Font) - 40usize];
    ["Offset of field: Screen::ViewPort"][::core::mem::offset_of!(Screen, ViewPort) - 44usize];
    ["Offset of field: Screen::RastPort"][::core::mem::offset_of!(Screen, RastPort) - 84usize];
    ["Offset of field: Screen::BitMap"][::core::mem::offset_of!(Screen, BitMap) - 184usize];
    ["Offset of field: Screen::LayerInfo"][::core::mem::offset_of!(Screen, LayerInfo) - 224usize];
    ["Offset of field: Screen::FirstGadget"]
        [::core::mem::offset_of!(Screen, FirstGadget) - 326usize];
    ["Offset of field: Screen::DetailPen"][::core::mem::offset_of!(Screen, DetailPen) - 330usize];
    ["Offset of field: Screen::BlockPen"][::core::mem::offset_of!(Screen, BlockPen) - 331usize];
    ["Offset of field: Screen::SaveColor0"][::core::mem::offset_of!(Screen, SaveColor0) - 332usize];
    ["Offset of field: Screen::BarLayer"][::core::mem::offset_of!(Screen, BarLayer) - 334usize];
    ["Offset of field: Screen::ExtData"][::core::mem::offset_of!(Screen, ExtData) - 338usize];
    ["Offset of field: Screen::UserData"][::core::mem::offset_of!(Screen, UserData) - 342usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct NewScreen {
    pub LeftEdge: WORD,
    pub TopEdge: WORD,
    pub Width: WORD,
    pub Height: WORD,
    pub Depth: WORD,
    pub DetailPen: UBYTE,
    pub BlockPen: UBYTE,
    pub ViewModes: UWORD,
    pub Type: UWORD,
    pub Font: *mut TextAttr,
    pub DefaultTitle: STRPTR,
    pub Gadgets: *mut Gadget,
    pub CustomBitMap: *mut BitMap,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NewScreen"][::core::mem::size_of::<NewScreen>() - 32usize];
    ["Alignment of NewScreen"][::core::mem::align_of::<NewScreen>() - 2usize];
    ["Offset of field: NewScreen::LeftEdge"][::core::mem::offset_of!(NewScreen, LeftEdge) - 0usize];
    ["Offset of field: NewScreen::TopEdge"][::core::mem::offset_of!(NewScreen, TopEdge) - 2usize];
    ["Offset of field: NewScreen::Width"][::core::mem::offset_of!(NewScreen, Width) - 4usize];
    ["Offset of field: NewScreen::Height"][::core::mem::offset_of!(NewScreen, Height) - 6usize];
    ["Offset of field: NewScreen::Depth"][::core::mem::offset_of!(NewScreen, Depth) - 8usize];
    ["Offset of field: NewScreen::DetailPen"]
        [::core::mem::offset_of!(NewScreen, DetailPen) - 10usize];
    ["Offset of field: NewScreen::BlockPen"]
        [::core::mem::offset_of!(NewScreen, BlockPen) - 11usize];
    ["Offset of field: NewScreen::ViewModes"]
        [::core::mem::offset_of!(NewScreen, ViewModes) - 12usize];
    ["Offset of field: NewScreen::Type"][::core::mem::offset_of!(NewScreen, Type) - 14usize];
    ["Offset of field: NewScreen::Font"][::core::mem::offset_of!(NewScreen, Font) - 16usize];
    ["Offset of field: NewScreen::DefaultTitle"]
        [::core::mem::offset_of!(NewScreen, DefaultTitle) - 20usize];
    ["Offset of field: NewScreen::Gadgets"][::core::mem::offset_of!(NewScreen, Gadgets) - 24usize];
    ["Offset of field: NewScreen::CustomBitMap"]
        [::core::mem::offset_of!(NewScreen, CustomBitMap) - 28usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct ExtNewScreen {
    pub LeftEdge: WORD,
    pub TopEdge: WORD,
    pub Width: WORD,
    pub Height: WORD,
    pub Depth: WORD,
    pub DetailPen: UBYTE,
    pub BlockPen: UBYTE,
    pub ViewModes: UWORD,
    pub Type: UWORD,
    pub Font: *mut TextAttr,
    pub DefaultTitle: STRPTR,
    pub Gadgets: *mut Gadget,
    pub CustomBitMap: *mut BitMap,
    pub Extension: *mut TagItem,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ExtNewScreen"][::core::mem::size_of::<ExtNewScreen>() - 36usize];
    ["Alignment of ExtNewScreen"][::core::mem::align_of::<ExtNewScreen>() - 2usize];
    ["Offset of field: ExtNewScreen::LeftEdge"]
        [::core::mem::offset_of!(ExtNewScreen, LeftEdge) - 0usize];
    ["Offset of field: ExtNewScreen::TopEdge"]
        [::core::mem::offset_of!(ExtNewScreen, TopEdge) - 2usize];
    ["Offset of field: ExtNewScreen::Width"][::core::mem::offset_of!(ExtNewScreen, Width) - 4usize];
    ["Offset of field: ExtNewScreen::Height"]
        [::core::mem::offset_of!(ExtNewScreen, Height) - 6usize];
    ["Offset of field: ExtNewScreen::Depth"][::core::mem::offset_of!(ExtNewScreen, Depth) - 8usize];
    ["Offset of field: ExtNewScreen::DetailPen"]
        [::core::mem::offset_of!(ExtNewScreen, DetailPen) - 10usize];
    ["Offset of field: ExtNewScreen::BlockPen"]
        [::core::mem::offset_of!(ExtNewScreen, BlockPen) - 11usize];
    ["Offset of field: ExtNewScreen::ViewModes"]
        [::core::mem::offset_of!(ExtNewScreen, ViewModes) - 12usize];
    ["Offset of field: ExtNewScreen::Type"][::core::mem::offset_of!(ExtNewScreen, Type) - 14usize];
    ["Offset of field: ExtNewScreen::Font"][::core::mem::offset_of!(ExtNewScreen, Font) - 16usize];
    ["Offset of field: ExtNewScreen::DefaultTitle"]
        [::core::mem::offset_of!(ExtNewScreen, DefaultTitle) - 20usize];
    ["Offset of field: ExtNewScreen::Gadgets"]
        [::core::mem::offset_of!(ExtNewScreen, Gadgets) - 24usize];
    ["Offset of field: ExtNewScreen::CustomBitMap"]
        [::core::mem::offset_of!(ExtNewScreen, CustomBitMap) - 28usize];
    ["Offset of field: ExtNewScreen::Extension"]
        [::core::mem::offset_of!(ExtNewScreen, Extension) - 32usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct PubScreenNode {
    pub psn_Node: Node,
    pub psn_Screen: *mut Screen,
    pub psn_Flags: UWORD,
    pub psn_Size: WORD,
    pub psn_VisitorCount: WORD,
    pub psn_SigTask: *mut Task,
    pub psn_SigBit: UBYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PubScreenNode"][::core::mem::size_of::<PubScreenNode>() - 30usize];
    ["Alignment of PubScreenNode"][::core::mem::align_of::<PubScreenNode>() - 2usize];
    ["Offset of field: PubScreenNode::psn_Node"]
        [::core::mem::offset_of!(PubScreenNode, psn_Node) - 0usize];
    ["Offset of field: PubScreenNode::psn_Screen"]
        [::core::mem::offset_of!(PubScreenNode, psn_Screen) - 14usize];
    ["Offset of field: PubScreenNode::psn_Flags"]
        [::core::mem::offset_of!(PubScreenNode, psn_Flags) - 18usize];
    ["Offset of field: PubScreenNode::psn_Size"]
        [::core::mem::offset_of!(PubScreenNode, psn_Size) - 20usize];
    ["Offset of field: PubScreenNode::psn_VisitorCount"]
        [::core::mem::offset_of!(PubScreenNode, psn_VisitorCount) - 22usize];
    ["Offset of field: PubScreenNode::psn_SigTask"]
        [::core::mem::offset_of!(PubScreenNode, psn_SigTask) - 24usize];
    ["Offset of field: PubScreenNode::psn_SigBit"]
        [::core::mem::offset_of!(PubScreenNode, psn_SigBit) - 28usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct ScreenBuffer {
    pub sb_BitMap: *mut BitMap,
    pub sb_DBufInfo: *mut DBufInfo,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScreenBuffer"][::core::mem::size_of::<ScreenBuffer>() - 8usize];
    ["Alignment of ScreenBuffer"][::core::mem::align_of::<ScreenBuffer>() - 2usize];
    ["Offset of field: ScreenBuffer::sb_BitMap"]
        [::core::mem::offset_of!(ScreenBuffer, sb_BitMap) - 0usize];
    ["Offset of field: ScreenBuffer::sb_DBufInfo"]
        [::core::mem::offset_of!(ScreenBuffer, sb_DBufInfo) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Preferences {
    pub FontHeight: BYTE,
    pub PrinterPort: UBYTE,
    pub BaudRate: UWORD,
    pub KeyRptSpeed: TimeVal_Type,
    pub KeyRptDelay: TimeVal_Type,
    pub DoubleClick: TimeVal_Type,
    pub PointerMatrix: [UWORD; 36usize],
    pub XOffset: BYTE,
    pub YOffset: BYTE,
    pub color17: UWORD,
    pub color18: UWORD,
    pub color19: UWORD,
    pub PointerTicks: UWORD,
    pub color0: UWORD,
    pub color1: UWORD,
    pub color2: UWORD,
    pub color3: UWORD,
    pub ViewXOffset: BYTE,
    pub ViewYOffset: BYTE,
    pub ViewInitX: WORD,
    pub ViewInitY: WORD,
    pub EnableCLI: BOOL,
    pub PrinterType: UWORD,
    pub PrinterFilename: [TEXT; 30usize],
    pub PrintPitch: UWORD,
    pub PrintQuality: UWORD,
    pub PrintSpacing: UWORD,
    pub PrintLeftMargin: UWORD,
    pub PrintRightMargin: UWORD,
    pub PrintImage: UWORD,
    pub PrintAspect: UWORD,
    pub PrintShade: UWORD,
    pub PrintThreshold: WORD,
    pub PaperSize: UWORD,
    pub PaperLength: UWORD,
    pub PaperType: UWORD,
    pub SerRWBits: UBYTE,
    pub SerStopBuf: UBYTE,
    pub SerParShk: UBYTE,
    pub LaceWB: UBYTE,
    pub Pad: [UBYTE; 12usize],
    pub PrtDevName: [TEXT; 16usize],
    pub DefaultPrtUnit: UBYTE,
    pub DefaultSerUnit: UBYTE,
    pub RowSizeChange: BYTE,
    pub ColumnSizeChange: BYTE,
    pub PrintFlags: UWORD,
    pub PrintMaxWidth: UWORD,
    pub PrintMaxHeight: UWORD,
    pub PrintDensity: UBYTE,
    pub PrintXOffset: UBYTE,
    pub wb_Width: UWORD,
    pub wb_Height: UWORD,
    pub wb_Depth: UBYTE,
    pub ext_size: UBYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Preferences"][::core::mem::size_of::<Preferences>() - 232usize];
    ["Alignment of Preferences"][::core::mem::align_of::<Preferences>() - 2usize];
    ["Offset of field: Preferences::FontHeight"]
        [::core::mem::offset_of!(Preferences, FontHeight) - 0usize];
    ["Offset of field: Preferences::PrinterPort"]
        [::core::mem::offset_of!(Preferences, PrinterPort) - 1usize];
    ["Offset of field: Preferences::BaudRate"]
        [::core::mem::offset_of!(Preferences, BaudRate) - 2usize];
    ["Offset of field: Preferences::KeyRptSpeed"]
        [::core::mem::offset_of!(Preferences, KeyRptSpeed) - 4usize];
    ["Offset of field: Preferences::KeyRptDelay"]
        [::core::mem::offset_of!(Preferences, KeyRptDelay) - 12usize];
    ["Offset of field: Preferences::DoubleClick"]
        [::core::mem::offset_of!(Preferences, DoubleClick) - 20usize];
    ["Offset of field: Preferences::PointerMatrix"]
        [::core::mem::offset_of!(Preferences, PointerMatrix) - 28usize];
    ["Offset of field: Preferences::XOffset"]
        [::core::mem::offset_of!(Preferences, XOffset) - 100usize];
    ["Offset of field: Preferences::YOffset"]
        [::core::mem::offset_of!(Preferences, YOffset) - 101usize];
    ["Offset of field: Preferences::color17"]
        [::core::mem::offset_of!(Preferences, color17) - 102usize];
    ["Offset of field: Preferences::color18"]
        [::core::mem::offset_of!(Preferences, color18) - 104usize];
    ["Offset of field: Preferences::color19"]
        [::core::mem::offset_of!(Preferences, color19) - 106usize];
    ["Offset of field: Preferences::PointerTicks"]
        [::core::mem::offset_of!(Preferences, PointerTicks) - 108usize];
    ["Offset of field: Preferences::color0"]
        [::core::mem::offset_of!(Preferences, color0) - 110usize];
    ["Offset of field: Preferences::color1"]
        [::core::mem::offset_of!(Preferences, color1) - 112usize];
    ["Offset of field: Preferences::color2"]
        [::core::mem::offset_of!(Preferences, color2) - 114usize];
    ["Offset of field: Preferences::color3"]
        [::core::mem::offset_of!(Preferences, color3) - 116usize];
    ["Offset of field: Preferences::ViewXOffset"]
        [::core::mem::offset_of!(Preferences, ViewXOffset) - 118usize];
    ["Offset of field: Preferences::ViewYOffset"]
        [::core::mem::offset_of!(Preferences, ViewYOffset) - 119usize];
    ["Offset of field: Preferences::ViewInitX"]
        [::core::mem::offset_of!(Preferences, ViewInitX) - 120usize];
    ["Offset of field: Preferences::ViewInitY"]
        [::core::mem::offset_of!(Preferences, ViewInitY) - 122usize];
    ["Offset of field: Preferences::EnableCLI"]
        [::core::mem::offset_of!(Preferences, EnableCLI) - 124usize];
    ["Offset of field: Preferences::PrinterType"]
        [::core::mem::offset_of!(Preferences, PrinterType) - 126usize];
    ["Offset of field: Preferences::PrinterFilename"]
        [::core::mem::offset_of!(Preferences, PrinterFilename) - 128usize];
    ["Offset of field: Preferences::PrintPitch"]
        [::core::mem::offset_of!(Preferences, PrintPitch) - 158usize];
    ["Offset of field: Preferences::PrintQuality"]
        [::core::mem::offset_of!(Preferences, PrintQuality) - 160usize];
    ["Offset of field: Preferences::PrintSpacing"]
        [::core::mem::offset_of!(Preferences, PrintSpacing) - 162usize];
    ["Offset of field: Preferences::PrintLeftMargin"]
        [::core::mem::offset_of!(Preferences, PrintLeftMargin) - 164usize];
    ["Offset of field: Preferences::PrintRightMargin"]
        [::core::mem::offset_of!(Preferences, PrintRightMargin) - 166usize];
    ["Offset of field: Preferences::PrintImage"]
        [::core::mem::offset_of!(Preferences, PrintImage) - 168usize];
    ["Offset of field: Preferences::PrintAspect"]
        [::core::mem::offset_of!(Preferences, PrintAspect) - 170usize];
    ["Offset of field: Preferences::PrintShade"]
        [::core::mem::offset_of!(Preferences, PrintShade) - 172usize];
    ["Offset of field: Preferences::PrintThreshold"]
        [::core::mem::offset_of!(Preferences, PrintThreshold) - 174usize];
    ["Offset of field: Preferences::PaperSize"]
        [::core::mem::offset_of!(Preferences, PaperSize) - 176usize];
    ["Offset of field: Preferences::PaperLength"]
        [::core::mem::offset_of!(Preferences, PaperLength) - 178usize];
    ["Offset of field: Preferences::PaperType"]
        [::core::mem::offset_of!(Preferences, PaperType) - 180usize];
    ["Offset of field: Preferences::SerRWBits"]
        [::core::mem::offset_of!(Preferences, SerRWBits) - 182usize];
    ["Offset of field: Preferences::SerStopBuf"]
        [::core::mem::offset_of!(Preferences, SerStopBuf) - 183usize];
    ["Offset of field: Preferences::SerParShk"]
        [::core::mem::offset_of!(Preferences, SerParShk) - 184usize];
    ["Offset of field: Preferences::LaceWB"]
        [::core::mem::offset_of!(Preferences, LaceWB) - 185usize];
    ["Offset of field: Preferences::Pad"][::core::mem::offset_of!(Preferences, Pad) - 186usize];
    ["Offset of field: Preferences::PrtDevName"]
        [::core::mem::offset_of!(Preferences, PrtDevName) - 198usize];
    ["Offset of field: Preferences::DefaultPrtUnit"]
        [::core::mem::offset_of!(Preferences, DefaultPrtUnit) - 214usize];
    ["Offset of field: Preferences::DefaultSerUnit"]
        [::core::mem::offset_of!(Preferences, DefaultSerUnit) - 215usize];
    ["Offset of field: Preferences::RowSizeChange"]
        [::core::mem::offset_of!(Preferences, RowSizeChange) - 216usize];
    ["Offset of field: Preferences::ColumnSizeChange"]
        [::core::mem::offset_of!(Preferences, ColumnSizeChange) - 217usize];
    ["Offset of field: Preferences::PrintFlags"]
        [::core::mem::offset_of!(Preferences, PrintFlags) - 218usize];
    ["Offset of field: Preferences::PrintMaxWidth"]
        [::core::mem::offset_of!(Preferences, PrintMaxWidth) - 220usize];
    ["Offset of field: Preferences::PrintMaxHeight"]
        [::core::mem::offset_of!(Preferences, PrintMaxHeight) - 222usize];
    ["Offset of field: Preferences::PrintDensity"]
        [::core::mem::offset_of!(Preferences, PrintDensity) - 224usize];
    ["Offset of field: Preferences::PrintXOffset"]
        [::core::mem::offset_of!(Preferences, PrintXOffset) - 225usize];
    ["Offset of field: Preferences::wb_Width"]
        [::core::mem::offset_of!(Preferences, wb_Width) - 226usize];
    ["Offset of field: Preferences::wb_Height"]
        [::core::mem::offset_of!(Preferences, wb_Height) - 228usize];
    ["Offset of field: Preferences::wb_Depth"]
        [::core::mem::offset_of!(Preferences, wb_Depth) - 230usize];
    ["Offset of field: Preferences::ext_size"]
        [::core::mem::offset_of!(Preferences, ext_size) - 231usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct Remember {
    pub NextRemember: *mut Remember,
    pub RememberSize: ULONG,
    pub Memory: *mut UBYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Remember"][::core::mem::size_of::<Remember>() - 12usize];
    ["Alignment of Remember"][::core::mem::align_of::<Remember>() - 2usize];
    ["Offset of field: Remember::NextRemember"]
        [::core::mem::offset_of!(Remember, NextRemember) - 0usize];
    ["Offset of field: Remember::RememberSize"]
        [::core::mem::offset_of!(Remember, RememberSize) - 4usize];
    ["Offset of field: Remember::Memory"][::core::mem::offset_of!(Remember, Memory) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ColorSpec {
    pub ColorIndex: WORD,
    pub Red: UWORD,
    pub Green: UWORD,
    pub Blue: UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ColorSpec"][::core::mem::size_of::<ColorSpec>() - 8usize];
    ["Alignment of ColorSpec"][::core::mem::align_of::<ColorSpec>() - 2usize];
    ["Offset of field: ColorSpec::ColorIndex"]
        [::core::mem::offset_of!(ColorSpec, ColorIndex) - 0usize];
    ["Offset of field: ColorSpec::Red"][::core::mem::offset_of!(ColorSpec, Red) - 2usize];
    ["Offset of field: ColorSpec::Green"][::core::mem::offset_of!(ColorSpec, Green) - 4usize];
    ["Offset of field: ColorSpec::Blue"][::core::mem::offset_of!(ColorSpec, Blue) - 6usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct EasyStruct {
    pub es_StructSize: ULONG,
    pub es_Flags: ULONG,
    pub es_Title: CONST_STRPTR,
    pub es_TextFormat: CONST_STRPTR,
    pub es_GadgetFormat: CONST_STRPTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of EasyStruct"][::core::mem::size_of::<EasyStruct>() - 20usize];
    ["Alignment of EasyStruct"][::core::mem::align_of::<EasyStruct>() - 2usize];
    ["Offset of field: EasyStruct::es_StructSize"]
        [::core::mem::offset_of!(EasyStruct, es_StructSize) - 0usize];
    ["Offset of field: EasyStruct::es_Flags"]
        [::core::mem::offset_of!(EasyStruct, es_Flags) - 4usize];
    ["Offset of field: EasyStruct::es_Title"]
        [::core::mem::offset_of!(EasyStruct, es_Title) - 8usize];
    ["Offset of field: EasyStruct::es_TextFormat"]
        [::core::mem::offset_of!(EasyStruct, es_TextFormat) - 12usize];
    ["Offset of field: EasyStruct::es_GadgetFormat"]
        [::core::mem::offset_of!(EasyStruct, es_GadgetFormat) - 16usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct TabletData {
    pub td_XFraction: UWORD,
    pub td_YFraction: UWORD,
    pub td_TabletX: ULONG,
    pub td_TabletY: ULONG,
    pub td_RangeX: ULONG,
    pub td_RangeY: ULONG,
    pub td_TagList: *mut TagItem,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TabletData"][::core::mem::size_of::<TabletData>() - 24usize];
    ["Alignment of TabletData"][::core::mem::align_of::<TabletData>() - 2usize];
    ["Offset of field: TabletData::td_XFraction"]
        [::core::mem::offset_of!(TabletData, td_XFraction) - 0usize];
    ["Offset of field: TabletData::td_YFraction"]
        [::core::mem::offset_of!(TabletData, td_YFraction) - 2usize];
    ["Offset of field: TabletData::td_TabletX"]
        [::core::mem::offset_of!(TabletData, td_TabletX) - 4usize];
    ["Offset of field: TabletData::td_TabletY"]
        [::core::mem::offset_of!(TabletData, td_TabletY) - 8usize];
    ["Offset of field: TabletData::td_RangeX"]
        [::core::mem::offset_of!(TabletData, td_RangeX) - 12usize];
    ["Offset of field: TabletData::td_RangeY"]
        [::core::mem::offset_of!(TabletData, td_RangeY) - 16usize];
    ["Offset of field: TabletData::td_TagList"]
        [::core::mem::offset_of!(TabletData, td_TagList) - 20usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct TabletHookData {
    pub thd_Screen: *mut Screen,
    pub thd_Width: ULONG,
    pub thd_Height: ULONG,
    pub thd_ScreenChanged: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TabletHookData"][::core::mem::size_of::<TabletHookData>() - 16usize];
    ["Alignment of TabletHookData"][::core::mem::align_of::<TabletHookData>() - 2usize];
    ["Offset of field: TabletHookData::thd_Screen"]
        [::core::mem::offset_of!(TabletHookData, thd_Screen) - 0usize];
    ["Offset of field: TabletHookData::thd_Width"]
        [::core::mem::offset_of!(TabletHookData, thd_Width) - 4usize];
    ["Offset of field: TabletHookData::thd_Height"]
        [::core::mem::offset_of!(TabletHookData, thd_Height) - 8usize];
    ["Offset of field: TabletHookData::thd_ScreenChanged"]
        [::core::mem::offset_of!(TabletHookData, thd_ScreenChanged) - 12usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct IOPrtCmdReq {
    pub io_Message: Message,
    pub io_Device: *mut Device,
    pub io_Unit: *mut Unit,
    pub io_Command: UWORD,
    pub io_Flags: UBYTE,
    pub io_Error: BYTE,
    pub io_PrtCommand: UWORD,
    pub io_Parm0: UBYTE,
    pub io_Parm1: UBYTE,
    pub io_Parm2: UBYTE,
    pub io_Parm3: UBYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IOPrtCmdReq"][::core::mem::size_of::<IOPrtCmdReq>() - 38usize];
    ["Alignment of IOPrtCmdReq"][::core::mem::align_of::<IOPrtCmdReq>() - 2usize];
    ["Offset of field: IOPrtCmdReq::io_Message"]
        [::core::mem::offset_of!(IOPrtCmdReq, io_Message) - 0usize];
    ["Offset of field: IOPrtCmdReq::io_Device"]
        [::core::mem::offset_of!(IOPrtCmdReq, io_Device) - 20usize];
    ["Offset of field: IOPrtCmdReq::io_Unit"]
        [::core::mem::offset_of!(IOPrtCmdReq, io_Unit) - 24usize];
    ["Offset of field: IOPrtCmdReq::io_Command"]
        [::core::mem::offset_of!(IOPrtCmdReq, io_Command) - 28usize];
    ["Offset of field: IOPrtCmdReq::io_Flags"]
        [::core::mem::offset_of!(IOPrtCmdReq, io_Flags) - 30usize];
    ["Offset of field: IOPrtCmdReq::io_Error"]
        [::core::mem::offset_of!(IOPrtCmdReq, io_Error) - 31usize];
    ["Offset of field: IOPrtCmdReq::io_PrtCommand"]
        [::core::mem::offset_of!(IOPrtCmdReq, io_PrtCommand) - 32usize];
    ["Offset of field: IOPrtCmdReq::io_Parm0"]
        [::core::mem::offset_of!(IOPrtCmdReq, io_Parm0) - 34usize];
    ["Offset of field: IOPrtCmdReq::io_Parm1"]
        [::core::mem::offset_of!(IOPrtCmdReq, io_Parm1) - 35usize];
    ["Offset of field: IOPrtCmdReq::io_Parm2"]
        [::core::mem::offset_of!(IOPrtCmdReq, io_Parm2) - 36usize];
    ["Offset of field: IOPrtCmdReq::io_Parm3"]
        [::core::mem::offset_of!(IOPrtCmdReq, io_Parm3) - 37usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct IODRPReq {
    pub io_Message: Message,
    pub io_Device: *mut Device,
    pub io_Unit: *mut Unit,
    pub io_Command: UWORD,
    pub io_Flags: UBYTE,
    pub io_Error: BYTE,
    pub io_RastPort: *mut RastPort,
    pub io_ColorMap: *mut ColorMap,
    pub io_Modes: ULONG,
    pub io_SrcX: UWORD,
    pub io_SrcY: UWORD,
    pub io_SrcWidth: UWORD,
    pub io_SrcHeight: UWORD,
    pub io_DestCols: LONG,
    pub io_DestRows: LONG,
    pub io_Special: UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IODRPReq"][::core::mem::size_of::<IODRPReq>() - 62usize];
    ["Alignment of IODRPReq"][::core::mem::align_of::<IODRPReq>() - 2usize];
    ["Offset of field: IODRPReq::io_Message"]
        [::core::mem::offset_of!(IODRPReq, io_Message) - 0usize];
    ["Offset of field: IODRPReq::io_Device"]
        [::core::mem::offset_of!(IODRPReq, io_Device) - 20usize];
    ["Offset of field: IODRPReq::io_Unit"][::core::mem::offset_of!(IODRPReq, io_Unit) - 24usize];
    ["Offset of field: IODRPReq::io_Command"]
        [::core::mem::offset_of!(IODRPReq, io_Command) - 28usize];
    ["Offset of field: IODRPReq::io_Flags"][::core::mem::offset_of!(IODRPReq, io_Flags) - 30usize];
    ["Offset of field: IODRPReq::io_Error"][::core::mem::offset_of!(IODRPReq, io_Error) - 31usize];
    ["Offset of field: IODRPReq::io_RastPort"]
        [::core::mem::offset_of!(IODRPReq, io_RastPort) - 32usize];
    ["Offset of field: IODRPReq::io_ColorMap"]
        [::core::mem::offset_of!(IODRPReq, io_ColorMap) - 36usize];
    ["Offset of field: IODRPReq::io_Modes"][::core::mem::offset_of!(IODRPReq, io_Modes) - 40usize];
    ["Offset of field: IODRPReq::io_SrcX"][::core::mem::offset_of!(IODRPReq, io_SrcX) - 44usize];
    ["Offset of field: IODRPReq::io_SrcY"][::core::mem::offset_of!(IODRPReq, io_SrcY) - 46usize];
    ["Offset of field: IODRPReq::io_SrcWidth"]
        [::core::mem::offset_of!(IODRPReq, io_SrcWidth) - 48usize];
    ["Offset of field: IODRPReq::io_SrcHeight"]
        [::core::mem::offset_of!(IODRPReq, io_SrcHeight) - 50usize];
    ["Offset of field: IODRPReq::io_DestCols"]
        [::core::mem::offset_of!(IODRPReq, io_DestCols) - 52usize];
    ["Offset of field: IODRPReq::io_DestRows"]
        [::core::mem::offset_of!(IODRPReq, io_DestRows) - 56usize];
    ["Offset of field: IODRPReq::io_Special"]
        [::core::mem::offset_of!(IODRPReq, io_Special) - 60usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct IODRPTagsReq {
    pub io_Message: Message,
    pub io_Device: *mut Device,
    pub io_Unit: *mut Unit,
    pub io_Command: UWORD,
    pub io_Flags: UBYTE,
    pub io_Error: BYTE,
    pub io_RastPort: *mut RastPort,
    pub io_ColorMap: *mut ColorMap,
    pub io_Modes: ULONG,
    pub io_SrcX: UWORD,
    pub io_SrcY: UWORD,
    pub io_SrcWidth: UWORD,
    pub io_SrcHeight: UWORD,
    pub io_DestCols: LONG,
    pub io_DestRows: LONG,
    pub io_Special: UWORD,
    pub io_TagList: *mut TagItem,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IODRPTagsReq"][::core::mem::size_of::<IODRPTagsReq>() - 66usize];
    ["Alignment of IODRPTagsReq"][::core::mem::align_of::<IODRPTagsReq>() - 2usize];
    ["Offset of field: IODRPTagsReq::io_Message"]
        [::core::mem::offset_of!(IODRPTagsReq, io_Message) - 0usize];
    ["Offset of field: IODRPTagsReq::io_Device"]
        [::core::mem::offset_of!(IODRPTagsReq, io_Device) - 20usize];
    ["Offset of field: IODRPTagsReq::io_Unit"]
        [::core::mem::offset_of!(IODRPTagsReq, io_Unit) - 24usize];
    ["Offset of field: IODRPTagsReq::io_Command"]
        [::core::mem::offset_of!(IODRPTagsReq, io_Command) - 28usize];
    ["Offset of field: IODRPTagsReq::io_Flags"]
        [::core::mem::offset_of!(IODRPTagsReq, io_Flags) - 30usize];
    ["Offset of field: IODRPTagsReq::io_Error"]
        [::core::mem::offset_of!(IODRPTagsReq, io_Error) - 31usize];
    ["Offset of field: IODRPTagsReq::io_RastPort"]
        [::core::mem::offset_of!(IODRPTagsReq, io_RastPort) - 32usize];
    ["Offset of field: IODRPTagsReq::io_ColorMap"]
        [::core::mem::offset_of!(IODRPTagsReq, io_ColorMap) - 36usize];
    ["Offset of field: IODRPTagsReq::io_Modes"]
        [::core::mem::offset_of!(IODRPTagsReq, io_Modes) - 40usize];
    ["Offset of field: IODRPTagsReq::io_SrcX"]
        [::core::mem::offset_of!(IODRPTagsReq, io_SrcX) - 44usize];
    ["Offset of field: IODRPTagsReq::io_SrcY"]
        [::core::mem::offset_of!(IODRPTagsReq, io_SrcY) - 46usize];
    ["Offset of field: IODRPTagsReq::io_SrcWidth"]
        [::core::mem::offset_of!(IODRPTagsReq, io_SrcWidth) - 48usize];
    ["Offset of field: IODRPTagsReq::io_SrcHeight"]
        [::core::mem::offset_of!(IODRPTagsReq, io_SrcHeight) - 50usize];
    ["Offset of field: IODRPTagsReq::io_DestCols"]
        [::core::mem::offset_of!(IODRPTagsReq, io_DestCols) - 52usize];
    ["Offset of field: IODRPTagsReq::io_DestRows"]
        [::core::mem::offset_of!(IODRPTagsReq, io_DestRows) - 56usize];
    ["Offset of field: IODRPTagsReq::io_Special"]
        [::core::mem::offset_of!(IODRPTagsReq, io_Special) - 60usize];
    ["Offset of field: IODRPTagsReq::io_TagList"]
        [::core::mem::offset_of!(IODRPTagsReq, io_TagList) - 62usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct DRPSourceMsg {
    pub x: LONG,
    pub y: LONG,
    pub width: LONG,
    pub height: LONG,
    pub buf: *mut ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DRPSourceMsg"][::core::mem::size_of::<DRPSourceMsg>() - 20usize];
    ["Alignment of DRPSourceMsg"][::core::mem::align_of::<DRPSourceMsg>() - 2usize];
    ["Offset of field: DRPSourceMsg::x"][::core::mem::offset_of!(DRPSourceMsg, x) - 0usize];
    ["Offset of field: DRPSourceMsg::y"][::core::mem::offset_of!(DRPSourceMsg, y) - 4usize];
    ["Offset of field: DRPSourceMsg::width"][::core::mem::offset_of!(DRPSourceMsg, width) - 8usize];
    ["Offset of field: DRPSourceMsg::height"]
        [::core::mem::offset_of!(DRPSourceMsg, height) - 12usize];
    ["Offset of field: DRPSourceMsg::buf"][::core::mem::offset_of!(DRPSourceMsg, buf) - 16usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct IOPrtPrefsReq {
    pub io_Message: Message,
    pub io_Device: *mut Device,
    pub io_Unit: *mut Unit,
    pub io_Command: UWORD,
    pub io_Flags: UBYTE,
    pub io_Error: BYTE,
    pub io_TagList: *mut TagItem,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IOPrtPrefsReq"][::core::mem::size_of::<IOPrtPrefsReq>() - 36usize];
    ["Alignment of IOPrtPrefsReq"][::core::mem::align_of::<IOPrtPrefsReq>() - 2usize];
    ["Offset of field: IOPrtPrefsReq::io_Message"]
        [::core::mem::offset_of!(IOPrtPrefsReq, io_Message) - 0usize];
    ["Offset of field: IOPrtPrefsReq::io_Device"]
        [::core::mem::offset_of!(IOPrtPrefsReq, io_Device) - 20usize];
    ["Offset of field: IOPrtPrefsReq::io_Unit"]
        [::core::mem::offset_of!(IOPrtPrefsReq, io_Unit) - 24usize];
    ["Offset of field: IOPrtPrefsReq::io_Command"]
        [::core::mem::offset_of!(IOPrtPrefsReq, io_Command) - 28usize];
    ["Offset of field: IOPrtPrefsReq::io_Flags"]
        [::core::mem::offset_of!(IOPrtPrefsReq, io_Flags) - 30usize];
    ["Offset of field: IOPrtPrefsReq::io_Error"]
        [::core::mem::offset_of!(IOPrtPrefsReq, io_Error) - 31usize];
    ["Offset of field: IOPrtPrefsReq::io_TagList"]
        [::core::mem::offset_of!(IOPrtPrefsReq, io_TagList) - 32usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct IOPrtErrReq {
    pub io_Message: Message,
    pub io_Device: *mut Device,
    pub io_Unit: *mut Unit,
    pub io_Command: UWORD,
    pub io_Flags: UBYTE,
    pub io_Error: BYTE,
    pub io_Hook: *mut Hook,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IOPrtErrReq"][::core::mem::size_of::<IOPrtErrReq>() - 36usize];
    ["Alignment of IOPrtErrReq"][::core::mem::align_of::<IOPrtErrReq>() - 2usize];
    ["Offset of field: IOPrtErrReq::io_Message"]
        [::core::mem::offset_of!(IOPrtErrReq, io_Message) - 0usize];
    ["Offset of field: IOPrtErrReq::io_Device"]
        [::core::mem::offset_of!(IOPrtErrReq, io_Device) - 20usize];
    ["Offset of field: IOPrtErrReq::io_Unit"]
        [::core::mem::offset_of!(IOPrtErrReq, io_Unit) - 24usize];
    ["Offset of field: IOPrtErrReq::io_Command"]
        [::core::mem::offset_of!(IOPrtErrReq, io_Command) - 28usize];
    ["Offset of field: IOPrtErrReq::io_Flags"]
        [::core::mem::offset_of!(IOPrtErrReq, io_Flags) - 30usize];
    ["Offset of field: IOPrtErrReq::io_Error"]
        [::core::mem::offset_of!(IOPrtErrReq, io_Error) - 31usize];
    ["Offset of field: IOPrtErrReq::io_Hook"]
        [::core::mem::offset_of!(IOPrtErrReq, io_Hook) - 32usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct PrtErrMsg {
    pub pe_Version: ULONG,
    pub pe_ErrorLevel: ULONG,
    pub pe_Window: *mut Window,
    pub pe_ES: *mut EasyStruct,
    pub pe_IDCMP: *mut ULONG,
    pub pe_ArgList: APTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PrtErrMsg"][::core::mem::size_of::<PrtErrMsg>() - 24usize];
    ["Alignment of PrtErrMsg"][::core::mem::align_of::<PrtErrMsg>() - 2usize];
    ["Offset of field: PrtErrMsg::pe_Version"]
        [::core::mem::offset_of!(PrtErrMsg, pe_Version) - 0usize];
    ["Offset of field: PrtErrMsg::pe_ErrorLevel"]
        [::core::mem::offset_of!(PrtErrMsg, pe_ErrorLevel) - 4usize];
    ["Offset of field: PrtErrMsg::pe_Window"]
        [::core::mem::offset_of!(PrtErrMsg, pe_Window) - 8usize];
    ["Offset of field: PrtErrMsg::pe_ES"][::core::mem::offset_of!(PrtErrMsg, pe_ES) - 12usize];
    ["Offset of field: PrtErrMsg::pe_IDCMP"]
        [::core::mem::offset_of!(PrtErrMsg, pe_IDCMP) - 16usize];
    ["Offset of field: PrtErrMsg::pe_ArgList"]
        [::core::mem::offset_of!(PrtErrMsg, pe_ArgList) - 20usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct IOPrefsReq {
    pub io_Message: Message,
    pub io_Device: *mut Device,
    pub io_Unit: *mut Unit,
    pub io_Command: UWORD,
    pub io_Flags: UBYTE,
    pub io_Error: BYTE,
    pub io_TxtPrefs: *mut PrinterTxtPrefs,
    pub io_UnitPrefs: *mut PrinterUnitPrefs,
    pub io_DevUnitPrefs: *mut PrinterDeviceUnitPrefs,
    pub io_GfxPrefs: *mut PrinterGfxPrefs,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IOPrefsReq"][::core::mem::size_of::<IOPrefsReq>() - 48usize];
    ["Alignment of IOPrefsReq"][::core::mem::align_of::<IOPrefsReq>() - 2usize];
    ["Offset of field: IOPrefsReq::io_Message"]
        [::core::mem::offset_of!(IOPrefsReq, io_Message) - 0usize];
    ["Offset of field: IOPrefsReq::io_Device"]
        [::core::mem::offset_of!(IOPrefsReq, io_Device) - 20usize];
    ["Offset of field: IOPrefsReq::io_Unit"]
        [::core::mem::offset_of!(IOPrefsReq, io_Unit) - 24usize];
    ["Offset of field: IOPrefsReq::io_Command"]
        [::core::mem::offset_of!(IOPrefsReq, io_Command) - 28usize];
    ["Offset of field: IOPrefsReq::io_Flags"]
        [::core::mem::offset_of!(IOPrefsReq, io_Flags) - 30usize];
    ["Offset of field: IOPrefsReq::io_Error"]
        [::core::mem::offset_of!(IOPrefsReq, io_Error) - 31usize];
    ["Offset of field: IOPrefsReq::io_TxtPrefs"]
        [::core::mem::offset_of!(IOPrefsReq, io_TxtPrefs) - 32usize];
    ["Offset of field: IOPrefsReq::io_UnitPrefs"]
        [::core::mem::offset_of!(IOPrefsReq, io_UnitPrefs) - 36usize];
    ["Offset of field: IOPrefsReq::io_DevUnitPrefs"]
        [::core::mem::offset_of!(IOPrefsReq, io_DevUnitPrefs) - 40usize];
    ["Offset of field: IOPrefsReq::io_GfxPrefs"]
        [::core::mem::offset_of!(IOPrefsReq, io_GfxPrefs) - 44usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct IOPArray {
    pub PTermArray0: ULONG,
    pub PTermArray1: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IOPArray"][::core::mem::size_of::<IOPArray>() - 8usize];
    ["Alignment of IOPArray"][::core::mem::align_of::<IOPArray>() - 2usize];
    ["Offset of field: IOPArray::PTermArray0"]
        [::core::mem::offset_of!(IOPArray, PTermArray0) - 0usize];
    ["Offset of field: IOPArray::PTermArray1"]
        [::core::mem::offset_of!(IOPArray, PTermArray1) - 4usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct IOExtPar {
    pub IOPar: IOStdReq,
    pub io_PExtFlags: ULONG,
    pub io_Status: UBYTE,
    pub io_ParFlags: UBYTE,
    pub io_PTermArray: IOPArray,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IOExtPar"][::core::mem::size_of::<IOExtPar>() - 62usize];
    ["Alignment of IOExtPar"][::core::mem::align_of::<IOExtPar>() - 2usize];
    ["Offset of field: IOExtPar::IOPar"][::core::mem::offset_of!(IOExtPar, IOPar) - 0usize];
    ["Offset of field: IOExtPar::io_PExtFlags"]
        [::core::mem::offset_of!(IOExtPar, io_PExtFlags) - 48usize];
    ["Offset of field: IOExtPar::io_Status"]
        [::core::mem::offset_of!(IOExtPar, io_Status) - 52usize];
    ["Offset of field: IOExtPar::io_ParFlags"]
        [::core::mem::offset_of!(IOExtPar, io_ParFlags) - 53usize];
    ["Offset of field: IOExtPar::io_PTermArray"]
        [::core::mem::offset_of!(IOExtPar, io_PTermArray) - 54usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct IOTArray {
    pub TermArray0: ULONG,
    pub TermArray1: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IOTArray"][::core::mem::size_of::<IOTArray>() - 8usize];
    ["Alignment of IOTArray"][::core::mem::align_of::<IOTArray>() - 2usize];
    ["Offset of field: IOTArray::TermArray0"]
        [::core::mem::offset_of!(IOTArray, TermArray0) - 0usize];
    ["Offset of field: IOTArray::TermArray1"]
        [::core::mem::offset_of!(IOTArray, TermArray1) - 4usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct IOExtSer {
    pub IOSer: IOStdReq,
    pub io_CtlChar: ULONG,
    pub io_RBufLen: ULONG,
    pub io_ExtFlags: ULONG,
    pub io_Baud: ULONG,
    pub io_BrkTime: ULONG,
    pub io_TermArray: IOTArray,
    pub io_ReadLen: UBYTE,
    pub io_WriteLen: UBYTE,
    pub io_StopBits: UBYTE,
    pub io_SerFlags: UBYTE,
    pub io_Status: UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IOExtSer"][::core::mem::size_of::<IOExtSer>() - 82usize];
    ["Alignment of IOExtSer"][::core::mem::align_of::<IOExtSer>() - 2usize];
    ["Offset of field: IOExtSer::IOSer"][::core::mem::offset_of!(IOExtSer, IOSer) - 0usize];
    ["Offset of field: IOExtSer::io_CtlChar"]
        [::core::mem::offset_of!(IOExtSer, io_CtlChar) - 48usize];
    ["Offset of field: IOExtSer::io_RBufLen"]
        [::core::mem::offset_of!(IOExtSer, io_RBufLen) - 52usize];
    ["Offset of field: IOExtSer::io_ExtFlags"]
        [::core::mem::offset_of!(IOExtSer, io_ExtFlags) - 56usize];
    ["Offset of field: IOExtSer::io_Baud"][::core::mem::offset_of!(IOExtSer, io_Baud) - 60usize];
    ["Offset of field: IOExtSer::io_BrkTime"]
        [::core::mem::offset_of!(IOExtSer, io_BrkTime) - 64usize];
    ["Offset of field: IOExtSer::io_TermArray"]
        [::core::mem::offset_of!(IOExtSer, io_TermArray) - 68usize];
    ["Offset of field: IOExtSer::io_ReadLen"]
        [::core::mem::offset_of!(IOExtSer, io_ReadLen) - 76usize];
    ["Offset of field: IOExtSer::io_WriteLen"]
        [::core::mem::offset_of!(IOExtSer, io_WriteLen) - 77usize];
    ["Offset of field: IOExtSer::io_StopBits"]
        [::core::mem::offset_of!(IOExtSer, io_StopBits) - 78usize];
    ["Offset of field: IOExtSer::io_SerFlags"]
        [::core::mem::offset_of!(IOExtSer, io_SerFlags) - 79usize];
    ["Offset of field: IOExtSer::io_Status"]
        [::core::mem::offset_of!(IOExtSer, io_Status) - 80usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct Process {
    pub pr_Task: Task,
    pub pr_MsgPort: MsgPort,
    pub pr_Pad: WORD,
    pub pr_SegList: BPTR,
    pub pr_StackSize: LONG,
    pub pr_GlobVec: APTR,
    pub pr_TaskNum: LONG,
    pub pr_StackBase: BPTR,
    pub pr_Result2: LONG,
    pub pr_CurrentDir: BPTR,
    pub pr_CIS: BPTR,
    pub pr_COS: BPTR,
    pub pr_ConsoleTask: APTR,
    pub pr_FileSystemTask: APTR,
    pub pr_CLI: BPTR,
    pub pr_ReturnAddr: APTR,
    pub pr_PktWait: APTR,
    pub pr_WindowPtr: APTR,
    pub pr_HomeDir: BPTR,
    pub pr_Flags: LONG,
    pub pr_ExitCode: FPTR,
    pub pr_ExitData: LONG,
    pub pr_Arguments: STRPTR,
    pub pr_LocalVars: MinList,
    pub pr_ShellPrivate: ULONG,
    pub pr_CES: BPTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Process"][::core::mem::size_of::<Process>() - 228usize];
    ["Alignment of Process"][::core::mem::align_of::<Process>() - 2usize];
    ["Offset of field: Process::pr_Task"][::core::mem::offset_of!(Process, pr_Task) - 0usize];
    ["Offset of field: Process::pr_MsgPort"]
        [::core::mem::offset_of!(Process, pr_MsgPort) - 92usize];
    ["Offset of field: Process::pr_Pad"][::core::mem::offset_of!(Process, pr_Pad) - 126usize];
    ["Offset of field: Process::pr_SegList"]
        [::core::mem::offset_of!(Process, pr_SegList) - 128usize];
    ["Offset of field: Process::pr_StackSize"]
        [::core::mem::offset_of!(Process, pr_StackSize) - 132usize];
    ["Offset of field: Process::pr_GlobVec"]
        [::core::mem::offset_of!(Process, pr_GlobVec) - 136usize];
    ["Offset of field: Process::pr_TaskNum"]
        [::core::mem::offset_of!(Process, pr_TaskNum) - 140usize];
    ["Offset of field: Process::pr_StackBase"]
        [::core::mem::offset_of!(Process, pr_StackBase) - 144usize];
    ["Offset of field: Process::pr_Result2"]
        [::core::mem::offset_of!(Process, pr_Result2) - 148usize];
    ["Offset of field: Process::pr_CurrentDir"]
        [::core::mem::offset_of!(Process, pr_CurrentDir) - 152usize];
    ["Offset of field: Process::pr_CIS"][::core::mem::offset_of!(Process, pr_CIS) - 156usize];
    ["Offset of field: Process::pr_COS"][::core::mem::offset_of!(Process, pr_COS) - 160usize];
    ["Offset of field: Process::pr_ConsoleTask"]
        [::core::mem::offset_of!(Process, pr_ConsoleTask) - 164usize];
    ["Offset of field: Process::pr_FileSystemTask"]
        [::core::mem::offset_of!(Process, pr_FileSystemTask) - 168usize];
    ["Offset of field: Process::pr_CLI"][::core::mem::offset_of!(Process, pr_CLI) - 172usize];
    ["Offset of field: Process::pr_ReturnAddr"]
        [::core::mem::offset_of!(Process, pr_ReturnAddr) - 176usize];
    ["Offset of field: Process::pr_PktWait"]
        [::core::mem::offset_of!(Process, pr_PktWait) - 180usize];
    ["Offset of field: Process::pr_WindowPtr"]
        [::core::mem::offset_of!(Process, pr_WindowPtr) - 184usize];
    ["Offset of field: Process::pr_HomeDir"]
        [::core::mem::offset_of!(Process, pr_HomeDir) - 188usize];
    ["Offset of field: Process::pr_Flags"][::core::mem::offset_of!(Process, pr_Flags) - 192usize];
    ["Offset of field: Process::pr_ExitCode"]
        [::core::mem::offset_of!(Process, pr_ExitCode) - 196usize];
    ["Offset of field: Process::pr_ExitData"]
        [::core::mem::offset_of!(Process, pr_ExitData) - 200usize];
    ["Offset of field: Process::pr_Arguments"]
        [::core::mem::offset_of!(Process, pr_Arguments) - 204usize];
    ["Offset of field: Process::pr_LocalVars"]
        [::core::mem::offset_of!(Process, pr_LocalVars) - 208usize];
    ["Offset of field: Process::pr_ShellPrivate"]
        [::core::mem::offset_of!(Process, pr_ShellPrivate) - 220usize];
    ["Offset of field: Process::pr_CES"][::core::mem::offset_of!(Process, pr_CES) - 224usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct FileHandle {
    pub fh_Link: *mut Message,
    pub fh_Port: *mut MsgPort,
    pub fh_Type: *mut MsgPort,
    pub fh_Buf: BPTR,
    pub fh_Pos: LONG,
    pub fh_End: LONG,
    pub fh_Funcs: LONG,
    pub fh_Func2: LONG,
    pub fh_Func3: LONG,
    pub fh_Args: LONG,
    pub fh_Arg2: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FileHandle"][::core::mem::size_of::<FileHandle>() - 44usize];
    ["Alignment of FileHandle"][::core::mem::align_of::<FileHandle>() - 2usize];
    ["Offset of field: FileHandle::fh_Link"][::core::mem::offset_of!(FileHandle, fh_Link) - 0usize];
    ["Offset of field: FileHandle::fh_Port"][::core::mem::offset_of!(FileHandle, fh_Port) - 4usize];
    ["Offset of field: FileHandle::fh_Type"][::core::mem::offset_of!(FileHandle, fh_Type) - 8usize];
    ["Offset of field: FileHandle::fh_Buf"][::core::mem::offset_of!(FileHandle, fh_Buf) - 12usize];
    ["Offset of field: FileHandle::fh_Pos"][::core::mem::offset_of!(FileHandle, fh_Pos) - 16usize];
    ["Offset of field: FileHandle::fh_End"][::core::mem::offset_of!(FileHandle, fh_End) - 20usize];
    ["Offset of field: FileHandle::fh_Funcs"]
        [::core::mem::offset_of!(FileHandle, fh_Funcs) - 24usize];
    ["Offset of field: FileHandle::fh_Func2"]
        [::core::mem::offset_of!(FileHandle, fh_Func2) - 28usize];
    ["Offset of field: FileHandle::fh_Func3"]
        [::core::mem::offset_of!(FileHandle, fh_Func3) - 32usize];
    ["Offset of field: FileHandle::fh_Args"]
        [::core::mem::offset_of!(FileHandle, fh_Args) - 36usize];
    ["Offset of field: FileHandle::fh_Arg2"]
        [::core::mem::offset_of!(FileHandle, fh_Arg2) - 40usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct DosPacket {
    pub dp_Link: *mut Message,
    pub dp_Port: *mut MsgPort,
    pub dp_Type: LONG,
    pub dp_Res1: LONG,
    pub dp_Res2: LONG,
    pub dp_Arg1: LONG,
    pub dp_Arg2: LONG,
    pub dp_Arg3: LONG,
    pub dp_Arg4: LONG,
    pub dp_Arg5: LONG,
    pub dp_Arg6: LONG,
    pub dp_Arg7: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DosPacket"][::core::mem::size_of::<DosPacket>() - 48usize];
    ["Alignment of DosPacket"][::core::mem::align_of::<DosPacket>() - 2usize];
    ["Offset of field: DosPacket::dp_Link"][::core::mem::offset_of!(DosPacket, dp_Link) - 0usize];
    ["Offset of field: DosPacket::dp_Port"][::core::mem::offset_of!(DosPacket, dp_Port) - 4usize];
    ["Offset of field: DosPacket::dp_Type"][::core::mem::offset_of!(DosPacket, dp_Type) - 8usize];
    ["Offset of field: DosPacket::dp_Res1"][::core::mem::offset_of!(DosPacket, dp_Res1) - 12usize];
    ["Offset of field: DosPacket::dp_Res2"][::core::mem::offset_of!(DosPacket, dp_Res2) - 16usize];
    ["Offset of field: DosPacket::dp_Arg1"][::core::mem::offset_of!(DosPacket, dp_Arg1) - 20usize];
    ["Offset of field: DosPacket::dp_Arg2"][::core::mem::offset_of!(DosPacket, dp_Arg2) - 24usize];
    ["Offset of field: DosPacket::dp_Arg3"][::core::mem::offset_of!(DosPacket, dp_Arg3) - 28usize];
    ["Offset of field: DosPacket::dp_Arg4"][::core::mem::offset_of!(DosPacket, dp_Arg4) - 32usize];
    ["Offset of field: DosPacket::dp_Arg5"][::core::mem::offset_of!(DosPacket, dp_Arg5) - 36usize];
    ["Offset of field: DosPacket::dp_Arg6"][::core::mem::offset_of!(DosPacket, dp_Arg6) - 40usize];
    ["Offset of field: DosPacket::dp_Arg7"][::core::mem::offset_of!(DosPacket, dp_Arg7) - 44usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StandardPacket {
    pub sp_Msg: Message,
    pub sp_Pkt: DosPacket,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StandardPacket"][::core::mem::size_of::<StandardPacket>() - 68usize];
    ["Alignment of StandardPacket"][::core::mem::align_of::<StandardPacket>() - 2usize];
    ["Offset of field: StandardPacket::sp_Msg"]
        [::core::mem::offset_of!(StandardPacket, sp_Msg) - 0usize];
    ["Offset of field: StandardPacket::sp_Pkt"]
        [::core::mem::offset_of!(StandardPacket, sp_Pkt) - 20usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct ErrorString {
    pub estr_Nums: *mut LONG,
    pub estr_Strings: STRPTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ErrorString"][::core::mem::size_of::<ErrorString>() - 8usize];
    ["Alignment of ErrorString"][::core::mem::align_of::<ErrorString>() - 2usize];
    ["Offset of field: ErrorString::estr_Nums"]
        [::core::mem::offset_of!(ErrorString, estr_Nums) - 0usize];
    ["Offset of field: ErrorString::estr_Strings"]
        [::core::mem::offset_of!(ErrorString, estr_Strings) - 4usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct DosLibrary {
    pub dl_lib: Library,
    pub dl_Root: *mut RootNode,
    pub dl_GV: APTR,
    pub dl_A2: LONG,
    pub dl_A5: LONG,
    pub dl_A6: LONG,
    pub dl_Errors: *mut ErrorString,
    pub dl_TimeReq: *mut timerequest,
    pub dl_UtilityBase: *mut Library,
    pub dl_IntuitionBase: *mut Library,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DosLibrary"][::core::mem::size_of::<DosLibrary>() - 70usize];
    ["Alignment of DosLibrary"][::core::mem::align_of::<DosLibrary>() - 2usize];
    ["Offset of field: DosLibrary::dl_lib"][::core::mem::offset_of!(DosLibrary, dl_lib) - 0usize];
    ["Offset of field: DosLibrary::dl_Root"]
        [::core::mem::offset_of!(DosLibrary, dl_Root) - 34usize];
    ["Offset of field: DosLibrary::dl_GV"][::core::mem::offset_of!(DosLibrary, dl_GV) - 38usize];
    ["Offset of field: DosLibrary::dl_A2"][::core::mem::offset_of!(DosLibrary, dl_A2) - 42usize];
    ["Offset of field: DosLibrary::dl_A5"][::core::mem::offset_of!(DosLibrary, dl_A5) - 46usize];
    ["Offset of field: DosLibrary::dl_A6"][::core::mem::offset_of!(DosLibrary, dl_A6) - 50usize];
    ["Offset of field: DosLibrary::dl_Errors"]
        [::core::mem::offset_of!(DosLibrary, dl_Errors) - 54usize];
    ["Offset of field: DosLibrary::dl_TimeReq"]
        [::core::mem::offset_of!(DosLibrary, dl_TimeReq) - 58usize];
    ["Offset of field: DosLibrary::dl_UtilityBase"]
        [::core::mem::offset_of!(DosLibrary, dl_UtilityBase) - 62usize];
    ["Offset of field: DosLibrary::dl_IntuitionBase"]
        [::core::mem::offset_of!(DosLibrary, dl_IntuitionBase) - 66usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct RootNode {
    pub rn_TaskArray: BPTR,
    pub rn_ConsoleSegment: BPTR,
    pub rn_Time: DateStamp,
    pub rn_RestartSeg: LONG,
    pub rn_Info: BPTR,
    pub rn_FileHandlerSegment: BPTR,
    pub rn_CliList: MinList,
    pub rn_BootProc: *mut MsgPort,
    pub rn_ShellSegment: BPTR,
    pub rn_Flags: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RootNode"][::core::mem::size_of::<RootNode>() - 56usize];
    ["Alignment of RootNode"][::core::mem::align_of::<RootNode>() - 2usize];
    ["Offset of field: RootNode::rn_TaskArray"]
        [::core::mem::offset_of!(RootNode, rn_TaskArray) - 0usize];
    ["Offset of field: RootNode::rn_ConsoleSegment"]
        [::core::mem::offset_of!(RootNode, rn_ConsoleSegment) - 4usize];
    ["Offset of field: RootNode::rn_Time"][::core::mem::offset_of!(RootNode, rn_Time) - 8usize];
    ["Offset of field: RootNode::rn_RestartSeg"]
        [::core::mem::offset_of!(RootNode, rn_RestartSeg) - 20usize];
    ["Offset of field: RootNode::rn_Info"][::core::mem::offset_of!(RootNode, rn_Info) - 24usize];
    ["Offset of field: RootNode::rn_FileHandlerSegment"]
        [::core::mem::offset_of!(RootNode, rn_FileHandlerSegment) - 28usize];
    ["Offset of field: RootNode::rn_CliList"]
        [::core::mem::offset_of!(RootNode, rn_CliList) - 32usize];
    ["Offset of field: RootNode::rn_BootProc"]
        [::core::mem::offset_of!(RootNode, rn_BootProc) - 44usize];
    ["Offset of field: RootNode::rn_ShellSegment"]
        [::core::mem::offset_of!(RootNode, rn_ShellSegment) - 48usize];
    ["Offset of field: RootNode::rn_Flags"][::core::mem::offset_of!(RootNode, rn_Flags) - 52usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct CliProcList {
    pub cpl_Node: MinNode,
    pub cpl_First: LONG,
    pub cpl_Array: *mut *mut MsgPort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CliProcList"][::core::mem::size_of::<CliProcList>() - 16usize];
    ["Alignment of CliProcList"][::core::mem::align_of::<CliProcList>() - 2usize];
    ["Offset of field: CliProcList::cpl_Node"]
        [::core::mem::offset_of!(CliProcList, cpl_Node) - 0usize];
    ["Offset of field: CliProcList::cpl_First"]
        [::core::mem::offset_of!(CliProcList, cpl_First) - 8usize];
    ["Offset of field: CliProcList::cpl_Array"]
        [::core::mem::offset_of!(CliProcList, cpl_Array) - 12usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct DosInfo {
    pub di_McName: BPTR,
    pub di_DevInfo: BPTR,
    pub di_Devices: BPTR,
    pub di_Handlers: BPTR,
    pub di_NetHand: APTR,
    pub di_DevLock: SignalSemaphore,
    pub di_EntryLock: SignalSemaphore,
    pub di_DeleteLock: SignalSemaphore,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DosInfo"][::core::mem::size_of::<DosInfo>() - 158usize];
    ["Alignment of DosInfo"][::core::mem::align_of::<DosInfo>() - 2usize];
    ["Offset of field: DosInfo::di_McName"][::core::mem::offset_of!(DosInfo, di_McName) - 0usize];
    ["Offset of field: DosInfo::di_DevInfo"][::core::mem::offset_of!(DosInfo, di_DevInfo) - 4usize];
    ["Offset of field: DosInfo::di_Devices"][::core::mem::offset_of!(DosInfo, di_Devices) - 8usize];
    ["Offset of field: DosInfo::di_Handlers"]
        [::core::mem::offset_of!(DosInfo, di_Handlers) - 12usize];
    ["Offset of field: DosInfo::di_NetHand"]
        [::core::mem::offset_of!(DosInfo, di_NetHand) - 16usize];
    ["Offset of field: DosInfo::di_DevLock"]
        [::core::mem::offset_of!(DosInfo, di_DevLock) - 20usize];
    ["Offset of field: DosInfo::di_EntryLock"]
        [::core::mem::offset_of!(DosInfo, di_EntryLock) - 66usize];
    ["Offset of field: DosInfo::di_DeleteLock"]
        [::core::mem::offset_of!(DosInfo, di_DeleteLock) - 112usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct Segment {
    pub seg_Next: BPTR,
    pub seg_UC: LONG,
    pub seg_Seg: BPTR,
    pub seg_Name: [UBYTE; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Segment"][::core::mem::size_of::<Segment>() - 16usize];
    ["Alignment of Segment"][::core::mem::align_of::<Segment>() - 2usize];
    ["Offset of field: Segment::seg_Next"][::core::mem::offset_of!(Segment, seg_Next) - 0usize];
    ["Offset of field: Segment::seg_UC"][::core::mem::offset_of!(Segment, seg_UC) - 4usize];
    ["Offset of field: Segment::seg_Seg"][::core::mem::offset_of!(Segment, seg_Seg) - 8usize];
    ["Offset of field: Segment::seg_Name"][::core::mem::offset_of!(Segment, seg_Name) - 12usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct CommandLineInterface {
    pub cli_Result2: LONG,
    pub cli_SetName: BSTR,
    pub cli_CommandDir: BPTR,
    pub cli_ReturnCode: LONG,
    pub cli_CommandName: BSTR,
    pub cli_FailLevel: LONG,
    pub cli_Prompt: BSTR,
    pub cli_StandardInput: BPTR,
    pub cli_CurrentInput: BPTR,
    pub cli_CommandFile: BSTR,
    pub cli_Interactive: LONG,
    pub cli_Background: LONG,
    pub cli_CurrentOutput: BPTR,
    pub cli_DefaultStack: LONG,
    pub cli_StandardOutput: BPTR,
    pub cli_Module: BPTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CommandLineInterface"][::core::mem::size_of::<CommandLineInterface>() - 64usize];
    ["Alignment of CommandLineInterface"][::core::mem::align_of::<CommandLineInterface>() - 2usize];
    ["Offset of field: CommandLineInterface::cli_Result2"]
        [::core::mem::offset_of!(CommandLineInterface, cli_Result2) - 0usize];
    ["Offset of field: CommandLineInterface::cli_SetName"]
        [::core::mem::offset_of!(CommandLineInterface, cli_SetName) - 4usize];
    ["Offset of field: CommandLineInterface::cli_CommandDir"]
        [::core::mem::offset_of!(CommandLineInterface, cli_CommandDir) - 8usize];
    ["Offset of field: CommandLineInterface::cli_ReturnCode"]
        [::core::mem::offset_of!(CommandLineInterface, cli_ReturnCode) - 12usize];
    ["Offset of field: CommandLineInterface::cli_CommandName"]
        [::core::mem::offset_of!(CommandLineInterface, cli_CommandName) - 16usize];
    ["Offset of field: CommandLineInterface::cli_FailLevel"]
        [::core::mem::offset_of!(CommandLineInterface, cli_FailLevel) - 20usize];
    ["Offset of field: CommandLineInterface::cli_Prompt"]
        [::core::mem::offset_of!(CommandLineInterface, cli_Prompt) - 24usize];
    ["Offset of field: CommandLineInterface::cli_StandardInput"]
        [::core::mem::offset_of!(CommandLineInterface, cli_StandardInput) - 28usize];
    ["Offset of field: CommandLineInterface::cli_CurrentInput"]
        [::core::mem::offset_of!(CommandLineInterface, cli_CurrentInput) - 32usize];
    ["Offset of field: CommandLineInterface::cli_CommandFile"]
        [::core::mem::offset_of!(CommandLineInterface, cli_CommandFile) - 36usize];
    ["Offset of field: CommandLineInterface::cli_Interactive"]
        [::core::mem::offset_of!(CommandLineInterface, cli_Interactive) - 40usize];
    ["Offset of field: CommandLineInterface::cli_Background"]
        [::core::mem::offset_of!(CommandLineInterface, cli_Background) - 44usize];
    ["Offset of field: CommandLineInterface::cli_CurrentOutput"]
        [::core::mem::offset_of!(CommandLineInterface, cli_CurrentOutput) - 48usize];
    ["Offset of field: CommandLineInterface::cli_DefaultStack"]
        [::core::mem::offset_of!(CommandLineInterface, cli_DefaultStack) - 52usize];
    ["Offset of field: CommandLineInterface::cli_StandardOutput"]
        [::core::mem::offset_of!(CommandLineInterface, cli_StandardOutput) - 56usize];
    ["Offset of field: CommandLineInterface::cli_Module"]
        [::core::mem::offset_of!(CommandLineInterface, cli_Module) - 60usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct DeviceList {
    pub dl_Next: BPTR,
    pub dl_Type: LONG,
    pub dl_Task: *mut MsgPort,
    pub dl_Lock: BPTR,
    pub dl_VolumeDate: DateStamp,
    pub dl_LockList: BPTR,
    pub dl_DiskType: LONG,
    pub dl_unused: LONG,
    pub dl_Name: BSTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DeviceList"][::core::mem::size_of::<DeviceList>() - 44usize];
    ["Alignment of DeviceList"][::core::mem::align_of::<DeviceList>() - 2usize];
    ["Offset of field: DeviceList::dl_Next"][::core::mem::offset_of!(DeviceList, dl_Next) - 0usize];
    ["Offset of field: DeviceList::dl_Type"][::core::mem::offset_of!(DeviceList, dl_Type) - 4usize];
    ["Offset of field: DeviceList::dl_Task"][::core::mem::offset_of!(DeviceList, dl_Task) - 8usize];
    ["Offset of field: DeviceList::dl_Lock"]
        [::core::mem::offset_of!(DeviceList, dl_Lock) - 12usize];
    ["Offset of field: DeviceList::dl_VolumeDate"]
        [::core::mem::offset_of!(DeviceList, dl_VolumeDate) - 16usize];
    ["Offset of field: DeviceList::dl_LockList"]
        [::core::mem::offset_of!(DeviceList, dl_LockList) - 28usize];
    ["Offset of field: DeviceList::dl_DiskType"]
        [::core::mem::offset_of!(DeviceList, dl_DiskType) - 32usize];
    ["Offset of field: DeviceList::dl_unused"]
        [::core::mem::offset_of!(DeviceList, dl_unused) - 36usize];
    ["Offset of field: DeviceList::dl_Name"]
        [::core::mem::offset_of!(DeviceList, dl_Name) - 40usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct DevInfo {
    pub dvi_Next: BPTR,
    pub dvi_Type: LONG,
    pub dvi_Task: APTR,
    pub dvi_Lock: BPTR,
    pub dvi_Handler: BSTR,
    pub dvi_StackSize: LONG,
    pub dvi_Priority: LONG,
    pub dvi_Startup: LONG,
    pub dvi_SegList: BPTR,
    pub dvi_GlobVec: BPTR,
    pub dvi_Name: BSTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DevInfo"][::core::mem::size_of::<DevInfo>() - 44usize];
    ["Alignment of DevInfo"][::core::mem::align_of::<DevInfo>() - 2usize];
    ["Offset of field: DevInfo::dvi_Next"][::core::mem::offset_of!(DevInfo, dvi_Next) - 0usize];
    ["Offset of field: DevInfo::dvi_Type"][::core::mem::offset_of!(DevInfo, dvi_Type) - 4usize];
    ["Offset of field: DevInfo::dvi_Task"][::core::mem::offset_of!(DevInfo, dvi_Task) - 8usize];
    ["Offset of field: DevInfo::dvi_Lock"][::core::mem::offset_of!(DevInfo, dvi_Lock) - 12usize];
    ["Offset of field: DevInfo::dvi_Handler"]
        [::core::mem::offset_of!(DevInfo, dvi_Handler) - 16usize];
    ["Offset of field: DevInfo::dvi_StackSize"]
        [::core::mem::offset_of!(DevInfo, dvi_StackSize) - 20usize];
    ["Offset of field: DevInfo::dvi_Priority"]
        [::core::mem::offset_of!(DevInfo, dvi_Priority) - 24usize];
    ["Offset of field: DevInfo::dvi_Startup"]
        [::core::mem::offset_of!(DevInfo, dvi_Startup) - 28usize];
    ["Offset of field: DevInfo::dvi_SegList"]
        [::core::mem::offset_of!(DevInfo, dvi_SegList) - 32usize];
    ["Offset of field: DevInfo::dvi_GlobVec"]
        [::core::mem::offset_of!(DevInfo, dvi_GlobVec) - 36usize];
    ["Offset of field: DevInfo::dvi_Name"][::core::mem::offset_of!(DevInfo, dvi_Name) - 40usize];
};
#[repr(C, packed(2))]
#[derive(Copy, Clone)]
pub struct DosList {
    pub dol_Next: BPTR,
    pub dol_Type: LONG,
    pub dol_Task: *mut MsgPort,
    pub dol_Lock: BPTR,
    pub dol_misc: DosList__bindgen_ty_1,
    pub dol_Name: BSTR,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union DosList__bindgen_ty_1 {
    pub dol_handler: DosList__bindgen_ty_1__bindgen_ty_1,
    pub dol_volume: DosList__bindgen_ty_1__bindgen_ty_2,
    pub dol_assign: DosList__bindgen_ty_1__bindgen_ty_3,
}
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct DosList__bindgen_ty_1__bindgen_ty_1 {
    pub dol_Handler: BSTR,
    pub dol_StackSize: LONG,
    pub dol_Priority: LONG,
    pub dol_Startup: ULONG,
    pub dol_SegList: BPTR,
    pub dol_GlobVec: BPTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DosList__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<DosList__bindgen_ty_1__bindgen_ty_1>() - 24usize];
    ["Alignment of DosList__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<DosList__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Offset of field: DosList__bindgen_ty_1__bindgen_ty_1::dol_Handler"]
        [::core::mem::offset_of!(DosList__bindgen_ty_1__bindgen_ty_1, dol_Handler) - 0usize];
    ["Offset of field: DosList__bindgen_ty_1__bindgen_ty_1::dol_StackSize"]
        [::core::mem::offset_of!(DosList__bindgen_ty_1__bindgen_ty_1, dol_StackSize) - 4usize];
    ["Offset of field: DosList__bindgen_ty_1__bindgen_ty_1::dol_Priority"]
        [::core::mem::offset_of!(DosList__bindgen_ty_1__bindgen_ty_1, dol_Priority) - 8usize];
    ["Offset of field: DosList__bindgen_ty_1__bindgen_ty_1::dol_Startup"]
        [::core::mem::offset_of!(DosList__bindgen_ty_1__bindgen_ty_1, dol_Startup) - 12usize];
    ["Offset of field: DosList__bindgen_ty_1__bindgen_ty_1::dol_SegList"]
        [::core::mem::offset_of!(DosList__bindgen_ty_1__bindgen_ty_1, dol_SegList) - 16usize];
    ["Offset of field: DosList__bindgen_ty_1__bindgen_ty_1::dol_GlobVec"]
        [::core::mem::offset_of!(DosList__bindgen_ty_1__bindgen_ty_1, dol_GlobVec) - 20usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct DosList__bindgen_ty_1__bindgen_ty_2 {
    pub dol_VolumeDate: DateStamp,
    pub dol_LockList: BPTR,
    pub dol_DiskType: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DosList__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::size_of::<DosList__bindgen_ty_1__bindgen_ty_2>() - 20usize];
    ["Alignment of DosList__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::align_of::<DosList__bindgen_ty_1__bindgen_ty_2>() - 2usize];
    ["Offset of field: DosList__bindgen_ty_1__bindgen_ty_2::dol_VolumeDate"]
        [::core::mem::offset_of!(DosList__bindgen_ty_1__bindgen_ty_2, dol_VolumeDate) - 0usize];
    ["Offset of field: DosList__bindgen_ty_1__bindgen_ty_2::dol_LockList"]
        [::core::mem::offset_of!(DosList__bindgen_ty_1__bindgen_ty_2, dol_LockList) - 12usize];
    ["Offset of field: DosList__bindgen_ty_1__bindgen_ty_2::dol_DiskType"]
        [::core::mem::offset_of!(DosList__bindgen_ty_1__bindgen_ty_2, dol_DiskType) - 16usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct DosList__bindgen_ty_1__bindgen_ty_3 {
    pub dol_AssignName: STRPTR,
    pub dol_List: *mut AssignList,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DosList__bindgen_ty_1__bindgen_ty_3"]
        [::core::mem::size_of::<DosList__bindgen_ty_1__bindgen_ty_3>() - 8usize];
    ["Alignment of DosList__bindgen_ty_1__bindgen_ty_3"]
        [::core::mem::align_of::<DosList__bindgen_ty_1__bindgen_ty_3>() - 2usize];
    ["Offset of field: DosList__bindgen_ty_1__bindgen_ty_3::dol_AssignName"]
        [::core::mem::offset_of!(DosList__bindgen_ty_1__bindgen_ty_3, dol_AssignName) - 0usize];
    ["Offset of field: DosList__bindgen_ty_1__bindgen_ty_3::dol_List"]
        [::core::mem::offset_of!(DosList__bindgen_ty_1__bindgen_ty_3, dol_List) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DosList__bindgen_ty_1"][::core::mem::size_of::<DosList__bindgen_ty_1>() - 24usize];
    ["Alignment of DosList__bindgen_ty_1"]
        [::core::mem::align_of::<DosList__bindgen_ty_1>() - 2usize];
    ["Offset of field: DosList__bindgen_ty_1::dol_handler"]
        [::core::mem::offset_of!(DosList__bindgen_ty_1, dol_handler) - 0usize];
    ["Offset of field: DosList__bindgen_ty_1::dol_volume"]
        [::core::mem::offset_of!(DosList__bindgen_ty_1, dol_volume) - 0usize];
    ["Offset of field: DosList__bindgen_ty_1::dol_assign"]
        [::core::mem::offset_of!(DosList__bindgen_ty_1, dol_assign) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DosList"][::core::mem::size_of::<DosList>() - 44usize];
    ["Alignment of DosList"][::core::mem::align_of::<DosList>() - 2usize];
    ["Offset of field: DosList::dol_Next"][::core::mem::offset_of!(DosList, dol_Next) - 0usize];
    ["Offset of field: DosList::dol_Type"][::core::mem::offset_of!(DosList, dol_Type) - 4usize];
    ["Offset of field: DosList::dol_Task"][::core::mem::offset_of!(DosList, dol_Task) - 8usize];
    ["Offset of field: DosList::dol_Lock"][::core::mem::offset_of!(DosList, dol_Lock) - 12usize];
    ["Offset of field: DosList::dol_misc"][::core::mem::offset_of!(DosList, dol_misc) - 16usize];
    ["Offset of field: DosList::dol_Name"][::core::mem::offset_of!(DosList, dol_Name) - 40usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct AssignList {
    pub al_Next: *mut AssignList,
    pub al_Lock: BPTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AssignList"][::core::mem::size_of::<AssignList>() - 8usize];
    ["Alignment of AssignList"][::core::mem::align_of::<AssignList>() - 2usize];
    ["Offset of field: AssignList::al_Next"][::core::mem::offset_of!(AssignList, al_Next) - 0usize];
    ["Offset of field: AssignList::al_Lock"][::core::mem::offset_of!(AssignList, al_Lock) - 4usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct DevProc {
    pub dvp_Port: *mut MsgPort,
    pub dvp_Lock: BPTR,
    pub dvp_Flags: ULONG,
    pub dvp_DevNode: *mut DosList,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DevProc"][::core::mem::size_of::<DevProc>() - 16usize];
    ["Alignment of DevProc"][::core::mem::align_of::<DevProc>() - 2usize];
    ["Offset of field: DevProc::dvp_Port"][::core::mem::offset_of!(DevProc, dvp_Port) - 0usize];
    ["Offset of field: DevProc::dvp_Lock"][::core::mem::offset_of!(DevProc, dvp_Lock) - 4usize];
    ["Offset of field: DevProc::dvp_Flags"][::core::mem::offset_of!(DevProc, dvp_Flags) - 8usize];
    ["Offset of field: DevProc::dvp_DevNode"]
        [::core::mem::offset_of!(DevProc, dvp_DevNode) - 12usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct FileLock {
    pub fl_Link: BPTR,
    pub fl_Key: LONG,
    pub fl_Access: LONG,
    pub fl_Task: *mut MsgPort,
    pub fl_Volume: BPTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FileLock"][::core::mem::size_of::<FileLock>() - 20usize];
    ["Alignment of FileLock"][::core::mem::align_of::<FileLock>() - 2usize];
    ["Offset of field: FileLock::fl_Link"][::core::mem::offset_of!(FileLock, fl_Link) - 0usize];
    ["Offset of field: FileLock::fl_Key"][::core::mem::offset_of!(FileLock, fl_Key) - 4usize];
    ["Offset of field: FileLock::fl_Access"][::core::mem::offset_of!(FileLock, fl_Access) - 8usize];
    ["Offset of field: FileLock::fl_Task"][::core::mem::offset_of!(FileLock, fl_Task) - 12usize];
    ["Offset of field: FileLock::fl_Volume"]
        [::core::mem::offset_of!(FileLock, fl_Volume) - 16usize];
};
#[repr(C, packed(2))]
#[derive(Debug, Copy, Clone)]
pub struct DeviceData {
    pub dd_Device: Library,
    pub dd_Segment: APTR,
    pub dd_ExecBase: APTR,
    pub dd_CmdVectors: APTR,
    pub dd_CmdBytes: APTR,
    pub dd_NumCommands: UWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DeviceData"][::core::mem::size_of::<DeviceData>() - 52usize];
    ["Alignment of DeviceData"][::core::mem::align_of::<DeviceData>() - 2usize];
    ["Offset of field: DeviceData::dd_Device"]
        [::core::mem::offset_of!(DeviceData, dd_Device) - 0usize];
    ["Offset of field: DeviceData::dd_Segment"]
        [::core::mem::offset_of!(DeviceData, dd_Segment) - 34usize];
    ["Offset of field: DeviceData::dd_ExecBase"]
        [::core::mem::offset_of!(DeviceData, dd_ExecBase) - 38usize];
    ["Offset of field: DeviceData::dd_CmdVectors"]
        [::core::mem::offset_of!(DeviceData, dd_CmdVectors) - 42usize];
    ["Offset of field: DeviceData::dd_CmdBytes"]
        [::core::mem::offset_of!(DeviceData, dd_CmdBytes) - 46usize];
    ["Offset of field: DeviceData::dd_NumCommands"]
        [::core::mem::offset_of!(DeviceData, dd_NumCommands) - 50usize];
};
#[repr(C, packed(2))]
#[derive(Copy, Clone)]
pub struct PrinterData {
    pub pd_Device: DeviceData,
    pub pd_Unit: MsgPort,
    pub pd_PrinterSegment: BPTR,
    pub pd_PrinterType: UWORD,
    pub pd_SegmentData: *mut PrinterSegment,
    pub pd_PrintBuf: *mut UBYTE,
    pub pd_PWrite: FPTR,
    pub pd_PBothReady: FPTR,
    pub pd_ior0: PrinterData__bindgen_ty_1,
    pub pd_ior1: PrinterData__bindgen_ty_2,
    pub pd_TIOR: timerequest,
    pub pd_IORPort: MsgPort,
    pub pd_TC: Task,
    pub pd_OldStk: [UBYTE; 2048usize],
    pub pd_Flags: UBYTE,
    pub pd_pad: UBYTE,
    pub pd_Preferences: Preferences,
    pub pd_PWaitEnabled: UBYTE,
    pub pd_Flags1: UBYTE,
    pub pd_Stk: [UBYTE; 4096usize],
    pub pd_PUnit: *mut PrinterUnit,
    pub pd_PRead: FPTR,
    pub pd_CallErrHook: FPTR,
    pub pd_UnitNumber: ULONG,
    pub pd_DriverName: STRPTR,
    pub pd_PQuery: FPTR,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union PrinterData__bindgen_ty_1 {
    pub pd_p0: IOExtPar,
    pub pd_s0: IOExtSer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PrinterData__bindgen_ty_1"]
        [::core::mem::size_of::<PrinterData__bindgen_ty_1>() - 82usize];
    ["Alignment of PrinterData__bindgen_ty_1"]
        [::core::mem::align_of::<PrinterData__bindgen_ty_1>() - 2usize];
    ["Offset of field: PrinterData__bindgen_ty_1::pd_p0"]
        [::core::mem::offset_of!(PrinterData__bindgen_ty_1, pd_p0) - 0usize];
    ["Offset of field: PrinterData__bindgen_ty_1::pd_s0"]
        [::core::mem::offset_of!(PrinterData__bindgen_ty_1, pd_s0) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union PrinterData__bindgen_ty_2 {
    pub pd_p1: IOExtPar,
    pub pd_s1: IOExtSer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PrinterData__bindgen_ty_2"]
        [::core::mem::size_of::<PrinterData__bindgen_ty_2>() - 82usize];
    ["Alignment of PrinterData__bindgen_ty_2"]
        [::core::mem::align_of::<PrinterData__bindgen_ty_2>() - 2usize];
    ["Offset of field: PrinterData__bindgen_ty_2::pd_p1"]
        [::core::mem::offset_of!(PrinterData__bindgen_ty_2, pd_p1) - 0usize];
    ["Offset of field: PrinterData__bindgen_ty_2::pd_s1"]
        [::core::mem::offset_of!(PrinterData__bindgen_ty_2, pd_s1) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PrinterData"][::core::mem::size_of::<PrinterData>() - 6842usize];
    ["Alignment of PrinterData"][::core::mem::align_of::<PrinterData>() - 2usize];
    ["Offset of field: PrinterData::pd_Device"]
        [::core::mem::offset_of!(PrinterData, pd_Device) - 0usize];
    ["Offset of field: PrinterData::pd_Unit"]
        [::core::mem::offset_of!(PrinterData, pd_Unit) - 52usize];
    ["Offset of field: PrinterData::pd_PrinterSegment"]
        [::core::mem::offset_of!(PrinterData, pd_PrinterSegment) - 86usize];
    ["Offset of field: PrinterData::pd_PrinterType"]
        [::core::mem::offset_of!(PrinterData, pd_PrinterType) - 90usize];
    ["Offset of field: PrinterData::pd_SegmentData"]
